{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 103,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 103
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          0
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          1
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<bos>": 0,
      "<eos>": 1,
      "<pad>": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "(": 6,
      ")": 7,
      "*": 8,
      "+": 9,
      "-": 10,
      ".": 11,
      "/": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "6": 19,
      "7": 20,
      "8": 21,
      "9": 22,
      ":": 23,
      "<": 24,
      "=": 25,
      ">": 26,
      "?": 27,
      "@": 28,
      "B": 29,
      "C": 30,
      "F": 31,
      "H": 32,
      "I": 33,
      "N": 34,
      "O": 35,
      "P": 36,
      "S": 37,
      "[": 38,
      "\\": 39,
      "]": 40,
      "b": 41,
      "c": 42,
      "e": 43,
      "i": 44,
      "l": 45,
      "n": 46,
      "o": 47,
      "p": 48,
      "r": 49,
      "s": 50,
      "~": 51,
      "cc": 52,
      "CC": 53,
      "c1": 54,
      "O)": 55,
      "C(": 56,
      "=O)": 57,
      "c(": 58,
      "c2": 59,
      "C)": 60,
      "c1cc": 61,
      "C(=O)": 62,
      "c2cc": 63,
      "c3": 64,
      ")cc": 65,
      "(=O)": 66,
      "(C)": 67,
      "c1ccc(": 68,
      "2)": 69,
      "CO": 70,
      "C(=O)N": 71,
      "C1": 72,
      "CN": 73,
      "c1cccc": 74,
      "cn": 75,
      "F)": 76,
      "CCCC": 77,
      "n1": 78,
      "c3cc": 79,
      "c2cccc": 80,
      "CCN": 81,
      ")cc1": 82,
      "CC1": 83,
      "C2": 84,
      "Cl": 85,
      "C(C)": 86,
      "nc(": 87,
      "NC(=O)": 88,
      "3)": 89,
      "O=": 90,
      "c2ccccc2": 91,
      "c1ccccc1": 92,
      "(=O)N": 93,
      "CCO": 94,
      "[n": 95,
      "c2ccc(": 96,
      "H]": 97,
      "[nH]": 98,
      "N)": 99,
      "c1n": 100,
      "O=C(": 101,
      "CC(": 102,
      "S(=O)": 103,
      "c4": 104,
      "c3cccc": 105,
      "CCN(": 106,
      "c1cc(": 107,
      "n2": 108,
      "CC(=O)N": 109,
      "cc1": 110,
      "CC(C)": 111,
      "c1cccc(": 112,
      "Cl)": 113,
      "Cc1ccc(": 114,
      "c2)": 115,
      "c3ccccc3": 116,
      "c2c(": 117,
      "c2n": 118,
      "OC)": 119,
      "cc(": 120,
      "C3": 121,
      "(F)": 122,
      "F)cc": 123,
      ")N": 124,
      "CC2": 125,
      "CN(": 126,
      "COc1ccc(": 127,
      "Cc1": 128,
      "c(C)": 129,
      "c(=O)": 130,
      "cs": 131,
      "S(=O)(=O)": 132,
      "C=": 133,
      "cccc": 134,
      "c2ccccc2)": 135,
      "C(F)": 136,
      "2)c1": 137,
      "=O": 138,
      "CCC(": 139,
      "C#": 140,
      "Cc1cc": 141,
      "c2cc(": 142,
      "Cl)cc": 143,
      "c1)": 144,
      "O=C(N": 145,
      "C(F)(F)": 146,
      "c3ccc(": 147,
      "n(": 148,
      "CNC(=O)": 149,
      "Cn1": 150,
      "2)cc1": 151,
      "OC": 152,
      "Br": 153,
      "nc(-": 154,
      "S(=O)(=O)N": 155,
      "Cc1n": 156,
      "o1": 157,
      "c(-": 158,
      "CC2)": 159,
      "C(O)": 160,
      "nn": 161,
      "COC(=O)": 162,
      "CC(=O)": 163,
      "4)": 164,
      "Cc1ccccc1": 165,
      "CN1": 166,
      "CS": 167,
      "NC(=O)N": 168,
      "(C)C)": 169,
      "c2c1": 170,
      "N2": 171,
      "+]": 172,
      "CCC": 173,
      "C(N)": 174,
      "s1": 175,
      "ncc": 176,
      "nc1": 177,
      "N1": 178,
      "Cc1cc(": 179,
      "c3c(": 180,
      "cn1": 181,
      "c3)": 182,
      "C#N)": 183,
      "c2cccc(": 184,
      "F)cc1": 185,
      "c3ccccc3)": 186,
      "=N": 187,
      "C(C)C)": 188,
      "C2)": 189,
      "C(=O)O": 190,
      "CN(C)": 191,
      "n3": 192,
      "C(=O)N1": 193,
      "-]": 194,
      "CC3": 195,
      "c2cn": 196,
      "[N": 197,
      "c1cn": 198,
      "C(F)(F)F)": 199,
      "CCN(C(=O)": 200,
      "CC)": 201,
      "[O": 202,
      "[O-]": 203,
      "2)CC1": 204,
      "c12": 205,
      "[N+]": 206,
      "cc2": 207,
      "CC3)": 208,
      "nc2": 209,
      "c(N": 210,
      "CO)": 211,
      "c2c(c1)": 212,
      "c4cccc": 213,
      "C(=O)N2": 214,
      "CN2": 215,
      "Cc1cccc(": 216,
      ")N1": 217,
      "CCC1": 218,
      "c[nH]": 219,
      "CCCC1": 220,
      "c4cc": 221,
      "N=": 222,
      "Cl)cc1": 223,
      "C(=O)O)": 224,
      "CCOC(=O)": 225,
      "nc(C)": 226,
      "n(C)": 227,
      "CCNC(=O)": 228,
      "CCC2": 229,
      "CC(O)": 230,
      "co": 231,
      "CCn1": 232,
      "COc1cc(": 233,
      "cs1": 234,
      "CCN1": 235,
      "(O)": 236,
      "c1ccc(-": 237,
      "C(=": 238,
      "CCCO": 239,
      "N#": 240,
      "Cc2ccc(": 241,
      "c4ccccc4": 242,
      "CC(C)(C)": 243,
      "n2)": 244,
      "CCCCC1": 245,
      "Br)": 246,
      "c(OC)": 247,
      "c5": 248,
      "(=O)[O-]": 249,
      ")cc2": 250,
      "[N+](=O)[O-]": 251,
      "CCCN(": 252,
      "nc(N": 253,
      "COc1cc": 254,
      "C(C)(C)": 255,
      "=O)cc1": 256,
      "Cc2cc": 257,
      "c(Cl)": 258,
      "c1=O": 259,
      "C(C)(C)C)": 260,
      "c2ccccc21": 261,
      "O=C1": 262,
      "c(C)c1": 263,
      "c(O)": 264,
      "c(F)": 265,
      "n(-": 266,
      "N(": 267,
      "c3n": 268,
      "C3)": 269,
      "c1ccccc1)": 270,
      "C1CC1": 271,
      "c2ccc(F)cc": 272,
      "[nH]1": 273,
      "n2)cc1": 274,
      "C(C)=O)": 275,
      "C(N)=O)": 276,
      "CCC(=O)N": 277,
      "C4": 278,
      "c21": 279,
      "c1ccc2c(c1)": 280,
      "COc1cccc(": 281,
      ")ccc1": 282,
      "c(C(=O)N": 283,
      "CC2)cc1": 284,
      "c3cc(": 285,
      "COc1ccccc1": 286,
      "=C(": 287,
      "OC(": 288,
      "OC(=O)": 289,
      "C#N": 290,
      "OCO": 291,
      "cnc1": 292,
      "c2)cc1": 293,
      "2)n1": 294,
      "CCOCC1": 295,
      "C)cc1": 296,
      "nn1": 297,
      "CCCN": 298,
      "c1ccc(F)cc1": 299,
      "c2ccc(Cl)cc": 300,
      "(=O)=O)": 301,
      "Cc2ccccc2)": 302,
      "c1nc(": 303,
      "S(C)": 304,
      "CCCCCCCC": 305,
      "c1cccc2": 306,
      ")cc(": 307,
      "cc3": 308,
      "Cn2": 309,
      "c1ccc(Cl)cc1": 310,
      "c2nc(": 311,
      "c23)": 312,
      "CC(=O)N1": 313,
      "C2CCCC": 314,
      "NS(=O)(=O)": 315,
      "n1)": 316,
      "CCC(C)": 317,
      "c1cc2": 318,
      "C1=O": 319,
      "cc(-": 320,
      "Cc1cn": 321,
      "c1c(": 322,
      "ccc1": 323,
      "no": 324,
      "c2)c1": 325,
      "c3c(c2)": 326,
      "n3)": 327,
      "CCCC2": 328,
      "cccn": 329,
      "ncc1": 330,
      "c1ncc": 331,
      "Cc1cc(C)": 332,
      "CCC3": 333,
      "CCCC(": 334,
      "C(=O)NC(": 335,
      "Cc1ccccc1)": 336,
      "CC=": 337,
      "nc3": 338,
      "no1": 339,
      ")cc2)": 340,
      "ncn": 341,
      "CN(C(=O)": 342,
      "co1": 343,
      "c(NC(=O)": 344,
      "C(F)(F)F)cc": 345,
      "Cc2ccccc2": 346,
      "c2cccn": 347,
      "Cc1ccc(-": 348,
      "3)cc1": 349,
      "CC2)c1": 350,
      "c2n1": 351,
      "OCCO": 352,
      "CCO)": 353,
      "c(=O)[nH]": 354,
      "CC(F)": 355,
      "c2[nH]": 356,
      "c1C": 357,
      "cc2)": 358,
      "O=C(O)": 359,
      "c(N)": 360,
      "COc1ccc(-": 361,
      "3CCCC": 362,
      "c1ccc(NC(=O)": 363,
      "C(=O)N(": 364,
      "CCS": 365,
      "c3cccc(": 366,
      "OC1": 367,
      "c2ccc3c(c2)": 368,
      "c3ccc(F)cc": 369,
      "Cc1nc(": 370,
      "CC(NC(=O)": 371,
      "N(C)": 372,
      "c1ccc(O": 373,
      "2)C1": 374,
      "CC1)": 375,
      "CCc1n": 376,
      "c3cn": 377,
      "CCCN1": 378,
      "CNC(=O)N": 379,
      "C2CC2)": 380,
      "c2s": 381,
      "O1": 382,
      "oc(": 383,
      "CN(C)C(=O)": 384,
      "O)cc1": 385,
      "Cl)c1": 386,
      "c2nc(-": 387,
      "c1cc(-": 388,
      "CC4": 389,
      "c2=O)": 390,
      "C2)cc1": 391,
      "[N+](=O)[O-])": 392,
      "S(C)(=O)=O)": 393,
      "c2ccc(-": 394,
      "c2c(C)": 395,
      "c2ncn": 396,
      "CC(C)C)": 397,
      "c2cc3": 398,
      "F)c1": 399,
      "c(S": 400,
      "3)cc": 401,
      "C(=O)N(C)": 402,
      "c2ncc": 403,
      "c2ccc(C)": 404,
      "c2C)": 405,
      "CSc1n": 406,
      "OC)c1": 407,
      "sc1": 408,
      "CCN(CC)": 409,
      "CCN2": 410,
      "C1(": 411,
      "C(C)C": 412,
      "CCN(C)": 413,
      "NC(=O)C(": 414,
      "c2ccccc2)cc1": 415,
      "C2(": 416,
      "CCCNC(=O)": 417,
      "Cn1cc": 418,
      "3CCO": 419,
      "c2)CC1": 420,
      "c1ccc(N": 421,
      "CCN(C": 422,
      "c2ccccc12": 423,
      "nc(S": 424,
      "CC(F)(F)": 425,
      "c1nc(-": 426,
      "CC(=O)N2": 427,
      "S(=O)(=O)N2": 428,
      "C1=": 429,
      "c1ncn": 430,
      "c3ccc(Cl)cc": 431,
      "c1s": 432,
      "c3cccn": 433,
      "n2)c1": 434,
      "CCOc1ccc(": 435,
      "cccc2": 436,
      "CC(=O)N(": 437,
      "c4c(": 438,
      "c4ccc(": 439,
      "5)": 440,
      "c4ccccc4)": 441,
      "C1CCN(": 442,
      "P(=O)": 443,
      "c2cccs": 444,
      "CCOCC2)": 445,
      "c4)": 446,
      "C1CCCCC1": 447,
      "c2ccc(N": 448,
      "Cc1c(": 449,
      ")cc3)": 450,
      "Cn1cc(": 451,
      "n2cn": 452,
      "c1cccs1": 453,
      "CC4)": 454,
      "C(=S": 455,
      "cc(C)": 456,
      "CC(=O)O": 457,
      "CC1(C)": 458,
      "-c1ccccc1": 459,
      "c2cc(-": 460,
      "CC(N)": 461,
      "C1)": 462,
      "C3CC3)": 463,
      "c1cccnc1": 464,
      "F)c(F)": 465,
      "Br)cc1": 466,
      "CCC4": 467,
      "Cc1cs": 468,
      "O=S(=O)": 469,
      "cc3)": 470,
      "S(=O)(=O)N1": 471,
      "CCC(O)": 472,
      "c1c(C)": 473,
      "O=S(=O)(": 474,
      "OCC": 475,
      "C12": 476,
      "C1O": 477,
      "c1ccncc1": 478,
      "OC)c(OC)": 479,
      "n[nH]": 480,
      "c2cs": 481,
      "CC1(": 482,
      "C2=O)": 483,
      "C(=O)NCC": 484,
      "c2ccncc": 485,
      "CC(=O)O)": 486,
      "c(Cl)c1": 487,
      "c3ccc(F)cc3)": 488,
      "c2cccc(F)": 489,
      "nc2c1": 490,
      "CCCN(C(=O)": 491,
      "c2cc(C)": 492,
      "nn2": 493,
      "c2cccc3": 494,
      "c2)n1": 495,
      "c1cccc(-": 496,
      "C(=O)NC": 497,
      "CS(=O)(=O)": 498,
      "c2nc3ccccc3": 499,
      ")N(": 500,
      "(N)": 501,
      "C3CCCC": 502,
      "Cc1no": 503,
      "Cn1cn": 504,
      "c2cccc(Cl)": 505,
      "[n+]": 506,
      "c2ccco": 507,
      "c1ccccn1": 508,
      "c12)": 509,
      "ccc3": 510,
      "c1ccco1": 511,
      ")c1ccccc1": 512,
      "c1[nH]": 513,
      "OCC(=O)N": 514,
      "Cc1ccc(NC(=O)": 515,
      "C2)c1": 516,
      "ccc2": 517,
      "COc1cc2": 518,
      "NC(=O)C1": 519,
      "C(=N)": 520,
      "CCCN2": 521,
      "Cc3ccccc3)": 522,
      "c3[nH]": 523,
      "C(=O)C(": 524,
      "OC2": 525,
      "NC(": 526,
      "c2cc(Cl)cc": 527,
      "c1ccc(Cl)": 528,
      "c2o": 529,
      "c2ccc(F)cc2)": 530,
      "c3ncc": 531,
      "nc(NC(=O)": 532,
      "1)": 533,
      "c1O": 534,
      ")cc3": 535,
      "CC(C)O": 536,
      "CC#": 537,
      "c1-": 538,
      "n2cc": 539,
      "[O-])": 540,
      "c1=O)": 541,
      "s1)": 542,
      "c2cc1": 543,
      "C5": 544,
      "c(OC)c1": 545,
      "c(O": 546,
      "cc(C(=O)N": 547,
      "cn2": 548,
      "c2ccc(F)cc2": 549,
      "CCC2(": 550,
      "C=N": 551,
      "c1cs": 552,
      "c3ccco": 553,
      "s2)": 554,
      "c2ccc(Cl)cc2)": 555,
      "C1CCCC1": 556,
      "N=C(": 557,
      "CCCC(=O)N": 558,
      "c2c[nH]": 559,
      "c2cc(F)cc": 560,
      "Cc1cc2": 561,
      "3CCOCC3)": 562,
      "c3ccccc23)": 563,
      "c2nc(C)": 564,
      "(C)C": 565,
      "Cc1ccco1": 566,
      "CCc1ccc(": 567,
      "c(cc1": 568,
      "C(=O)OC)": 569,
      "C(F)(F)F)cc1": 570,
      "c1cccc(NC(=O)": 571,
      "(-": 572,
      "C4)": 573,
      "c2ccc(Cl)cc2": 574,
      "cc2)cc1": 575,
      "n4": 576,
      "C(O)C(O)": 577,
      "Cc1ccc(F)cc1": 578,
      "c(=O)n(": 579,
      "([O-])": 580,
      ")C(=O)": 581,
      "on1": 582,
      "nc(N)": 583,
      "P(=O)(O)": 584,
      "c2ccccn2)": 585,
      "C(NC(=O)": 586,
      "Cc2n": 587,
      "CN1CCN(": 588,
      "CC(N": 589,
      "S(N)": 590,
      "c3ccncc": 591,
      "c2ccc(O": 592,
      "CCCCC2)": 593,
      "c2ccccc2)c1": 594,
      "c1c[nH]": 595,
      "-n1": 596,
      "CC(F)(F)F)": 597,
      "c2ccccc2)CC1": 598,
      "n1-": 599,
      "ncc2": 600,
      "CCCn1": 601,
      "C(F)(F)F": 602,
      "c5cccc": 603,
      "cs3)": 604,
      "cn3)": 605,
      "c1cccc(Cl)c1": 606,
      "n2)CC1": 607,
      "Br)cc": 608,
      "(=O)=O": 609,
      "c(=O)n2": 610,
      "c3ccc(Cl)cc3)": 611,
      "c3ccco3)": 612,
      "Cc3ccccc3": 613,
      "c1cc(Cl)cc": 614,
      "c1ccc(N2": 615,
      "c1cc(C)": 616,
      "CCc1ccccc1": 617,
      "CN1C(=O)": 618,
      "C=C(": 619,
      "c(C#N)": 620,
      "c3ccc(C)": 621,
      "CNS(=O)(=O)": 622,
      "C(=S)N": 623,
      "Cc1ccc2c(c1)": 624,
      "COc1ccc(NC(=O)": 625,
      "Cc1nc(-": 626,
      "CCOc1ccccc1": 627,
      "c1cc(F)cc": 628,
      "c2ccc(O)": 629,
      "CCCC(C)": 630,
      "c1ccc(C(=O)N": 631,
      "C#N)cc1": 632,
      "CCC(=O)N1": 633,
      "c2c(=O)": 634,
      "C(=O)OC": 635,
      "CSc2n": 636,
      "c3cccnc3)": 637,
      "C(N)=O": 638,
      "CC(C(=O)N": 639,
      "c1cccc(C)": 640,
      "CC(O": 641,
      "Nc1n": 642,
      ")C1": 643,
      ")cc(OC)c1": 644,
      "o2)cc1": 645,
      "C(C)C(=O)N": 646,
      "nc12": 647,
      "c(N2": 648,
      "3C)": 649,
      "CCN1C(=O)": 650,
      "Cc1ccc(C(=O)N": 651,
      "CC1CN(": 652,
      "C=C": 653,
      "c1cccc(F)c1": 654,
      "CC(C)(": 655,
      "c2ccc(OC)": 656,
      "CC(C)(C)O": 657,
      "c2ccccc2n1": 658,
      "NCC": 659,
      "CC2(": 660,
      "C(O": 661,
      "CCCC2)": 662,
      "c2ccccc2)n1": 663,
      "C(C)NC(=O)": 664,
      ")N1CCN(": 665,
      "c1NC(=O)": 666,
      "c(=O)n(C)": 667,
      "c2)C1": 668,
      "c2ccccc2F)": 669,
      "CCCCN1": 670,
      "c3ccc4c(": 671,
      "c3s": 672,
      "c34)": 673,
      "Cc1ccc(Cl)cc1": 674,
      "c2=O)cc1": 675,
      "S)": 676,
      "c3ccccn3)": 677,
      "c23)cc1": 678,
      "c2c(c1": 679,
      "c1ccc(Br)cc1": 680,
      "3)c1": 681,
      "CCC(NC(=O)": 682,
      "c1ncccc1": 683,
      "CCC(N": 684,
      "c(F)c1": 685,
      "[nH]c(=O)": 686,
      "CCC(=O)": 687,
      "OCO2": 688,
      "C2=O)cc1": 689,
      "c3cccs3)": 690,
      "c(=O)o": 691,
      "CCNC(=O)N": 692,
      "C(C#N)": 693,
      "Cc2cn": 694,
      "Cc1noc(C)c1": 695,
      "CC(=O)Nc1ccc(": 696,
      "cn1)": 697,
      "C(F)(F)F)c1": 698,
      "c5ccccc5": 699,
      "OC)cc1": 700,
      "oc(-": 701,
      "CC12": 702,
      "c3ccncc3)": 703,
      "c2ccc(Cl)": 704,
      "nc2n1": 705,
      "C2CCN(": 706,
      "c2nc(N": 707,
      ")ccc2": 708,
      "Cc1nn(C)": 709,
      "C3=O)": 710,
      "c2cc(N": 711,
      "C)c1": 712,
      "c5cc": 713,
      "Cc1cc(NC(=O)": 714,
      "C(C)(C)C": 715,
      "n3cn": 716,
      "Br)c1": 717,
      "Cc1cccs1": 718,
      "CC(N)=O)": 719,
      "NC1": 720,
      "c3c2": 721,
      "o2)": 722,
      "c4cc(": 723,
      "CCCO1": 724,
      "OC(CO)": 725,
      "C=C1": 726,
      "Cc1ccc(C)": 727,
      "C(CO)": 728,
      "c2c(F)cc": 729,
      "F)c(": 730,
      "Cc1ccc(O": 731,
      "c2cccs2)": 732,
      "c2ccccc12)": 733,
      "Cc1c[nH]": 734,
      "CC(=O)N(C)": 735,
      "C2=N": 736,
      ")ccc1O": 737,
      "c2ncccc2": 738,
      "N=C(N)": 739,
      "Cc2ccc(F)cc": 740,
      "c2c(-": 741,
      "c3ccc4c(c3)": 742,
      "3CCN(": 743,
      "c2ccccc2c1": 744,
      "CCC3)": 745,
      "C(C)(": 746,
      "NC(=O)N2": 747,
      ")cc2)cc1": 748,
      "C2=O": 749,
      "C=C(C)": 750,
      "C2CCCCC2)": 751,
      "Cc2ccco": 752,
      "c2ccc(NC(=O)": 753,
      "N)cc1": 754,
      "N1CCN(": 755,
      "Cc3ccc(": 756,
      "OCO3)": 757,
      "CCCCC2": 758,
      "cnc1)": 759,
      "c1o": 760,
      "-c2n": 761,
      "CC2)n1": 762,
      "c2cccnc2)": 763,
      "c1nc2ccccc2": 764,
      "cccc3": 765,
      "Cc2cccc(": 766,
      "c(=O)[nH]1": 767,
      "C(N": 768,
      "N=C(O)": 769,
      "c3nn": 770,
      "COC(=O)C1": 771,
      "c3ncn": 772,
      "n12": 773,
      "c1nn": 774,
      "COC1": 775,
      "C(O)=N": 776,
      "s3)": 777,
      "(=O)=O)cc1": 778,
      "c2ccccc2Cl)": 779,
      "F)cccc1": 780,
      "cc4": 781,
      "Cc1cccnc1": 782,
      "C(=O)N1CCN(": 783,
      "S(N)(=O)=O)": 784,
      "c1ccccn1)": 785,
      "c2ccco2)": 786,
      "CCC(O": 787,
      "s2)cc1": 788,
      "CCS(=O)(=O)": 789,
      "n[nH]1": 790,
      "cn2)": 791,
      "c1nnc(": 792,
      "C(C)N": 793,
      "C(=O)NC(C)": 794,
      "3)cc2": 795,
      "CCOC(": 796,
      "N(C)C(=O)": 797,
      "c1ccc2[nH]": 798,
      "C(C)C)cc1": 799,
      "cccc1": 800,
      "c3cc4": 801,
      "c2ccs": 802,
      "NC(=O)N1": 803,
      "COc1ccc(OC)": 804,
      "C(=O)NC1": 805,
      "c2-": 806,
      "Cc1cc(=O)": 807,
      "n1C": 808,
      "Cc1noc(": 809,
      "C=C2": 810,
      "OCCO2": 811,
      "OCC1": 812,
      "C(C)=O": 813,
      "[N+](=O)[O-])cc1": 814,
      "[S": 815,
      "c6": 816,
      "c4cccc(": 817,
      "O)c1": 818,
      "c(=": 819,
      "C(=O)Nc1ccc(": 820,
      "-2": 821,
      "[nH]n1": 822,
      "c2ccc(C(=O)N": 823,
      "N#Cc1ccc(": 824,
      "Cc1cccc(NC(=O)": 825,
      "Cc1o": 826,
      "c3ccccc32)": 827,
      "c2C1": 828,
      "CCOCC2)cc1": 829,
      "C(=O)C1": 830,
      "c2ncc(": 831,
      "c1nc(N": 832,
      "CCCCO": 833,
      "C2=": 834,
      "O=C(NCC": 835,
      "Cc1n[nH]": 836,
      "CCn1cc(": 837,
      ")cc(OC)c1OC": 838,
      "CC(=O)NC(": 839,
      "c2cc(C(=O)N": 840,
      "ncc(": 841,
      "n2cccn": 842,
      "CCO1": 843,
      "c1ccc(-c2n": 844,
      "c1N": 845,
      "C(=O)N1CCC(": 846,
      "c1c(-": 847,
      ")ccc21": 848,
      "COc1ccc(C(=O)N": 849,
      "CCC#N)": 850,
      "C(=N": 851,
      "cc2)c1": 852,
      "Cc1cccc2": 853,
      "COc1ccc2c(c1)": 854,
      "c3ccc(-": 855,
      "C1CC1)": 856,
      "Cc1cc(C(=O)N": 857,
      "c2cccc(-": 858,
      "C(F)F)": 859,
      "c3cc(C)": 860,
      "CC(CC(": 861,
      "Cc1ccncc1": 862,
      "O2": 863,
      "c2cccc(C)": 864,
      "C2)n1": 865,
      "CC1=": 866,
      "nn3": 867,
      "nc1-": 868,
      "F)c(F)c1": 869,
      "[N+]([O-])": 870,
      "c2c(N": 871,
      "cc21": 872,
      "COc1cc(OC)": 873,
      "CS(=O)(=O)N": 874,
      "SCC(=O)N": 875,
      "c2ccncc2)": 876,
      "CCC)": 877,
      "CC(C)NC(=O)": 878,
      "c2cc3c(": 879,
      "c3ccc(N": 880,
      "N(C(=O)": 881,
      "nc21": 882,
      "c3cccc(F)": 883,
      "c3c(C)": 884,
      "CCN(CC)C(=O)": 885,
      "n3cc": 886,
      "CN3": 887,
      "(Cl)": 888,
      "c1ncc(": 889,
      "nnc1": 890,
      "S(C)(=O)=O": 891,
      "c(C(=O)": 892,
      "c3cccc(Cl)": 893,
      "ccn1": 894,
      "C2CCCN2": 895,
      "CCn2": 896,
      "O=S(=O)(N": 897,
      "4CCCC": 898,
      "nc(C(=O)N": 899,
      "Cc2cccn": 900,
      "CCOC(=O)C1": 901,
      "=C1": 902,
      "ccccc3": 903,
      "Cc2ccc(Cl)cc": 904,
      "C3(": 905,
      "O=C(CC": 906,
      "C(C(=O)N": 907,
      "CCN1CCN(": 908,
      "nn(C)": 909,
      "CC2CCCO": 910,
      "3CCCC3)": 911,
      "c(C(F)(F)F)": 912,
      "c3C)": 913,
      "Cc1ccc(S(=O)(=O)N": 914,
      "c1cccc(N": 915,
      "CCC(=O)O)": 916,
      "CCOCC1)": 917,
      "nc2ccccc21": 918,
      "c1nc(C)": 919,
      "c1cc2cccc": 920,
      "CCC(C(=O)N": 921,
      "nn2)cc1": 922,
      "sc2c1": 923,
      "Cn1c(=O)": 924,
      "c1nnc(-": 925,
      "c1cccc(O": 926,
      "cs2)": 927,
      "c(=O)n1": 928,
      "c1ccsc1": 929,
      "O=C1N": 930,
      "COC(=O)c1ccc(": 931,
      "S1": 932,
      "C2CC2)cc1": 933,
      "ncn1": 934,
      "Cc1nc(C)": 935,
      "c1ccccc1NC(=O)": 936,
      "c2ccc(Br": 937,
      "c1c(O)": 938,
      "c1ccc(C)cc1": 939,
      "c2cc(NC(=O)": 940,
      "cnn2": 941,
      "c2C)cc1": 942,
      "c3cc(Cl)cc": 943,
      "CCNS(=O)(=O)": 944,
      "c[nH]1": 945,
      "COc1ccc(Cl)cc1": 946,
      "C(=O)N2CCN(": 947,
      "nc2)": 948,
      "CCc1cc(": 949,
      "Cc1cc(-": 950,
      "COc1cccc2": 951,
      "C(C)O": 952,
      "Cn2cn": 953,
      "c2cccc(Cl)c2)": 954,
      "C1=O)": 955,
      "4CCO": 956,
      "O=c1[nH]": 957,
      "c(O)c1": 958,
      "N2CCN(": 959,
      "CCCO)": 960,
      "cn2)cc1": 961,
      "CC(C)n1": 962,
      "c3ccc(F)cc3": 963,
      "nnn2": 964,
      "c4cn": 965,
      "C1(C)": 966,
      "O=C(NC1": 967,
      "O=[N+]([O-])": 968,
      "(C(F)(F)F)": 969,
      "c3ccccc32)cc1": 970,
      ")cc21": 971,
      "CCC12": 972,
      "c1ccc(O)cc1": 973,
      ")C(=O)N": 974,
      "C(=O)O)cc1": 975,
      "CCCCCC1": 976,
      "(C)C)cc1": 977,
      "c1ccccc1F": 978,
      "c2F)": 979,
      "c3ccc(O)": 980,
      "C2(C)": 981,
      "c2cccc(F)c2)": 982,
      "Nc1nc(": 983,
      "c2c(O)": 984,
      "CCCN1C(=O)": 985,
      "C(O)C1O": 986,
      "oc2c1": 987,
      "C(=O)N1CCCC1": 988,
      "CCC3(": 989,
      "c2ncccn": 990,
      "c(C2": 991,
      "CCCC3": 992,
      "c2c(F)cccc2": 993,
      "n4)": 994,
      "n(CC(=O)N": 995,
      "n(C": 996,
      "c3cccc4": 997,
      "=C(O)": 998,
      "c(CN": 999,
      "CC1CCCCC1": 1000,
      "c(F)cc": 1001,
      "COc1ccc(-c2n": 1002,
      "C=CC(=O)": 1003,
      ")ccc3": 1004,
      "c2c(Cl)cc": 1005,
      "CCC2(C)": 1006,
      "CCC2)": 1007,
      "P(=O)(": 1008,
      "CCOc1cc(": 1009,
      "Cc1s": 1010,
      "c2ccc(S(=O)(=O)N": 1011,
      "c1cn(": 1012,
      "c2cncc": 1013,
      "C(=O)OC(C)(C)C)": 1014,
      "-c1n": 1015,
      "CCc1nc(": 1016,
      "OC3": 1017,
      "c1ccc(-n2": 1018,
      "cc(O)": 1019,
      "O=c1": 1020,
      "cc12": 1021,
      "COc1ccc(C2": 1022,
      "c2cccc(C(F)(F)F)": 1023,
      ")N1CCCC1": 1024,
      "c(C(=O)O)": 1025,
      "ncn2": 1026,
      "CCn1cn": 1027,
      "CN2CCN(": 1028,
      "N2CCOCC2)": 1029,
      "CCCCN": 1030,
      "c3ccc(Cl)cc3": 1031,
      "nc2-": 1032,
      "C4CC4)": 1033,
      "oc1": 1034,
      "c2ccccc2)C1": 1035,
      "CC(=": 1036,
      "c2nnc(": 1037,
      ")N1CCOCC1": 1038,
      "c2ccc3ccccc3": 1039,
      "c2cc(O)": 1040,
      "Cc1ccc(O)cc1": 1041,
      "C(=O)C2": 1042,
      ")ccn1": 1043,
      "C=O)": 1044,
      "c3ccc(O": 1045,
      "c3cccnc3": 1046,
      "CN(C)S(=O)(=O)": 1047,
      "COc2ccccc2": 1048,
      "CC2)CC1": 1049,
      ")ccc1F": 1050,
      "CCn1cc": 1051,
      "c2n(": 1052,
      "O=C(Cn1": 1053,
      "C1=N": 1054,
      "Cc1cc(C)cc(": 1055,
      "CCCCn1": 1056,
      "c(Cl)cc": 1057,
      "COc1cc2c(cc1": 1058,
      "c1cccc(C(=O)N": 1059,
      "o2)c1": 1060,
      "c(S(=O)(=O)N": 1061,
      "C2O)": 1062,
      "Cc1c(C(=O)N": 1063,
      ")N1CCC(": 1064,
      "c1ccccc1)c1ccccc1": 1065,
      "N2C(=O)": 1066,
      "COc1cc(C)": 1067,
      "CCC2(CC1)": 1068,
      "3CCOCC3": 1069,
      "c1ccc(C)": 1070,
      "Cc1cccc(C)": 1071,
      "CC(C)=": 1072,
      "[nH]c2c1": 1073,
      "ncc3": 1074,
      "c1cc(F)ccc1": 1075,
      "C3CCCCC3)": 1076,
      "s2)c1": 1077,
      "c1cc(N": 1078,
      "nc1C": 1079,
      "CN1CCN(C(=O)": 1080,
      "3CCCC3": 1081,
      "CCc2ccccc2": 1082,
      "c4ccc(F)cc": 1083,
      "c2cc(Cl)ccc2": 1084,
      "ccccc12": 1085,
      "C2CC2)c1": 1086,
      "C2CC3": 1087,
      "CCOCC2": 1088,
      "c(SCC(=O)N": 1089,
      "c1c(Cl)cc": 1090,
      "c1ccc(F)cc1)": 1091,
      "c1ccc(Cl)cc1)": 1092,
      "3)CC1": 1093,
      "C(=N)N": 1094,
      "n(-c2ccccc2)": 1095,
      "CCC(=O)N2": 1096,
      "c1ccc(F)": 1097,
      "c3cc(F)cc": 1098,
      "CCOC1": 1099,
      "c1ccccc1O": 1100,
      "nn12": 1101,
      "c1ccccc1Cl": 1102,
      "o3)": 1103,
      "CC#N)": 1104,
      "c2c1)": 1105,
      "CC(O)(": 1106,
      "Cc1[nH]": 1107,
      "[n+]1": 1108,
      "CCc3ccccc3": 1109,
      "O=C(C=": 1110,
      "CCC3(C)": 1111,
      "c1ccc2c(c1)OCO2": 1112,
      "O=C(NCC1": 1113,
      "c2ccc3": 1114,
      "CCCCNC(=O)": 1115,
      "CC5": 1116,
      "N1CCOCC1": 1117,
      "n(-c3ccccc3)": 1118,
      "c4[nH]": 1119,
      "c1c(F)cccc1": 1120,
      "ccc21": 1121,
      "c(C)n1": 1122,
      "nc(SCC(=O)N": 1123,
      "Cc1ccc(N": 1124,
      "CCC(N)": 1125,
      "CCCO3)": 1126,
      "C(C)=O)cc1": 1127,
      "c2nn": 1128,
      "N1C(=O)": 1129,
      "COCCNC(=O)": 1130,
      "Cc2ccc(-": 1131,
      "c2ccc(C#N": 1132,
      "nc1N": 1133,
      "c3ccccc3F)": 1134,
      "C(N)=O)cc1": 1135,
      "O=C(O": 1136,
      "Cn1c(": 1137,
      "COC(": 1138,
      "c2cnn(C)": 1139,
      "c1cc2c(": 1140,
      "n3cccn": 1141,
      "Cc2ccc3c(c2)": 1142,
      "Cc2cc(": 1143,
      "nc3)": 1144,
      "C23": 1145,
      "CCOCC2)c1": 1146,
      "=C2": 1147,
      "O=C(CSc1n": 1148,
      "COCCO": 1149,
      ")N(C)": 1150,
      "c2=O)c1": 1151,
      "c(=O)[nH]c1=O": 1152,
      "Cc1cccc(-": 1153,
      "N3": 1154,
      "c2ccccc2c1=O": 1155,
      "C(OC(C)=O)": 1156,
      "c1ccc(S(=O)(=O)N": 1157,
      "c3ccs": 1158,
      "nnn1": 1159,
      "c4n": 1160,
      "cn3": 1161,
      "Cc1ccc(-n2": 1162,
      ")cc2)c1": 1163,
      "c3=O)": 1164,
      "c1nc2c(": 1165,
      "CC(CO)": 1166,
      "C3CCCC3)": 1167,
      "CS(=O)(=O)N1": 1168,
      "c1ccc(F)c(F)c1": 1169,
      "N)c1": 1170,
      "FC(F)(F)": 1171,
      "c3ccc(OC)": 1172,
      "c3nc4ccccc4": 1173,
      "CC(S": 1174,
      "c1cc(=O)": 1175,
      "Cc1cc(N": 1176,
      "3CCCCC3)": 1177,
      "c([N+](=O)[O-])": 1178,
      "c2ccc(C(F)(F)F)cc": 1179,
      "n3C)": 1180,
      "Cc1ccccc1)N": 1181,
      "CC(=N": 1182,
      "O=C(Nc1ccccc1": 1183,
      "CCCS": 1184,
      "CN(C": 1185,
      "NC(=O)N(C)": 1186,
      "c2ccc(F)c(F)": 1187,
      "C(C)(C)C)cc1": 1188,
      "c2c3c(": 1189,
      "Cc1ccsc1": 1190,
      "CC1CC1": 1191,
      "no2)": 1192,
      "Cl)c(Cl)": 1193,
      "CCC(C)(C)": 1194,
      "c2nc3c(": 1195,
      "C(Cc1ccccc1)": 1196,
      "OC)c(OC)c(OC)": 1197,
      "CCCC(=O)": 1198,
      "c1cc(Cl)ccc1": 1199,
      "COc1ccc(F)cc1": 1200,
      "C2CCCC2)": 1201,
      "C(C)S": 1202,
      "Cn2cc": 1203,
      "c1cc(C(=O)N": 1204,
      "c2cco": 1205,
      "CC(C)(O)": 1206,
      "COc1cccc(-": 1207,
      "c(-c3ccccc3)": 1208,
      "N1CCCC1": 1209,
      "[S+]": 1210,
      ")cc(-": 1211,
      "CCC=": 1212,
      "C(C)C)c1": 1213,
      "Cc1csc(": 1214,
      "C(O)(": 1215,
      ")cc12": 1216,
      "c1nccs1": 1217,
      "=C(N)": 1218,
      "n2)n1": 1219,
      "c2[nH]1": 1220,
      "O2)": 1221,
      "Cc1nc2ccccc2": 1222,
      "F)c1)": 1223,
      "OCO4)": 1224,
      "n2c1": 1225,
      "COc1ccc(CNC(=O)": 1226,
      "CC1CCCO1": 1227,
      "c1cnn(-": 1228,
      "c2ccc3c(c2)OCO3)": 1229,
      "(C)C3": 1230,
      "c1cc2c(cc1": 1231,
      "c2nnc(-": 1232,
      "c2cccc3cccc": 1233,
      "c32)": 1234,
      "c(-c2ccccc2)": 1235,
      "COc1ccc(C(=O)": 1236,
      "o1)": 1237,
      "C(=O)N2CCC(": 1238,
      "CCN3": 1239,
      "c3cccc(Cl)c3)": 1240,
      "C2C1": 1241,
      "4)CC3)": 1242,
      "c3cccc(F)c3)": 1243,
      "C2)CC1": 1244,
      "nc(O)": 1245,
      "CCCC3)": 1246,
      "C2)C1": 1247,
      "c4ccccc43)": 1248,
      "OCc1ccccc1": 1249,
      "CC(OC(=O)": 1250,
      "CCC(CC)": 1251,
      "nc1)": 1252,
      "c3ccccc23)cc1": 1253,
      "nnc(-": 1254,
      "Cc1nn(C)c(C)c1": 1255,
      "n2C)": 1256,
      "OC(C)(C)C)": 1257,
      "CCC1(": 1258,
      "CCc2ccccc21": 1259,
      "CC2)C1": 1260,
      "C2O": 1261,
      "COc1ccc(N": 1262,
      "COc1ccc(S(=O)(=O)N": 1263,
      "CNC(=O)C1": 1264,
      "CCc2c(": 1265,
      "C2CC2": 1266,
      "CC(NC(=O)N": 1267,
      "C=CCn1": 1268,
      "c2ccc([N+](=O)[O-]": 1269,
      "c2c1=O": 1270,
      "[nH]2)": 1271,
      "P(=O)(O)O)": 1272,
      "nc4": 1273,
      "CC1O": 1274,
      "c4ccccc34)": 1275,
      "c4ccc(Cl)cc": 1276,
      "P(=O)(O)O": 1277,
      "NC(=O)c1ccc(": 1278,
      "nc1S": 1279,
      "COC(=O)N": 1280,
      "CN(CC": 1281,
      "cs2)cc1": 1282,
      "O=C(C1": 1283,
      "cc(N": 1284,
      "c1ccc(F)cc1F": 1285,
      "OC(CO)C(O)C(O)": 1286,
      "c2C)c1": 1287,
      "CC1CCN(": 1288,
      "c(Br)": 1289,
      "Cc1ccc(N2": 1290,
      "c2s1": 1291,
      "ccc1O": 1292,
      "c2)cn1": 1293,
      "C=CCNC(=O)": 1294,
      "Cc1cccnc1)": 1295,
      "c3ccc(C)cc3)": 1296,
      "nc2)cc1": 1297,
      "[nH]c1": 1298,
      "c2ccc(F)cc2)CC1": 1299,
      "CN2C(=O)": 1300,
      "n1cn": 1301,
      "c2n[nH]": 1302,
      "OCO2)": 1303,
      ")cc2)CC1": 1304,
      "O=C(CS": 1305,
      "CC(F)F)": 1306,
      "ccc12": 1307,
      "CCCCCCCCCCCC": 1308,
      "c2ccc(C)cc2)": 1309,
      "Cc1cc(F)cc": 1310,
      "nc2ccccc12": 1311,
      "Nc1ncn": 1312,
      "CC1=C(": 1313,
      "Cc1cn(": 1314,
      "NC(=O)CO": 1315,
      "c1ccc(C(F)(F)F)cc1": 1316,
      "c2cc3c(cc2": 1317,
      "c2ccc3[nH]": 1318,
      "OCCO3)": 1319,
      "S(C)(=O)=O)cc1": 1320,
      "c2ccc(F)": 1321,
      "c2cc1OC": 1322,
      "no2)cc1": 1323,
      "nc(N2": 1324,
      ")NC1": 1325,
      "n(C)n1": 1326,
      "I)": 1327,
      "c1ccc(OC)cc1": 1328,
      "n2)C1": 1329,
      "Cc2ccco2)": 1330,
      "2)c1C": 1331,
      "C(=O)OCC(=O)N": 1332,
      "C(=O)N2CCCC": 1333,
      "c4cccn": 1334,
      "Cc1ccc(CNC(=O)": 1335,
      "CC(=O)OC1": 1336,
      "COc1ccc(C)cc1": 1337,
      "Cc1ncc": 1338,
      "C3CC3": 1339,
      "CC(=O)N1CCN(": 1340,
      "Cc1c(C)": 1341,
      "Cc1ncc(": 1342,
      "N=C1": 1343,
      "c2c[nH]c3ccccc23)": 1344,
      "c2ccccc2-": 1345,
      "c1n[nH]": 1346,
      "c2cc(S(=O)(=O)N": 1347,
      "Cc1ccco1)": 1348,
      ")cc(=O)": 1349,
      "c1cncc(": 1350,
      "cn(": 1351,
      "c3nc(C)": 1352,
      "nc2s": 1353,
      "c(N3": 1354,
      "Cc1cc(C)n(": 1355,
      "C21": 1356,
      "c1cc(Cl)": 1357,
      "2)ccc1": 1358,
      "c3c(N": 1359,
      "c1cccnc1)": 1360,
      "Cc1nn(": 1361,
      "COc1cc(-": 1362,
      "CC)c1": 1363,
      "C(=O)c1ccccc1": 1364,
      "CC(C)O1": 1365,
      "nn1C": 1366,
      "c2nc(N)": 1367,
      "Cc2ccccc2)cc1": 1368,
      "c1cccc2c1": 1369,
      "C(=O)Nc1ccccc1": 1370,
      "C(OC(=O)": 1371,
      "Cc2ccncc": 1372,
      "c2)s1": 1373,
      "CC=C(": 1374,
      "Cc1cccc(O": 1375,
      "c3c(F)cc": 1376,
      "c1cnn(": 1377,
      "c1ccc2c(c1)OCCO2": 1378,
      "cc2)CC1": 1379,
      "c2cc(=O)": 1380,
      "n2n1": 1381,
      "C2=C(": 1382,
      "c3nc(-": 1383,
      "C(=O)N(C)C)": 1384,
      "Nc1ccc(": 1385,
      "c2cccnc2": 1386,
      "c3ncccc3": 1387,
      "COCCN1": 1388,
      "c2cccc(O": 1389,
      "c3cco": 1390,
      ")NC(=O)": 1391,
      "CCCCN(": 1392,
      "CCC(=O)O": 1393,
      "Cc2ccccc2)CC1": 1394,
      "nn2)": 1395,
      "Cl)c1)": 1396,
      "c1ncn2": 1397,
      "cc(OC)": 1398,
      "c2cc(OC)": 1399,
      "c3cc(-": 1400,
      "c2cc(F)": 1401,
      "c2cc(Cl)": 1402,
      "C2CO": 1403,
      "c2cccc3ccccc23)": 1404,
      "Cc2ccc(O)": 1405,
      "Nc1ccccc1": 1406,
      "c1ccc(C#N)cc1": 1407,
      "C2=O)c1": 1408,
      "Cc2ccc(F)cc2)": 1409,
      "C#N)c1": 1410,
      "c1ccc2c(c1": 1411,
      "c3ccccc3Cl)": 1412,
      "4CCOCC4)": 1413,
      "c1cc(NC(=O)": 1414,
      "C1CCC2": 1415,
      "C(C)NC(=O)N": 1416,
      "c1ccc2ccccc2c1": 1417,
      "n2cc(": 1418,
      "C(=N)N)": 1419,
      "c3ccccc3)CC2)": 1420,
      "CCCC2=O)": 1421,
      "3CCCCC3": 1422,
      "COC(=O)C(": 1423,
      "n1cc": 1424,
      "n2c(": 1425,
      "ccc4": 1426,
      "c3ncccn3)": 1427,
      "S(=O)(=O)N(C)": 1428,
      "S(=O)(=O)c1ccccc1": 1429,
      "c1cccc(C(F)(F)F)c1": 1430,
      "C(c2ccccc2)": 1431,
      "CC1CCN(C(=O)": 1432,
      "[nH]1)": 1433,
      "CC1CN(C(=O)": 1434,
      "CC(=O)NC1": 1435,
      "c2nc(-c3ccccc3)": 1436,
      "CCc2ccccc2)": 1437,
      "O=C(CNC(=O)": 1438,
      "CCC(C)NC(=O)": 1439,
      "c3cs": 1440,
      "c(Cl)c2)": 1441,
      "c2ccc(F)cc2F)": 1442,
      "OCCCO": 1443,
      "c(C)o1": 1444,
      "c1ccc(-n2cn": 1445,
      "CC(C)c1n": 1446,
      "Cc1nnc(": 1447,
      "CC(F)(F)F": 1448,
      "c2c(C)no": 1449,
      "c1ccc(CN": 1450,
      ")ccc1=O": 1451,
      "c3c2)": 1452,
      "CCN(C)C)": 1453,
      "c3c[nH]": 1454,
      "c2cn(": 1455,
      "C2CCN(C(=O)": 1456,
      "C3)C1)": 1457,
      "Cc1nc(N": 1458,
      "Cc1c[nH]c2ccccc12)": 1459,
      "CCCO1)": 1460,
      "Cc1c(-": 1461,
      "c(=O)c2c1": 1462,
      "CCCCN1C(=O)": 1463,
      "c2ccc(Br)cc2)": 1464,
      "s2)CC1": 1465,
      "C=CC(=O)N": 1466,
      "Cc4cc": 1467,
      "c2cc(O": 1468,
      "C)n1": 1469,
      "n(C)c1": 1470,
      "c2ccc(F)cc2)cc1": 1471,
      "N#Cc1cccc(": 1472,
      "Cn1nn": 1473,
      "CC(=O)NC(C)": 1474,
      "N1CCN(C(=O)": 1475,
      "S(=O)(=O)N2CCCC": 1476,
      "c1cc(O)": 1477,
      "O=C(COC(=O)": 1478,
      "c2ccc(=O)": 1479,
      "COCCN(": 1480,
      "CCCCC3)": 1481,
      "Cc1cc(Cl)cc": 1482,
      "nn3)": 1483,
      "c2o1": 1484,
      "N(C)C)": 1485,
      "c3ccc(Br": 1486,
      "C3O)": 1487,
      "C(=O)N1CCN(C(=O)": 1488,
      "NC(=O)CS": 1489,
      "Cc1ccc(-c2n": 1490,
      "c2cn3": 1491,
      "C1CCN(C(=O)": 1492,
      "[nH]2)cc1": 1493,
      "CC1CC1)": 1494,
      "c3cc4c(": 1495,
      ")C(=O)O": 1496,
      "c1nc(-c2ccccc2)": 1497,
      "c1ccc(Cl)c(Cl)c1": 1498,
      "c3nc(": 1499,
      "Cc1ccccc1)C(=O)": 1500,
      "NC1=O": 1501,
      "COc1ccc(O": 1502,
      "c1ccc(O)": 1503,
      "NC(=O)N(": 1504,
      "cc2c1": 1505,
      "O=C(CC1": 1506,
      "c3ccc4c(c3)OCO4)": 1507,
      "CC(C)N(": 1508,
      "c1cn2": 1509,
      "cc2)n1": 1510,
      "[N+](C)": 1511,
      "CCC(=O)N(": 1512,
      "c(C(=O)N2": 1513,
      "c2ccccn2)cc1": 1514,
      "c1ccc([N+](=O)[O-])cc1": 1515,
      ")N2": 1516,
      "O=C(CN1": 1517,
      "C(=O)C=": 1518,
      "no3)": 1519,
      "CO1": 1520,
      "c(N)c1": 1521,
      "4)cc3)": 1522,
      "C3)cc1": 1523,
      "3)cc2)": 1524,
      "CC(C)C(": 1525,
      "CC(=O)N1CCCC1": 1526,
      "OCc1ccccc1)": 1527,
      "C4CCCC": 1528,
      "CC(C#N)": 1529,
      "Cc2ccc(C)": 1530,
      "SC)": 1531,
      "COc1cc2c(cc1OC)": 1532,
      "Cn1nc(": 1533,
      "c2cnn(": 1534,
      "CCN2C(=O)": 1535,
      "Cc2cs": 1536,
      "C1CCCCC1)": 1537,
      "Cn3": 1538,
      "c(=O)c1": 1539,
      "CC3CC(CC(": 1540,
      "CC5)": 1541,
      "O=C(Nc1cccc(": 1542,
      "C(F)F": 1543,
      "CC(C)N": 1544,
      "COC)": 1545,
      "c1c(C)[nH]": 1546,
      "CCCCCCCCCCCCCCCC": 1547,
      "c3cncc": 1548,
      "c1ccc(-n2cc": 1549,
      "C=NNC(=O)": 1550,
      "cnc2": 1551,
      "3)cc2)cc1": 1552,
      "c(C)c(C)": 1553,
      "c3ccccc32)c1": 1554,
      "CCCCC1)": 1555,
      "CN(CC(=O)N": 1556,
      "sc1C": 1557,
      "c(=O)n2C": 1558,
      "Nc1cc": 1559,
      "C(C(=O)O)": 1560,
      "c2cccc(OC)": 1561,
      "c1cc(-c2ccccc2)": 1562,
      "-n1cn": 1563,
      "Cc1nn": 1564,
      "CCc1noc(": 1565,
      "21": 1566,
      "c1sccc1": 1567,
      "ccc2c1": 1568,
      ")Nc1ccccc1": 1569,
      "c1ccccc1F)": 1570,
      "cn2)c1": 1571,
      "COc1cccc(C(=O)N": 1572,
      "O=C(c1cc": 1573,
      ")cc2c1": 1574,
      "C2C3": 1575,
      "C(=O)OCC)": 1576,
      "c3cccc(C)": 1577,
      "cc(OC)c1": 1578,
      "nnc1-": 1579,
      "CCc1ccccc1)": 1580,
      "OC(C)": 1581,
      "nnc(": 1582,
      "OC4": 1583,
      "c(CNC(=O)": 1584,
      "CC21": 1585,
      "c2ncnc(N": 1586,
      "c1ccc(OC": 1587,
      "c2ccccc21)": 1588,
      "c2sccc2": 1589,
      "c1cnccn1": 1590,
      "C(F)(F)F)cc3)": 1591,
      "CCOc1ccc(NC(=O)": 1592,
      "CC3CC(CC(C3)C1)": 1593,
      "c2ccc(OC)cc2)": 1594,
      "c1)C(=O)": 1595,
      "NC(=O)NC(C)": 1596,
      "C2CCCN(": 1597,
      "CC2CC2)": 1598,
      "COc1c(": 1599,
      "CCOC(=O)C1=": 1600,
      "6)": 1601,
      "OC(C)(C)": 1602,
      "cn12": 1603,
      "=CC(=O)": 1604,
      "CCOC)": 1605,
      "cc(=O)": 1606,
      "CC(=O)N1CCC(": 1607,
      "[n+]2": 1608,
      "c2co": 1609,
      "CC(C)CC(NC(=O)": 1610,
      "CCn1nc(C)": 1611,
      "c2ccc(C)cc2": 1612,
      "C(Cl)": 1613,
      ")N1CCCCC1": 1614,
      "c(C)s1": 1615,
      "c2no": 1616,
      "c32)cc1": 1617,
      ")cc2)n1": 1618,
      "c1cccc2ccccc12": 1619,
      "nnn1-": 1620,
      "c5ccccc5)": 1621,
      "c3ccsc3)": 1622,
      "Cc1cnn(": 1623,
      "c2c(N)": 1624,
      "c2cccc(O)": 1625,
      "c1cccc(Br)c1": 1626,
      "CC2CCC1": 1627,
      "Cc1occc1": 1628,
      "c2ccc(F)cc2)c1": 1629,
      "CC(C)CNC(=O)": 1630,
      "CC3CC3)": 1631,
      "C2CCCO": 1632,
      "c3ccccc3)cc2)": 1633,
      "COc1cc(N": 1634,
      "cn2)CC1": 1635,
      "C2CCCN2C(=O)": 1636,
      "O=C(Nc1cc": 1637,
      "c2Cl)": 1638,
      "C(=O)NC(Cc1ccccc1)": 1639,
      "c(C3": 1640,
      "c1ccc(CN2": 1641,
      "c2cc3ccccc3": 1642,
      "COc1ccc(CN": 1643,
      "N1CCC(": 1644,
      "Cc1ccc(O)": 1645,
      "cc2c(": 1646,
      "CN1CCC(": 1647,
      "Cc1cn2": 1648,
      ")ccc1Cl": 1649,
      "[n+](": 1650,
      "CCS(=O)(=O)N": 1651,
      "COC(=O)c1cc(": 1652,
      "C=CCN(": 1653,
      "COc1ccc(-n2": 1654,
      "C(=O)N(C)C": 1655,
      "c5c(": 1656,
      "cc(Cl)": 1657,
      "C(C)C1": 1658,
      "C(C)(O)": 1659,
      "n3cccn3)": 1660,
      "N=C(N)N": 1661,
      "c3cc(O)": 1662,
      "CCN1CCOCC1": 1663,
      "c23)c1": 1664,
      "Oc1ccccc1": 1665,
      "c1csc(-": 1666,
      "Cc1ccc(S(=O)(=O)": 1667,
      "c(F)c(F)": 1668,
      "Cc1c(F)cccc1": 1669,
      "c1co": 1670,
      "c3ccc4ccccc4": 1671,
      "c3o": 1672,
      "C2CC(=O)N(": 1673,
      "N#Cc1ccccc1": 1674,
      "c(-c3ccc(": 1675,
      "CCOc1cccc(": 1676,
      "nc2)c1": 1677,
      "CC(C)C": 1678,
      "COCCN": 1679,
      "cc4)": 1680,
      "=C(N": 1681,
      "Cc2ccc(Cl)cc2)": 1682,
      "ncnc21": 1683,
      "CC1(O)": 1684,
      "c2cccc(Br)": 1685,
      "Cn1ccnc1": 1686,
      "CC3(": 1687,
      "Cc1cc(O)": 1688,
      "NC(=S)N": 1689,
      "N2CCCC": 1690,
      "c(=S)": 1691,
      "n(C)c1=O": 1692,
      "c2ccccn2)c1": 1693,
      "Oc1ccc(": 1694,
      "[nH]3)": 1695,
      "c2cc(C(F)(F)F)cc": 1696,
      "oc1C": 1697,
      "S)N": 1698,
      "O3)": 1699,
      "c2ccc(O)cc2)": 1700,
      "nc3n2": 1701,
      "CCc1o": 1702,
      "C(C)=": 1703,
      "c1cccs1)": 1704,
      "C(=O)N2CCCC2": 1705,
      "CC1CCC(": 1706,
      "COc1ccc(OC)c(": 1707,
      "OCC2": 1708,
      "CCCC(=O)N1": 1709,
      "c2cn[nH]": 1710,
      "CCOCCO": 1711,
      "n(C)c(=O)": 1712,
      "sc3": 1713,
      "c23)CC1": 1714,
      "C1CCCN(": 1715,
      "Cc1ccc(S(=O)(=O)N2": 1716,
      "C5)": 1717,
      "nn2)c1": 1718,
      "-c1ccc(": 1719,
      "COc1cccc(NC(=O)": 1720,
      "CCN(CC(=O)N": 1721,
      "S)=N": 1722,
      "cc(Cl)cc": 1723,
      "CN(C)C(=O)N": 1724,
      "CCc2ccccc2C1": 1725,
      "C2CCC1": 1726,
      "OC(CO": 1727,
      "COc1cc(C(=O)N": 1728,
      "c2ncn(": 1729,
      "C(CO": 1730,
      "Cc2c(": 1731,
      "c1ccc2c(": 1732,
      "Cc1csc(NC(=O)": 1733,
      "Cc1ccccc1F)": 1734,
      "CCC43C)": 1735,
      "c1c(Cl)cccc1": 1736,
      "c1ccccc1Cl)": 1737,
      "CC1=O": 1738,
      "Cc1nnc(NC(=O)": 1739,
      "Cn1cc(-": 1740,
      "nc2c(": 1741,
      "c2cccc(N": 1742,
      "Cc1ccc(C(=O)": 1743,
      "OCC)": 1744,
      "c4ccc(F)cc4)": 1745,
      "n2nc(C)": 1746,
      "c2ccc(Cl)cc2)cc1": 1747,
      "c2nnnn2": 1748,
      "c5)": 1749,
      "c3cc(F)ccc3": 1750,
      "c2ccc(F)cc2)n1": 1751,
      "Cc4ccccc4)": 1752,
      "C(=O)N2CC": 1753,
      "Br)cc(": 1754,
      "c2cc(F)ccc2": 1755,
      "nccc1": 1756,
      ")C2": 1757,
      "O=C1CC(": 1758,
      "CCC(O)(": 1759,
      "c1cn(-": 1760,
      "C(C)CO)": 1761,
      "c2ccc(Cl)cc2)CC1": 1762,
      "Cc2ccccc2)c1": 1763,
      "Cn1ncc2": 1764,
      "Cc1cccc(C(=O)N": 1765,
      ")C1CC1": 1766,
      "Cc1c(Cl)cc": 1767,
      "c2ccc(Cl)cc2Cl)": 1768,
      "CCc3ccccc3)": 1769,
      "C(c1ccccc1)": 1770,
      "S2": 1771,
      "C(N)=O)c1": 1772,
      "c(Cl)cc1": 1773,
      "c3cnccn3)": 1774,
      "3)ccc21": 1775,
      "c4ncc": 1776,
      "Cc2ccccc2F)": 1777,
      "OCCO2)": 1778,
      "NC(=O)c1ccccc1": 1779,
      "cs2)c1": 1780,
      "C3CCO": 1781,
      "CCS(=O)(=O)N1": 1782,
      "C4)C2)": 1783,
      "CSc1ccc(": 1784,
      "c3c(F)cccc3": 1785,
      "[nH]c1=O": 1786,
      "2)s1": 1787,
      "Cc2cccs2)": 1788,
      "ccccc12)": 1789,
      "C2CCCN(C(=O)": 1790,
      "c2cc(Br)cc": 1791,
      "Cc2cc3": 1792,
      "Cc1cccc(F)c1": 1793,
      "S(N)(=O)=O)cc1": 1794,
      "c(=N": 1795,
      "C(O)C1": 1796,
      "c2cccc(C#N)": 1797,
      "c2cccc(NC(=O)": 1798,
      "C2CCC": 1799,
      "c(NC(=O)N": 1800,
      "CCN(C)C(=O)": 1801,
      "COc2ccc(": 1802,
      "c3cc(Cl)ccc3": 1803,
      "c2ccc3c(": 1804,
      "Cc2cccnc2)": 1805,
      "CCNC2": 1806,
      "CC1OC(": 1807,
      "c1c(N": 1808,
      "c3ccccc3)cc2": 1809,
      ")cc4)": 1810,
      "C(=O)N1CCCC(": 1811,
      "(C)C)c1": 1812,
      "C3(C)": 1813,
      "nc(C)c1": 1814,
      "c1cc(C(F)(F)F)cc": 1815,
      "n(-c2ccccc2)n1": 1816,
      "CCc1c(C)": 1817,
      "CSc1nnc(-": 1818,
      "c2cccnc2)cc1": 1819,
      "Cc1ccc(Cl)": 1820,
      "C5(C)": 1821,
      "c2c(Cl)cccc2": 1822,
      "N2CCN(C(=O)": 1823,
      "c2ccc(N3": 1824,
      "c2ccccc2C)": 1825,
      "c3)cc2": 1826,
      "OCC1OC(": 1827,
      "c2cccc(N)": 1828,
      "[N+](=O)[O-])c1": 1829,
      "c1nc(N)": 1830,
      "nc2s1": 1831,
      "CCCc2ccccc21": 1832,
      "COc1ccccc1NC(=O)": 1833,
      "c3cc4c(cc3": 1834,
      "CCC4(C)C3": 1835,
      "c1cccc(C)c1": 1836,
      "c2cc(C)o": 1837,
      "c3ccc(O)cc3)": 1838,
      "c3cccc(C(F)(F)F)": 1839,
      "CC(C)C(=O)N": 1840,
      "no2)c1": 1841,
      "CCC(CO)": 1842,
      "c1ccc(=O)": 1843,
      "c2)o1": 1844,
      "3CCCC3=O)": 1845,
      "CCl": 1846,
      "CN)": 1847,
      "C1CCC1": 1848,
      "c4ccncc": 1849,
      ")cc4": 1850,
      "cc(Br)": 1851,
      "C(C)O)": 1852,
      "ccccc4": 1853,
      "COC(=O)C1=": 1854,
      "CCCC1)": 1855,
      "CC4CC(CC(": 1856,
      "c3ccccn3": 1857,
      "c-2": 1858,
      "cs1)": 1859,
      "c4ccco": 1860,
      "Cc1ccc(NC(=O)N": 1861,
      ")NCC2": 1862,
      "Cc1n[nH]c(C)c1": 1863,
      "CC(=O)Nc1cccc(": 1864,
      "c2nccn2": 1865,
      "cnc2c1": 1866,
      "O=C(Nc1ccc(": 1867,
      "c2cn(C)": 1868,
      "C2CCO": 1869,
      "c3cc2": 1870,
      ")N1CC": 1871,
      "C1C": 1872,
      "CC2=O)cc1": 1873,
      "C(=O)N3": 1874,
      "-n1cc": 1875,
      "CC(C)C(NC(=O)": 1876,
      "C2)cn1": 1877,
      "c2cccs2)cc1": 1878,
      "CN(C)c1ccc(": 1879,
      "c(OC": 1880,
      "CC2)cn1": 1881,
      "nc2C)": 1882,
      "c2cc(-c3ccccc3)": 1883,
      "NC(=O)CNC(=O)": 1884,
      "C2CC2)CC1": 1885,
      "CCCN3": 1886,
      "CN2CCN(C(=O)": 1887,
      "nn(": 1888,
      "CC(O)CO": 1889,
      "c2ccc3n": 1890,
      "cnc12": 1891,
      "c23": 1892,
      "C(=O)O1": 1893,
      "CCn1c(=O)": 1894,
      "c(Br)c1": 1895,
      "c3ccccc3C)": 1896,
      "csc1": 1897,
      "=O)N": 1898,
      "c2ccccc21)N": 1899,
      "c2cccnc21": 1900,
      "c1cc(C)ccc1": 1901,
      "c1c2c(": 1902,
      "cnc3": 1903,
      "CC2=O)": 1904,
      "C=CC(": 1905,
      "Cn1cccc1": 1906,
      "CO2": 1907,
      "c2nc(NC(=O)": 1908,
      "CCCN(CCC)": 1909,
      "OCO4": 1910,
      "CCC3(CC2)": 1911,
      "oc(=O)": 1912,
      "CC)C(=O)": 1913,
      "nn1-": 1914,
      "N#CC(": 1915,
      "c2ccccn2": 1916,
      "Cc1nc2c(": 1917,
      "C#CCNC(=O)": 1918,
      "c2)cc1OC": 1919,
      "Cc3cn": 1920,
      "c2scc": 1921,
      "CCNCC1": 1922,
      "c2sc3c(": 1923,
      "c3nccs3)": 1924,
      "c3c(Cl)cc": 1925,
      "c2ccncc2)cc1": 1926,
      "CC2CCCO2)": 1927,
      "nnnc2": 1928,
      "c1ccc(Cl)cc1Cl": 1929,
      "Cc2ccc(O": 1930,
      "CCCNC(=O)N": 1931,
      "CN(C(=O)N": 1932,
      "O=C1c2ccccc2": 1933,
      "sc2n1": 1934,
      ")cc(C)": 1935,
      "C(=O)N1CCCCC1": 1936,
      "c3cc(N": 1937,
      "C2C(": 1938,
      "Cc1ccccc1O": 1939,
      "CC(C)C1": 1940,
      "Br)ccc1": 1941,
      "c1ccc(NC(=O)N": 1942,
      "Nc1cc(": 1943,
      "COc1ncccc1": 1944,
      "CCCC)": 1945,
      "CCC(C)(": 1946,
      "2Cl)": 1947,
      "c3ccc(OC)cc3)": 1948,
      "Cn2cccn": 1949,
      "Cc1ccc(Br)cc1": 1950,
      "c2cc(F)cc(F)": 1951,
      "N=C2": 1952,
      "n3cncn3)": 1953,
      "CCc1cccc(": 1954,
      "c2ccc(NC(=O)N": 1955,
      "cn1)N": 1956,
      "COCCCNC(=O)": 1957,
      "COc1cc(NC(=O)": 1958,
      "c2cccc3c2": 1959,
      "Cc1co": 1960,
      "CCCCC2)cc1": 1961,
      "c4c3": 1962,
      "c4ccccn4)": 1963,
      "C(=O)OCC": 1964,
      "c(Cl)c1)": 1965,
      "c13)": 1966,
      "CCC21": 1967,
      "CC(=O)N1CC": 1968,
      "CC4CC(CC(C4)C2)": 1969,
      "c1cnc(-": 1970,
      "Cc2ccccc2Cl)": 1971,
      "c2)cs1": 1972,
      "CO)cc1": 1973,
      "c2c1C": 1974,
      "Cc1cccc(N": 1975,
      "c(CO": 1976,
      "n2cccc": 1977,
      "(F)c1": 1978,
      "Cc1c(Cl)cccc1": 1979,
      "C(F)F)cc1": 1980,
      "c2cnc(N": 1981,
      "oc12": 1982,
      "COc1ccc2[nH]": 1983,
      "C3CCCCC3": 1984,
      "C3CCC4": 1985,
      "c1ccncc1)": 1986,
      "c2ccc(C(=O)O)": 1987,
      "C=CC1": 1988,
      "c2)no1": 1989,
      "C(F)F)cc": 1990,
      "c2ccc(Br)cc": 1991,
      "CCCCN)": 1992,
      "CC(C)(C)C)": 1993,
      "c3ccoc3)": 1994,
      "c2ccc3c(c2)OCCO3)": 1995,
      "(Cl)c1": 1996,
      "CC(C)OC(=O)": 1997,
      "sc1)": 1998,
      "C2CCCCC2": 1999,
      "c(N)n1": 2000,
      "c1ccccc1-": 2001,
      "n2)s1": 2002,
      "CCCC(O)": 2003,
      "CN2CCOCC2)": 2004,
      "CCC4)": 2005,
      "Cc1cc(C)n(-": 2006,
      "c1ccccc12": 2007,
      "c1ccccc1)N": 2008,
      "c2ccccn12": 2009,
      "cnn1": 2010,
      "c1nc2ccccc2s1": 2011,
      "c1nn(-": 2012,
      "C2CC2)n1": 2013,
      "OCc2ccccc2)": 2014,
      "O1)": 2015,
      "CCC(C)C)": 2016,
      "c1ccco1)": 2017,
      "C(CC)": 2018,
      "C2CN(": 2019,
      "cc(C(=O)": 2020,
      "CCN(S(=O)(=O)": 2021,
      "C(CC(C)C)": 2022,
      "CC(C)N1": 2023,
      "[N-]": 2024,
      "CCCC2)cc1": 2025,
      "CC3CCCO3)": 2026,
      "cc(-c3ccccc3)": 2027,
      "4CCOCC4": 2028,
      "c(C(C)(C)C)": 2029,
      "COCCn1": 2030,
      "CCNC(=O)C1": 2031,
      "C(N)=N": 2032,
      "CC1=N": 2033,
      "c(C)cc1": 2034,
      "nn(-": 2035,
      "c3ccc(C)cc3": 2036,
      "c2ccc(Br)cc2": 2037,
      "(CC)": 2038,
      "Cc1cn(-": 2039,
      "c2ncccn2)CC1": 2040,
      "c1cc(F)ccc1F": 2041,
      "c2ccnc(N": 2042,
      "C12CC3CC(CC(C3)C1)": 2043,
      "Cc1c(N": 2044,
      "c1c(NC(=O)": 2045,
      "c34": 2046,
      "c2c(F)cccc2F)": 2047,
      "CCCN(C(=O)N": 2048,
      "c3ccccn2": 2049,
      "CCO2": 2050,
      "c4cccnc4)": 2051,
      ")N1CCCC(": 2052,
      "c2ccn": 2053,
      "CC=C(C)": 2054,
      "Cc2ccc3c(c2)OCO3)": 2055,
      "c(C(N)=O)": 2056,
      "C=NN": 2057,
      "c2c(C)cccc2": 2058,
      "COc1ccc(NC(=O)N": 2059,
      "Cc1noc(-": 2060,
      "Cc1nnc(S": 2061,
      "c3c(O)": 2062,
      "=N1": 2063,
      "c(C": 2064,
      "C2(O)": 2065,
      "CCOC(=O)N": 2066,
      "c1c(C(=O)N": 2067,
      "c2=O)CC1": 2068,
      "S(=O)(=O)O)": 2069,
      "Cc1ccc(F)cc1)": 2070,
      "nc(O": 2071,
      "CCCC2(": 2072,
      "Cc1ccc2[nH]": 2073,
      "n2)cn1": 2074,
      "Cc1ccccn1": 2075,
      "C=CCN": 2076,
      "O=C(NN=": 2077,
      "Cc1cc(C(=O)N2": 2078,
      "c3ccc(C#N": 2079,
      "CCC2)c1": 2080,
      "Cc1cccc(Cl)c1": 2081,
      "C5CCC43C)": 2082,
      "c3c(N)": 2083,
      "C(C)=O)c1": 2084,
      "c2cccc(C(F)(F)F)c2)": 2085,
      "N1CCCCC1": 2086,
      "c1=O)N": 2087,
      "c1cn(C)": 2088,
      "c1ccc(-c2cs": 2089,
      "Cn1c(-": 2090,
      "Cc1csc(-": 2091,
      "C(=NO)": 2092,
      "COc1ccc(CCNC(=O)": 2093,
      "O=C(COc1ccccc1": 2094,
      "C1CCCC1)": 2095,
      "CC(=O)NCC": 2096,
      "Cc1ccccc1NC(=O)": 2097,
      "Cc2ccc(OC)": 2098,
      "CCC(N)=O)": 2099,
      "c1ccc(CNC(=O)": 2100,
      "c2O)": 2101,
      "c1nc2ccccc2[nH]1": 2102,
      "CN=C(O)": 2103,
      "c2ccccc2)o1": 2104,
      "C2CCCCC2)cc1": 2105,
      "CCN(CCO)": 2106,
      "C3=N": 2107,
      "c3sccc3": 2108,
      "O=c1cc(": 2109,
      "c2c1ncn2": 2110,
      "c2ccc(C)cc2)cc1": 2111,
      "COc1cc(C2": 2112,
      "Cc1cccc(C)c1": 2113,
