{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 103,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 103
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 4,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 4,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 20,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 89,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 197,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "(\\[[^\\]]+]|<|Br?|Cl?|N|O|S|P|F|I|b|c|n|o|s|p|\\(|\\)|\\.|=|#|-|\\+|\\\\\\\\|\\/|:|~|@|\\?|>|\\*|\\$|\\%[0-9]{2}|[0-9])"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          197
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          20
        ],
        "tokens": [
          "<eos>"
        ]
      },
      "<unk>": {
        "id": "<unk>",
        "ids": [
          89
        ],
        "tokens": [
          "<unk>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[O-]": 0,
      "%66": 1,
      "%83": 2,
      "[NH3+]": 3,
      "<pad>": 4,
      "[BH3-]": 5,
      "%54": 6,
      "[B-]": 7,
      "[CH2+]": 8,
      "[n+]": 9,
      "6": 10,
      ":": 11,
      "%45": 12,
      "Cl": 13,
      "%43": 14,
      "%17": 15,
      "%92": 16,
      "=": 17,
      "[I+3]": 18,
      "1": 19,
      "<eos>": 20,
      "[CH]": 21,
      "%90": 22,
      "-": 23,
      "[Br+2]": 24,
      "<": 25,
      "(": 26,
      "Br": 27,
      "[Cl+3]": 28,
      "[I+2]": 29,
      "%64": 30,
      "%29": 31,
      "n": 32,
      "b": 33,
      "[P-]": 34,
      "[SiH2]": 35,
      "%15": 36,
      "%01": 37,
      "[O+]": 38,
      "[N-]": 39,
      "[cH-]": 40,
      "%65": 41,
      "%77": 42,
      "%82": 43,
      "%08": 44,
      "4": 45,
      "[Si]": 46,
      "%12": 47,
      "[I+]": 48,
      "%87": 49,
      "[SeH]": 50,
      "%88": 51,
      "[S+]": 52,
      "[se+]": 53,
      "%32": 54,
      "%20": 55,
      "[Se]": 56,
      "%04": 57,
      "%18": 58,
      "5": 59,
      "+": 60,
      "%62": 61,
      "[F-]": 62,
      "%69": 63,
      "\\": 64,
      "%48": 65,
      "%60": 66,
      "%99": 67,
      "[OH+]": 68,
      "[": 69,
      "[S-]": 70,
      "[c+]": 71,
      "%81": 72,
      "[P+]": 73,
      "%14": 74,
      "[SH-]": 75,
      "[Cl-]": 76,
      "[nH]": 77,
      "%31": 78,
      "[SH+]": 79,
      ".": 80,
      "p": 81,
      "%56": 82,
      "[O]": 83,
      "s": 84,
      "%50": 85,
      "[B]": 86,
      "%19": 87,
      "%21": 88,
      "<unk>": 89,
      "%02": 90,
      "%41": 91,
      "%94": 92,
      "[SH]": 93,
      "[o+]": 94,
      "[n-]": 95,
      "%70": 96,
      "%97": 97,
      "[Si-]": 98,
      "[PH2+]": 99,
      "%27": 100,
      "#": 101,
      "%36": 102,
      "%63": 103,
      "[F+]": 104,
      "$": 105,
      "8": 106,
      "[c-]": 107,
      "%98": 108,
      "[C-]": 109,
      "%96": 110,
      "[Cl+]": 111,
      "[cH+]": 112,
      "[Br-]": 113,
      "2": 114,
      "%39": 115,
      "o": 116,
      "%06": 117,
      "%67": 118,
      "%80": 119,
      "%16": 120,
      "N": 121,
      "/": 122,
      "%58": 123,
      "%78": 124,
      "[Se+]": 125,
      "%52": 126,
      "%23": 127,
      "F": 128,
      "%55": 129,
      "%79": 130,
      "%46": 131,
      "[IH]": 132,
      "%73": 133,
      "P": 134,
      "%51": 135,
      "%93": 136,
      "[SeH2]": 137,
      "@": 138,
      "[CH+]": 139,
      "C": 140,
      "%37": 141,
      "[IH2]": 142,
      "%59": 143,
      "%61": 144,
      "[b-]": 145,
      "%49": 146,
      "[BH2-]": 147,
      "[CH2]": 148,
      "%10": 149,
      "[NH+]": 150,
      "[CH-]": 151,
      "%09": 152,
      "%07": 153,
      "]": 154,
      "%68": 155,
      "%38": 156,
      "%53": 157,
      "%74": 158,
      "%85": 159,
      "9": 160,
      "%05": 161,
      "%11": 162,
      "[BH-]": 163,
      "[se]": 164,
      "*": 165,
      "%40": 166,
      "[NH-]": 167,
      "%28": 168,
      "[SiH]": 169,
      ">": 170,
      "%35": 171,
      "%33": 172,
      "%30": 173,
      "0": 174,
      "[NH2+]": 175,
      "[I-]": 176,
      "[SiH-]": 177,
      "%91": 178,
      "%42": 179,
      "%13": 180,
      "S": 181,
      "[nH+]": 182,
      "%22": 183,
      ")": 184,
      "I": 185,
      "%26": 186,
      "[PH]": 187,
      "[Se-]": 188,
      "%75": 189,
      "c": 190,
      "%25": 191,
      "7": 192,
      "%71": 193,
      "%44": 194,
      "3": 195,
      "%89": 196,
      "<bos>": 197,
      "%84": 198,
      "%34": 199,
      "%76": 200,
      "[s+]": 201,
      "%47": 202,
      "%95": 203,
      "[N]": 204,
      "?": 205,
      "B": 206,
      "%57": 207,
      "~": 208,
      "%72": 209,
      "%86": 210,
      "[N+]": 211,
      "%24": 212,
      "[Cl+2]": 213,
      "[C+]": 214,
      "%03": 215,
      "%00": 216,
      "O": 217
    },
    "unk_token": "<unk>"
  }
}