{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 128,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 128
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": "(\\[[^\\]]+]|<|Br?|Cl?|N|O|S|P|F|I|b|c|n|o|s|p|\\(|\\)|\\.|=|#|-|\\+|\\\\\\\\|\\/|:|~|@|\\?|>|\\*|\\$|\\%[0-9]{2}|[0-9])"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<bos>": 1,
      "<eos>": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "(": 6,
      ")": 7,
      "*": 8,
      "+": 9,
      "-": 10,
      ".": 11,
      "/": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "6": 19,
      "7": 20,
      "8": 21,
      "9": 22,
      ":": 23,
      "<": 24,
      "=": 25,
      ">": 26,
      "?": 27,
      "@": 28,
      "B": 29,
      "C": 30,
      "F": 31,
      "H": 32,
      "I": 33,
      "N": 34,
      "O": 35,
      "P": 36,
      "S": 37,
      "[": 38,
      "\\": 39,
      "]": 40,
      "b": 41,
      "c": 42,
      "e": 43,
      "i": 44,
      "l": 45,
      "n": 46,
      "o": 47,
      "p": 48,
      "r": 49,
      "s": 50,
      "~": 51,
      "cc": 52,
      "CC": 53,
      "c1": 54,
      "O)": 55,
      "C(": 56,
      "c2": 57,
      "c(": 58,
      "=O)": 59,
      "c1cc": 60,
      "c3": 61,
      "C)": 62,
      "C(=O)": 63,
      "c2cc": 64,
      ")cc": 65,
      "C1": 66,
      "(=O)": 67,
      "c1cccc": 68,
      "O=": 69,
      "c1ccc(": 70,
      "c2cccc": 71,
      "CCCC": 72,
      "c3cc": 73,
      "c1ccccc1": 74,
      "2)": 75,
      "cn": 76,
      "(C)": 77,
      "CN": 78,
      "CO": 79,
      ")cc1": 80,
      "C2": 81,
      "c2ccccc2": 82,
      "CCN": 83,
      "O=C(": 84,
      "F)": 85,
      "C(=O)N": 86,
      "c4": 87,
      "CC1": 88,
      "[n": 89,
      "3)": 90,
      "[nH": 91,
      "[nH]": 92,
      "Cl": 93,
      "n1": 94,
      "c3cccc": 95,
      ")N": 96,
      "nc(": 97,
      "c2ccc(": 98,
      "C(C)": 99,
      "S(=O)": 100,
      "c3ccccc3": 101,
      "CCO": 102,
      "(C": 103,
      "cccc": 104,
      "c2ccccc2)": 105,
      "S(=O)(=O)": 106,
      "2)cc1": 107,
      "CC(=O)": 108,
      "C3": 109,
      "NC(=O)": 110,
      "CC(": 111,
      "C=": 112,
      "O=C(N": 113,
      "c1n": 114,
      "(-": 115,
      "c2c(": 116,
      "CCN(": 117,
      "c2n": 118,
      "N)": 119,
      "Cl)": 120,
      "n2": 121,
      "OC)": 122,
      "c1ccccc1)": 123,
      "(F)": 124,
      "=N": 125,
      "cc1": 126,
      "c3ccc(": 127,
      "CC2": 128,
      "CC(C)": 129,
      "c1ccc(-": 130,
      "CCC(": 131,
      "c2)": 132,
      "c(=O)": 133,
      "4)": 134,
      "O=C1": 135,
      "c1)": 136,
      "c1cc(": 137,
      "CC(=O)N": 138,
      "CCCN": 139,
      "OC": 140,
      "+]": 141,
      "F)cc": 142,
      "C(F)": 143,
      "c(-": 144,
      "C(O)": 145,
      "c3ccccc3)": 146,
      "CCC": 147,
      "C(F)(F)": 148,
      "Cl)cc": 149,
      "N=": 150,
      "c4cccc": 151,
      "N2": 152,
      "cs": 153,
      "=O": 154,
      "CC2)": 155,
      "C(C": 156,
      "cc(": 157,
      ")N1": 158,
      "1)": 159,
      "c1cccc(": 160,
      "nc(-": 161,
      "Cc1ccc(": 162,
      "c2c1": 163,
      "c1cn": 164,
      "c3n": 165,
      "c2cc(": 166,
      "N1": 167,
      "CC3": 168,
      "[N": 169,
      "-]": 170,
      "COc1ccc(": 171,
      "Cc1cc": 172,
      "c3c(": 173,
      "[O": 174,
      "[O-]": 175,
      "[N+]": 176,
      "c12": 177,
      "c4ccccc4": 178,
      "c5": 179,
      "Cc1ccccc1": 180,
      "Br": 181,
      "c3)": 182,
      "c[nH]": 183,
      "nn": 184,
      "CN1": 185,
      "cc2": 186,
      "C(=O)O)": 187,
      "CS": 188,
      "C(=": 189,
      "co": 190,
      "c1c(": 191,
      "CCC2": 192,
      "c4cc": 193,
      "c1ccc2c(": 194,
      "2)c1": 195,
      "C(=O)O": 196,
      "CC3)": 197,
      "n3": 198,
      "CCC1": 199,
      "c(N": 200,
      "C(C)(C)": 201,
      "c2cn": 202,
      "(=O)[O-]": 203,
      "[N+](=O)[O-]": 204,
      "CCCCC1": 205,
      "COC(=O)": 206,
      "CCCCC": 207,
      "CN(": 208,
      "nc(N": 209,
      "2)CC1": 210,
      "(O)": 211,
      "=C(": 212,
      "C(F)(F)F)": 213,
      ")cc2": 214,
      "c(C)": 215,
      "c1cc2": 216,
      "C(=O)N1": 217,
      "CCN1": 218,
      "S(=O)(=O)N": 219,
      "ncc": 220,
      "nc2": 221,
      "Cn1": 222,
      "c2ccccc2)cc1": 223,
      "nc1": 224,
      "c1ccc2c(c1)": 225,
      "CNC(=O)": 226,
      "C4": 227,
      "C#": 228,
      "c1ccccc1)N": 229,
      "ncn": 230,
      "CC(O)": 231,
      "3)cc1": 232,
      "c2cccc(": 233,
      "CN2": 234,
      "CCCCCCCC": 235,
      "CC)": 236,
      "C(C)C)": 237,
      "C(N)": 238,
      "Cl)cc1": 239,
      "c(OC)": 240,
      "c2[nH]": 241,
      "CCC3": 242,
      "CC1)": 243,
      "CCCC1": 244,
      "c1ccc(N": 245,
      "CC2)cc1": 246,
      "CN(C)": 247,
      "c(O)": 248,
      "O=c1": 249,
      "C(=N": 250,
      "C1=": 251,
      "F)cc1": 252,
      "CCN(C": 253,
      "Cc1": 254,
      "c2)cc1": 255,
      "O=S(=O)": 256,
      "c2ccccc21": 257,
      "4)cc": 258,
      "3)n": 259,
      "OCO": 260,
      "cc3": 261,
      "CCCO": 262,
      "CCOC(=O)": 263,
      "o1": 264,
      "(N": 265,
      "cn1": 266,
      "CC=": 267,
      "OC1": 268,
      "c1ccc(O": 269,
      "s1": 270,
      "c(Cl)": 271,
      "3)cc": 272,
      "Cc1n": 273,
      "cc(-": 274,
      "CC(C)(C)": 275,
      "2)C1": 276,
      "n(": 277,
      "c23)": 278,
      "Br)": 279,
      "c2ccc(Cl)cc": 280,
      "c2ccc(-": 281,
      "C(=O)N2": 282,
      "C=C": 283,
      "CCN(C(=O)": 284,
      "O=C(O)": 285,
      "C(C)=O)": 286,
      "c1cc(-": 287,
      "OC(": 288,
      "N(": 289,
      "c1cccc2": 290,
      "c4ccccc4)": 291,
      "c3cc(": 292,
      "c3cn": 293,
      "n1)": 294,
      "CC(C": 295,
      "c21": 296,
      "OC(=O)": 297,
      "n2)cc1": 298,
      "Cc1cc(": 299,
      "(C)C)": 300,
      "5)": 301,
      "C2)": 302,
      "c2nc(": 303,
      "c2cc3": 304,
      "COc1cc(": 305,
      "C(F)(F)F)cc": 306,
      "N=C(": 307,
      "n(-": 308,
      "c(=O)[nH]": 309,
      "c1O": 310,
      "C(=S": 311,
      "CCCN1": 312,
      "C(C)(C)C)": 313,
      "c1=O": 314,
      "[N+](=O)[O-])": 315,
      "N3": 316,
      "n2)": 317,
      "Cc1ccccc1)": 318,
      "c2ncn": 319,
      "c2ccccc12": 320,
      "c1nc(": 321,
      "c2ccc3c(": 322,
      "nc3": 323,
      "C2)cc1": 324,
      "(=O)=O)": 325,
      "C1=O": 326,
      "O)cc": 327,
      "c2ccccc2)CC1": 328,
      "c2cccn": 329,
      "c2n1": 330,
      "c1ccc(Cl)cc1": 331,
      "CC4": 332,
      "c2ccc(F)cc": 333,
      "N#": 334,
      "c1ccc(-c2n": 335,
      "cnc1": 336,
      ")cc2)": 337,
      "CCCC2": 338,
      "c1cccc(-": 339,
      "cs1": 340,
      "c4ccc(": 341,
      "NS(=O)(=O)": 342,
      "O=C1N": 343,
      "CC4)": 344,
      "C12": 345,
      "c12)": 346,
      "C2=O)": 347,
      "CCC4": 348,
      "CCn1": 349,
      "NC(=O)N": 350,
      "c1-": 351,
      "c1c[nH]": 352,
      "CCS": 353,
      "P(=O)": 354,
      "n(C)": 355,
      "CCN2": 356,
      "[n+]": 357,
      "CCNC(=O)": 358,
      "OC2": 359,
      "c4)": 360,
      "c4c(": 361,
      "cccn": 362,
      "O)cc1": 363,
      "n3)": 364,
      "c(F)": 365,
      "C(CO)": 366,
      "O1": 367,
      "C1)": 368,
      "c2nc(-": 369,
      "C3)": 370,
      "c5cccc": 371,
      "C(=S)N": 372,
      "[nH]1": 373,
      "C1O": 374,
      "C1CCCCC1": 375,
      "c1ccccc1)N1": 376,
      "ncc1": 377,
      "C)cc": 378,
      "Cc2ccccc2)": 379,
      "#N)": 380,
      "c2=O)": 381,
      "c1ccccc1)c1ccccc1": 382,
      "c23)cc1": 383,
      "C(=O)N(": 384,
      "c2cc(-": 385,
      "CCCN(": 386,
      "c2ccc3c(c2)": 387,
      "n1-": 388,
      ")cc(": 389,
      "C(=O)NC(": 390,
      "c3cccc(": 391,
      "COc1ccccc1": 392,
      "n(C": 393,
      "COc1cc": 394,
      "Cc1c(": 395,
      "CSc1n": 396,
      "Cc1cccc(": 397,
      "c1ccc(C2": 398,
      "C(N)=O)": 399,
      "CCOCC1": 400,
      "Cn2": 401,
      "O=c1[nH]": 402,
      "O=S(=O)(N": 403,
      "c3[nH]": 404,
      "3CCCC": 405,
      "S(=O)(=O)N2": 406,
      "CCOCC2)": 407,
      "CC(=O)N1": 408,
      "c2s": 409,
      "CC(=O)O)": 410,
      "c3ccc(Cl)cc": 411,
      "C=N": 412,
      "C=C1": 413,
      "c1ccc(F)cc1": 414,
      "S(C)": 415,
      "c1ccc(-n2": 416,
      "Nc1n": 417,
      "c3ccc(F)cc": 418,
      "c2ccc(O": 419,
      "CN(C": 420,
      "c2cccc3": 421,
      ")Nc1ccccc1": 422,
      "co1": 423,
      "S)": 424,
      "O=S(=O)(": 425,
      "C5": 426,
      "c3cccn": 427,
      "C)cc1": 428,
      "Cc1cn": 429,
      "CCC(C)": 430,
      "OCCO": 431,
      "c1cc2c(": 432,
      "c2ncc": 433,
      "CCCCC2)": 434,
      "c2)c1": 435,
      "[O-])": 436,
      "CCCC(": 437,
      "Cc2ccccc2": 438,
      "CCN(C)": 439,
      "C(=O)C(": 440,
      "c1ccc(N2": 441,
      "C2(": 442,
      "C=C(": 443,
      "O=C(Nc1ccccc1)": 444,
      "cccc2": 445,
      "C#N": 446,
      "OC)c(OC)": 447,
      "c1nc(-": 448,
      "c5ccccc5": 449,
      "C1=N": 450,
      "C2CCCC": 451,
      "C#N)": 452,
      "CCC(=O)N": 453,
      "c34)": 454,
      "CC1(C)": 455,
      "CC(=O)O": 456,
      "3CCO": 457,
      "([O-])": 458,
      "c1OC": 459,
      "Cc2cc": 460,
      "Cc2ccc(": 461,
      "nn1": 462,
      "1)c1ccccc1": 463,
      "c2c[nH]": 464,
      "n[nH]": 465,
      "S(C)(=O)=O)": 466,
      "c2o": 467,
      "c(N)": 468,
      "CCN(CC)": 469,
      "(C=": 470,
      "Cc1ccccc1)N": 471,
      "C(O)C(O)": 472,
      "c2ccc(Cl)cc2)": 473,
      "P(=O)(O)": 474,
      "cn2": 475,
      "c(O": 476,
      "c3ccccc23)": 477,
      "Br)cc": 478,
      "c1ncc": 479,
      "COc1cccc(": 480,
      "O=C(NC1": 481,
      "c2cc1": 482,
      "no": 483,
      "c(C)c1": 484,
      "c2nc3ccccc3": 485,
      "OC)cc": 486,
      "CC(NC(=O)": 487,
      "CCCN2": 488,
      "=C1": 489,
      "CC(C)C)": 490,
      "c2nc(N": 491,
      "c3ccccc3)cc": 492,
      "c2ccccc2)c1": 493,
      "c1cccnc1": 494,
      "c2ccccc2c1": 495,
      "CCCCC3)": 496,
      "c2ccccc12)": 497,
      "O=C(CC": 498,
      "CS(=O)(=O)": 499,
      "C(O": 500,
      "O=c1cc": 501,
      "Cl)c(Cl)": 502,
      "C(=N)N": 503,
      "c2-": 504,
      "C(C)C": 505,
      "nc2c1": 506,
      "Cc1ccc(-": 507,
      "CCc1ccccc1": 508,
      "c1ccc(CN": 509,
      "n4": 510,
      "C1CC1": 511,
      "C1CCN(": 512,
      ")NC(=O)": 513,
      "O=C(CSc1n": 514,
      "ncc2": 515,
      "s1)": 516,
      ")ccc1": 517,
      "cccc1": 518,
      "C(NC(=O)": 519,
      "C1(": 520,
      "CN(C(=O)": 521,
      "nc(S": 522,
      "c3ccc(-": 523,
      "Cc1cc(C)": 524,
      "c1ccccn1": 525,
      "CCO)": 526,
      "C(=O)NC(C": 527,
      "O=C(C=": 528,
      "c1ccncc1": 529,
      "c6": 530,
      "N(C)": 531,
      "2)n1": 532,
      "CCC2(": 533,
      "nc(C)": 534,
      "c(-c2ccccc2)": 535,
      "c2)CC1": 536,
      "c(C(=O)N": 537,
      "c1ccc2[nH]": 538,
      "c3ncn": 539,
      "COc1ccc(-": 540,
      "c2c(c1)": 541,
      "C3CCCC": 542,
      "CC2)c1": 543,
      "O=C(CN1": 544,
      "CCC(O)": 545,
      "CC12": 546,
      "[S": 547,
      "n2cc": 548,
      "c(S": 549,
      "Cl)c1": 550,
      "C1=O)": 551,
      "CN3": 552,
      "(C3": 553,
      ")c1ccccc1": 554,
      "O=C(Cn1": 555,
      "CC(N)": 556,
      "CC3)cc": 557,
      "o2)cc1": 558,
      ")N1CCN(": 559,
      "c1ccc(NC(=O)": 560,
      "c1s": 561,
      "NC(": 562,
      "N=C(N": 563,
      "=C(N": 564,
      "c1cccs1": 565,
      "c3ccc4c(": 566,
      "c2cccs": 567,
      "S1": 568,
      "c5cc": 569,
      "c1nc2ccccc2": 570,
      "Br)cc1": 571,
      "CCCC(=O)": 572,
      "c2cs": 573,
      "c2ccc(F)cc2)": 574,
      "c2c(-": 575,
      "C2=N": 576,
      "C(c2ccccc2)": 577,
      "c1cs": 578,
      "n2cn": 579,
      "c3c2": 580,
      "(C)C": 581,
      "-2": 582,
      "c3ccncc": 583,
      "C(=O)C2": 584,
      "C(O)=N": 585,
      "c3cc4": 586,
      "3CCOCC3)": 587,
      "OCC1": 588,
      "CCNCC1": 589,
      "c2ccc(Cl)cc2": 590,
      "CCC(N": 591,
      "n2-": 592,
      "C3=O)": 593,
      "CC4)cc": 594,
      "c2ccco": 595,
      "cc4": 596,
      "(N)": 597,
      "c3ccc(F)cc3)": 598,
      "c4cc(": 599,
      "c1ccco1": 600,
      "Cc3ccccc3)": 601,
      "4CCO": 602,
      "nc(N)": 603,
      "CO)": 604,
      "c4cn": 605,
      "CCCCO": 606,
      "C2CC2)": 607,
      "CC(=O)N2": 608,
      "N=C(O)": 609,
      "C(N": 610,
      "c2ccncc": 611,
      "c1[nH]": 612,
      "C2=O": 613,
      "c2ccc(N": 614,
      "C=C2": 615,
      "N=C1": 616,
      "c1)c1ccccc1": 617,
      "C(F)(F)F)cc1": 618,
      "5)cc": 619,
      "c(NC(=O)": 620,
      "O=C(NCC": 621,
      "C(=O)OC": 622,
      "O=C(NCc1ccccc1)": 623,
      "OCC": 624,
      "c3ccccc23)cc1": 625,
      "N1CCN(": 626,
      "c2ccccc2-": 627,
      "c2cc(Cl)cc": 628,
      "c1cc2cccc": 629,
      "c3ccc(N": 630,
      "C(C#N)": 631,
      "3)cc2": 632,
      "c2cccc(Cl)": 633,
      "CCS(=O)(=O)": 634,
      "CC(F)": 635,
      "ccc3": 636,
      "CCCCN": 637,
      "CCCn1": 638,
      "[N+](=O)[O-])cc1": 639,
      "Cc3ccccc3": 640,
      "c1ccc(-c2cn": 641,
      "OC)c1OC": 642,
      "Nc1ccccc1": 643,
      "c(=": 644,
      "c3ccc4c(c3)": 645,
      "c1cccc2cccc": 646,
      "c3ccc(Cl)cc3)": 647,
      "c1ccc(-c2cc": 648,
      "(Cc2ccccc2)": 649,
      "c3s": 650,
      "[N+](=O)[O-])cc": 651,
      "n2)c1": 652,
      "(C(F)(F)F)": 653,
      "c1ccc(CN2": 654,
      "C1CCC2": 655,
      "c3ncc": 656,
      "Cl)c(": 657,
      "C2=O)cc1": 658,
      "-c1ccccc1": 659,
      "CC(CC(C": 660,
      "c1)N": 661,
      "c3ccco": 662,
      "OC3": 663,
      "[N+]([O-])": 664,
      "c2cc3c(": 665,
      "O=C(COC(=O)": 666,
      "C(=O)OC)": 667,
      "c3)cc": 668,
      "CC1(": 669,
      "CN1CCN(": 670,
      "O)c(O)": 671,
      "c3cccc4": 672,
      "C(=O)NC": 673,
      "c2ncccc2": 674,
      "CC(N": 675,
      "Cc1ccc2c(c1)": 676,
      "c2c(C)": 677,
      "CCC(=O)O)": 678,
      "(O": 679,
      "c3ccc(O": 680,
      "c1cc2c(cc1": 681,
      "Cc1cc2": 682,
      "CCCC2)": 683,
      "C2C1": 684,
      "O=C(CO": 685,
      "(Cl)": 686,
      "c2cccnc2)": 687,
      "CC(O": 688,
      "3)c1": 689,
      "c(-c3ccccc3)": 690,
      "3C)": 691,
      "OCO2": 692,
      "=C(O)": 693,
      "NC(=O)C(": 694,
      "c1nc(N": 695,
      "no1": 696,
      "C(=O)C1": 697,
      "c2cccc(-": 698,
      "O=C1c2ccccc2": 699,
      "CCC12": 700,
      "C=C(C)": 701,
      "nn2": 702,
      "c1ccc(C": 703,
      "O)c(": 704,
      "CCCC3": 705,
      "s2)": 706,
      "c4ccccc4)cc": 707,
      "C(=C": 708,
      "O=[N+]([O-])": 709,
      "3)CC2)": 710,
      "c(N2": 711,
      "OC(CO)": 712,
      "s2)cc1": 713,
      "C(C(=O)N": 714,
      "C4)": 715,
      "C=CC(=O)": 716,
      "c3ccccc32)cc1": 717,
      "CC2(": 718,
      "C1=C(": 719,
      "c1ncn": 720,
      "C(F)(F)F": 721,
      "n2)CC1": 722,
      "c1ccc(Cn2": 723,
      "(N)(=O)=O)": 724,
      "c2ccccn2)": 725,
      "cccc3": 726,
      "c1ccc(-c2ccccc2)cc1": 727,
      "c2[nH]1": 728,
      "c2ccc3c(c2)OCO": 729,
      "O2": 730,
      "cc2)": 731,
      "c3cccs": 732,
      "sc1": 733,
      "c2ccc3ccccc3": 734,
      "c4n": 735,
      "c1ccc(CO": 736,
      "c1ccc(O)cc1": 737,
      "3)n2)cc1": 738,
      "cs1)": 739,
      "n12": 740,
      "C1(C)": 741,
      "CCCCC1)": 742,
      "c4[nH]": 743,
      "c3cccnc3)": 744,
      "c(OC)c1": 745,
      "c1cc(-c2ccccc2)": 746,
      "CC(=O)N(": 747,
      "c1c(C)": 748,
      "CCCC(C)": 749,
      "CC1=": 750,
      "n4)": 751,
      "O=C(CNC(=O)": 752,
      "CCOCC1)": 753,
      "c1=O)": 754,
      "c2c(=O)": 755,
      "n1-c1ccccc1": 756,
      "O=C(NN=": 757,
      "c2ccccc2n1": 758,
      "c1cccn": 759,
      "c2ccccc2)N1": 760,
      "c2ccccc2)n1": 761,
      ")N(": 762,
      "c2ccc(N3": 763,
      "(C#N)": 764,
      "C3CC3)": 765,
      "C2CCN(": 766,
      "[n+]1": 767,
      "n1cn": 768,
      "c1ccccn1)": 769,
      "C1CCC(": 770,
      "CCOCC2)cc1": 771,
      "O=C(O": 772,
      "COc1cc2": 773,
      "c2cc3cccc": 774,
      "ncc3": 775,
      "CCCC1)": 776,
      "c1ccc(Br)cc1": 777,
      "C(=O)O)cc1": 778,
      "CCN3": 779,
      "nc12": 780,
      "C(Cc1ccccc1)N": 781,
      "c2=O)cc1": 782,
      "(C)C3": 783,
      "c3nc4ccccc4": 784,
      "c(=O)[nH]1": 785,
      "C(O)C1O": 786,
      "c4ccccc34)": 787,
      "CCCCN1": 788,
      "oc(": 789,
      "on1": 790,
      "CCCNC(=O)": 791,
      "CCOc1ccc(": 792,
      "CN1C(=O)": 793,
      "n3cc": 794,
      "4CCCC": 795,
      "O=C(Nc1ccccc1)N": 796,
      "c2c1)": 797,
      "C1CC2": 798,
      "c1C": 799,
      "c(N3": 800,
      "C(=O)N(C)": 801,
      "C2CC3": 802,
      "N(C": 803,
      "CCN1C(=O)": 804,
      "CC(=": 805,
      "c1ccc2ccccc2c1": 806,
      "c1ccc(OC": 807,
      "c2ccccc2)C1": 808,
      "C(=O)N3": 809,
      "c2ccc(S(=O)(=O)N": 810,
      "c(=O)n2": 811,
      "o2)": 812,
      "CCC)": 813,
      "(CO)": 814,
      "OCC2": 815,
      "CCc2ccccc2": 816,
      "O=C(c1ccccc1)": 817,
      "C3)cc": 818,
      "C23": 819,
      "S(N)(=O)=O)": 820,
      "CC(F)(F)": 821,
      "n3)cc": 822,
      "O=C(C=C": 823,
      "CNS(=O)(=O)": 824,
      "c3ccccn3)": 825,
      "F)c(F)": 826,
      "O=C1CC(": 827,
      "c3ccccc3)cc2": 828,
      "CCNCC3)": 829,
      "C2=": 830,
      "N=C": 831,
      "c[nH]1": 832,
      "c2c3c(": 833,
      "c1ccccc1-": 834,
      "c3ccccc3)CC2)": 835,
      "CCC=": 836,
      "c(-c2ccc(": 837,
      "CC(=N": 838,
      "c1cc(Cl)cc": 839,
      "c(=O)o": 840,
      "O2)": 841,
      "C1CCCC1": 842,
      "c2cccc3cccc": 843,
      "OC)cc1": 844,
      "C2CCCCC2)": 845,
      "=C2": 846,
      "c2)n1": 847,
      "CCCCC2)cc1": 848,
      "[nH]2)cc1": 849,
      "3)CC2)cc1": 850,
      "cn2)": 851,
      "c1nnc(": 852,
      "c32)cc1": 853,
      "C(=O)NCC": 854,
      ")N2": 855,
      "C(Cc1ccccc1)": 856,
      "c3cc(Cl)cc": 857,
      "CCCCC2": 858,
      "Cc1nc(": 859,
      "(C#": 860,
      "CCC3(C)": 861,
      "c(C(=O)O)": 862,
      "C2O)": 863,
      "c1c[nH]c2ccccc12)": 864,
      ")N1CCC(": 865,
      "n3cn": 866,
      "c1ccc(S(=O)(=O)N": 867,
      "Cc1ccc(NC(=O)": 868,
      "C1CCCN1": 869,
      "S1(=O)": 870,
      "NC(=S)N": 871,
      "3)cc2)": 872,
      "CSc2n": 873,
      "CC3)cc2": 874,
      "CCC(NC(=O)": 875,
      "c4)cc": 876,
      "c2cc(C)": 877,
      "c2C)": 878,
      "c1ccc(Cl)cc1)": 879,
      "4)CC3)": 880,
      "O=C(CS": 881,
      "c2cccs2)": 882,
      "CCNCC2)": 883,
      "OCc1ccccc1": 884,
      "n1cc": 885,
      "NC": 886,
      "ncn1": 887,
      "C(=O)c1ccccc1": 888,
      "co1)": 889,
      "cn1)": 890,
      "COC1": 891,
      "4CCOCC4)": 892,
      "OC(C)": 893,
      "3)CC1": 894,
      "C(=O)NC1": 895,
      "c1cccc(F)": 896,
      "c2ccc(F)cc2": 897,
      ")ccc1O": 898,
      "c2cccc(F)": 899,
      "O=C(NCC1": 900,
      "c(=O)n1": 901,
      "c(Cl)c1": 902,
      "c2ccc(C)cc": 903,
      "C(OC(C)=O)": 904,
      "c(=O)n(": 905,
      "O)cc(": 906,
      "c3ccccc32)": 907,
      "ccc1": 908,
      "c3o": 909,
      "O=c1c2ccccc2": 910,
      "CCC(=O)": 911,
      "c3cc(-": 912,
      "N2CCN(": 913,
      "CC(C)=": 914,
      "c2ccc(NC(=O)": 915,
      "C(c1ccccc1)": 916,
      "3)C2": 917,
      "Cc1ccco1": 918,
      "c32)": 919,
      "[S+]": 920,
      ")cc(OC)c1OC": 921,
      "[nH+]": 922,
      "c5ccccc5)": 923,
      "c1ccn": 924,
      "c2cc3c(cc2": 925,
      "c4ccc(F)cc": 926,
      "CC5)": 927,
      "c3c[nH]": 928,
      "c3n2)cc1": 929,
      "c1ccc(C(=O)N": 930,
      "c1cccc(Cl)c1": 931,
      "c3cccc(Cl)": 932,
      "CCC(O": 933,
      "O=C1C=": 934,
      "c2ccco2)": 935,
      "COc1ccc(C2": 936,
      "c2cc(O": 937,
      "O=C(CC1": 938,
      "c1ccc([N+](=O)[O-])cc1": 939,
      "CCCO1": 940,
      "c(C(F)(F)F)": 941,
      "CCCCCCCCCCCC": 942,
      "O=C(Cc1ccccc1)N": 943,
      "c1cc(N": 944,
      "cnc2": 945,
      "CC(C)(C)O": 946,
      "C2)c1": 947,
      "COc1ccc2c(c1)": 948,
      "C(=O)N(C": 949,
      "C1CCCCC1)": 950,
      "CC5": 951,
      "O)cc2)": 952,
      "c(=O)[nH]c1=O": 953,
      "c3ccccc3)cc2)": 954,
      "N2C(=O)": 955,
      "N=C(N)N": 956,
      "Nc1nc(": 957,
      "OC4": 958,
      "OC)c(OC)c(OC)": 959,
      "c2ccn": 960,
      "CC1CN(": 961,
      "CC#": 962,
      "c1cccc2c1": 963,
      "N2CCOCC2)": 964,
      "3)cc2)cc1": 965,
      "Cc1ccc(O": 966,
      "nc21": 967,
      "CCc2ccccc2)": 968,
      "[N+](=O)[O-])c1": 969,
      "c3nc(": 970,
      "c2cccc(C(F)(F)F)": 971,
      "O=C(c1ccccc1)N1": 972,
      "cc(C)": 973,
      "c1co": 974,
      "4)cc3)": 975,
      "COc1ccc(NC(=O)": 976,
      "c2nnn": 977,
      "c4cccn": 978,
      "oc(-": 979,
      "c3c2)": 980,
      "c(Br)": 981,
      "c1ccc(S": 982,
      "cc(N": 983,
      "[nH]c2c1": 984,
      "S(=O)(=O)N1": 985,
      "C3)cc1": 986,
      "Cc1ccc(Cl)cc1": 987,
      "c1cn(": 988,
      "sc2c1": 989,
      "s3)": 990,
      "c1nc2c(": 991,
      "6)": 992,
      "oc2c1": 993,
      "O=C1NC(=O)": 994,
      "c3ccncc3)": 995,
      "c2ccccc2)CC1)": 996,
      "[nH]c(=O)": 997,
      "C(C)(C)C": 998,
      "c2C1": 999,
      "C2(C)": 1000,
      "CCCN(C": 1001,
      "CCN(S(=O)(=O)": 1002,
      "c(=O)n(C)": 1003,
      "c(C#N)": 1004,
      "I)": 1005,
      "Cc1cc(-": 1006,
      "OCO4)": 1007,
      "3)C1)": 1008,
      "c2nc(-c3ccccc3)": 1009,
      "c4ccc(Cl)cc": 1010,
      "c1ncn2": 1011,
      "P(=O)(O)O": 1012,
      "CCC3(": 1013,
      "C21": 1014,
      "CCCN(C(=O)": 1015,
      "NC1": 1016,
      "C(C)(": 1017,
      "c1ncc2": 1018,
      "c1nc(-c2ccccc2)": 1019,
      "N(C(=O)": 1020,
      "nc2-": 1021,
      "cnc2c1": 1022,
      "nc4": 1023,
      "ccc2c1": 1024,
      "cc2c1": 1025,
      "c(F)cc": 1026,
      "C(OC(=O)": 1027,
      "c(=S)": 1028,
      "c2c[nH]c3ccccc23)": 1029,
      "C(CO": 1030,
      "c1ccc2n": 1031,
      "C(N)=O": 1032,
      "c2ccc(C)": 1033,
      "CCC2(C)": 1034,
      "CCC2(CC1)": 1035,
      "4CCCCC": 1036,
      "nn2)cc1": 1037,
      "[nH]c1": 1038,
      ")N1CCCC1": 1039,
      "[n+]2": 1040,
      "c2ccncc2)": 1041,
      "nc2n1": 1042,
      "O)c1": 1043,
      "nc1-": 1044,
      "O=C(CN": 1045,
      "CCN1CCN(": 1046,
      "c1cccc2ccccc12": 1047,
      "c2cc(F)cc": 1048,
      "c2ccc(Br": 1049,
      "O=C(Nc1cccc(": 1050,
      ")N1CCCCC1": 1051,
      "COc1cc2c(cc1": 1052,
      "c3=O)": 1053,
      "c2cc(S(=O)(=O)N": 1054,
      "cn3)": 1055,
      "cn2)cc1": 1056,
      "cc3)": 1057,
      "COc1cc(-": 1058,
      "C3(": 1059,
      "c2cc(N": 1060,
      "CN(C)C(=O)": 1061,
      "CC(C)O": 1062,
      "[nH]2)": 1063,
      "c3ccc(Cl)cc3": 1064,
      "c3cc2": 1065,
      "C(=O)c2ccccc2": 1066,
      "n(-c2ccccc2)": 1067,
      "c3nc(-": 1068,
      "S(=O)(=O)c1ccccc1": 1069,
      "c3ccco3)": 1070,
      "c3)cc2": 1071,
      "c(F)c1": 1072,
      "c1cccc(C": 1073,
      "OCc1ccccc1)": 1074,
      "c1ccccc1)Nc1ccccc1": 1075,
      "c(-c3ccc(": 1076,
      "c3cc4c(": 1077,
      "c1ccc(F)cc1)": 1078,
      "P(=O)(O)O)": 1079,
      "c2ccccc2Cl)": 1080,
      "c2nnc(": 1081,
      "CCN(C)C)": 1082,
      "c4ccc5": 1083,
      "C2=C(": 1084,
      "O=C(NCc1cc": 1085,
      "nc(-c2ccccc2)": 1086,
      "3)nc2c1": 1087,
      "c2)C1": 1088,
      "CCc2c(": 1089,
      "c1ccc(-c2ccc(": 1090,
      "ccc2": 1091,
      ")cc(-": 1092,
      "COc1cc(OC)": 1093,
      "ncn2": 1094,
      "cc(C(=O)N": 1095,
      "Cc1cccc(-": 1096,
      "C(C)N": 1097,
      "Cc1ccc(F)cc1": 1098,
      "CC(=O)OC1": 1099,
      "c2ccc3c(c2)OCO3)": 1100,
      "c3ccc4ccccc4": 1101,
      "O=S1(=O)": 1102,
      "C(F)(F)F)c1": 1103,
      "c(C(=O)": 1104,
      "c2ccccc2F)": 1105,
      "CCc3ccccc3": 1106,
      "C2O": 1107,
      "O)cc2": 1108,
      "C1CO": 1109,
      "c2cc(N3": 1110,
      "CCn2": 1111,
      ")cc12": 1112,
      "c2ccc(OC)cc": 1113,
      "CC2CC2)": 1114,
      "(=O)=O": 1115,
      "CCc1n": 1116,
      "Cc2c(": 1117,
      "c1cncc": 1118,
      "CCOCCO": 1119,
      "c-2": 1120,
      "OC)c1": 1121,
      "C(=N)": 1122,
      "CC3CC(CC(C": 1123,
      "n(-c3ccccc3)": 1124,
      "=CC(=O)": 1125,
      "(C)c1": 1126,
      "Cn1cc": 1127,
      "Cc2cn": 1128,
      "CC1=C(": 1129,
      "CCC(=O)N1": 1130,
      "c(CN": 1131,
      "c1cccnc1)": 1132,
      "Cc3ccc(": 1133,
      "C#N)cc": 1134,
      "CC3CC(CC(C3)C1)": 1135,
      "Cc2ccccc2)cc1": 1136,
      "OC(CO)C(O)C(O)": 1137,
      "c1ccc(S(=O)(=O)N2": 1138,
      "Cc1c[nH]": 1139,
      "nc2ccccc12": 1140,
      "O=c1o": 1141,
      "c2ccc(C(=O)N": 1142,
      "c(C3": 1143,
      "CCC2)": 1144,
      "CCC3)": 1145,
      "oc1": 1146,
      "C(C(=O)O)": 1147,
      "O=C1Nc2ccccc2": 1148,
      "Oc1ccccc1": 1149,
      "c3cncn": 1150,
      "CCOCC3)": 1151,
      "c3cccs3)": 1152,
      "C(c3ccccc3)": 1153,
      "COc1cc(C=": 1154,
      "CC21": 1155,
      "O=C(C1": 1156,
      "c2ccc3n": 1157,
      "nc(-c3ccccc3)": 1158,
      "CCC(N)": 1159,
      "c1cc(C)": 1160,
      "c2cccnc2": 1161,
      "c2ccccc2)N": 1162,
      "c3ccccc3)CC2)cc1": 1163,
      "cc2)cc1": 1164,
      "CCCN3": 1165,
      "c2ccc3[nH]": 1166,
      "c5)": 1167,
      "CCCS": 1168,
      "ccc4": 1169,
      "CCNCC2)cc1": 1170,
      "cc12": 1171,
      ")N1CCOCC1": 1172,
      "c2nc3c(": 1173,
      "CCCC3)": 1174,
      "[N+](C)": 1175,
      "c2ncccn": 1176,
      "Cn1cn": 1177,
      "nc3)": 1178,
      "Cl)cc2": 1179,
      "CCNCC1)": 1180,
      "Cc1cs": 1181,
      "Cc1ccc(C(=O)N": 1182,
      "c3cc(C)": 1183,
      "c2s1": 1184,
      "c(O)c1": 1185,
      "c2ccc(C(F)(F)F)cc": 1186,
      "C2C3": 1187,
      "[nH]1)": 1188,
      "CCC21": 1189,
      "CCOc1ccccc1": 1190,
      "c1c[nH]c2ccccc12": 1191,
      "3CCCC3)": 1192,
      "O=C1O": 1193,
      "C=CC1": 1194,
      "c1ccc2c(c1)OCO2": 1195,
      "NC(=O)C1": 1196,
      "CC(C(=O)N": 1197,
      "C(=O)OC(C)(C)C)": 1198,
      "c1cc(=O)": 1199,
      "S)N": 1200,
      "c1ccc(C)cc1": 1201,
      "CCCCCCCCCCCCCCCC": 1202,
      "(c2ccccc2)": 1203,
      "Cc1ccc(N": 1204,
      "N=C(N)": 1205,
      "Cc1cccnc1": 1206,
      "C(=N)N)": 1207,
      "c(C": 1208,
      "c1ccc(Cl)c(Cl)": 1209,
      "Cn1c(=O)": 1210,
      "c2ccs": 1211,
      "c2cc(NC(=O)": 1212,
      "CC(C)(": 1213,
      "CCc1ccccc1)": 1214,
      "n(C2": 1215,
      "C(C)=O": 1216,
      "cc21": 1217,
      "c2o1": 1218,
      "COc1c(": 1219,
      "S=C(N": 1220,
      "c1cccc2ccccc12)": 1221,
      "c2cccc(O": 1222,
      "CCCC2)cc1": 1223,
      "c2cc1OC": 1224,
      "c1cncc(-": 1225,
      "n1)c1ccccc1": 1226,
      "c(=N": 1227,
      "c1ccc(C(F)(F)F)cc1": 1228,
      "O=C(Nc1cc": 1229,
      "Cc1ccc(S(=O)(=O)N": 1230,
      "CCC1C2": 1231,
      "C(=O)NC(Cc1ccccc1)": 1232,
      "O=c1c(": 1233,
      "c2F)": 1234,
      "OCO2)": 1235,
      "N=C2": 1236,
      "c2cccc(Cl)c2)": 1237,
      "C(F)F)": 1238,
      "COc1cccc(-": 1239,
      "c1ccc2c(c1)OCCO": 1240,
      "N)ncn": 1241,
      "c1ccc(C2=N": 1242,
      "c2cccc3ccccc23)": 1243,
      "Cc2ccco": 1244,
      "c3c(N": 1245,
      "c2ccc([N+](=O)[O-]": 1246,
      "c3ccc(C)": 1247,
      "O3)": 1248,
      "cs2)cc1": 1249,
      "c1cncc(": 1250,
      "o1)": 1251,
      "nc2)cc1": 1252,
      "c1ccccc12": 1253,
      "c4ncc": 1254,
      "c3cccnc3": 1255,
      "c1cccc(N": 1256,
      "C=CC(=O)N": 1257,
      "c1cccc(NC(=O)": 1258,
      "nn2)": 1259,
      "CO1": 1260,
      "c1nn": 1261,
      "c2n[nH]": 1262,
      "c1cccc(O": 1263,
      "(Cc1ccccc1)": 1264,
      ")NCc1ccccc1": 1265,
      "C#N)cc1": 1266,
      "Cc1ccccc1)c1ccccc1": 1267,
      "c2ccccn2)cc1": 1268,
      "c2cc(C(=O)N": 1269,
      "c2c(Cl)cc": 1270,
      "O=C(COc1ccccc1)N": 1271,
      "c1ccc(CCN": 1272,
      "c1cccc(S(=O)(=O)N2": 1273,
      "ccn": 1274,
      "c1cccc(F)c1": 1275,
      "CC1CCCCC1": 1276,
      "(-c3ccccc3)": 1277,
      "4CCN": 1278,
      ")ccn1": 1279,
      "C(=O)N1CCCC1": 1280,
      "c3c(-": 1281,
      "SCC(=O)N": 1282,
      "2)C1=O": 1283,
      "c3ccc4c(c3)OCO4)": 1284,
      "SC1=": 1285,
      "c3cccc(F)": 1286,
      "O=S(=O)(c1ccccc1)N1": 1287,
      "O=C(c1cc": 1288,
      "C(=O)C=": 1289,
      "CC=C(": 1290,
      "COc1ccc(OC)": 1291,
      "4)cc3": 1292,
      "CCCCCC1": 1293,
      "S2": 1294,
      "O=C(NCCc1ccccc1)": 1295,
      "Cn1cc(": 1296,
      "COc1ccc(C(=O)N": 1297,
      "c2co": 1298,
      "c3ccc(F)cc3": 1299,
      "nc(N3": 1300,
      "N1C(=O)": 1301,
      "C(=O)N1CCC(": 1302,
      "CC3)cc1": 1303,
      "c3ccs": 1304,
      "c2cc(-c3ccccc3)": 1305,
      "CC(c2ccccc2)": 1306,
      "nc(O)": 1307,
      "C3CCCCC3)": 1308,
      "c3c(C)": 1309,
      "c1ccc2c(c1": 1310,
      "C(=O)N1CCN(": 1311,
      "CN1CCC(": 1312,
      "CCC3C4": 1313,
      "c1ccc(Cl)": 1314,
      "N1CCOCC1": 1315,
      "CCC(=O)O": 1316,
      "c2c(F)cc": 1317,
      "c2cccnc2)cc1": 1318,
      "CC2)CC1": 1319,
      "c4ccccc4)CC3)": 1320,
      "CCCCNC(=O)": 1321,
      "COc1ccc(-c2n": 1322,
      "Cc1cccs1": 1323,
      "CCCO3)": 1324,
      "c4ccccc43)": 1325,
      "COc1ccc(N": 1326,
      "FC(F)(F)": 1327,
      "c1ccc2o": 1328,
      "O=C1C(=": 1329,
      "c2ncc(": 1330,
      "CCNS(=O)(=O)": 1331,
      "c2cncc": 1332,
      "S)=N": 1333,
      "C(=S)": 1334,
      "4)C2)": 1335,
      "c2nc(C)": 1336,
      "c1ccc(Oc2ccccc2)cc1": 1337,
      "O=C1C=C(": 1338,
      "c3ccc(Br)cc": 1339,
      "nn3": 1340,
      "(C=N": 1341,
      "OC(CO": 1342,
      "c34)cc": 1343,
      "[nH]3)": 1344,
      "c3cc4c(cc3": 1345,
      "Cc1no": 1346,
      "C(=O)C=C": 1347,
      "n2c1": 1348,
      "CC(F)(F)F)": 1349,
      "c4ccncc": 1350,
      "o3)": 1351,
      "O=c1cc(": 1352,
      "C(=O)NC(C)": 1353,
      "C2CCC1": 1354,
      "P(=O)(": 1355,
      "CCC5": 1356,
      "O2)cc1": 1357,
      "c3cccc(Cl)c3)": 1358,
      "-3": 1359,
      "c3c2)cc1": 1360,
      "C(C)C)cc1": 1361,
      "cs2)": 1362,
      "C)cc3)": 1363,
      "CCCC4": 1364,
      "[n+](": 1365,
      "oc2ccccc12": 1366,
      "OC(C)(C)": 1367,
      "C(F)(F)F)cc(C(F)(F)F)": 1368,
      "NCC": 1369,
      "CCCO2)": 1370,
      "C(C)=": 1371,
      "c2ccc(Cl)c(Cl)": 1372,
      "CC(C)CC(NC(=O)": 1373,
      "O=C(CCc1ccccc1)N": 1374,
      "c1ccc(Nc2ncn": 1375,
      "CCC43C)": 1376,
      "=C(N)N": 1377,
      "CCOC(=O)C1": 1378,
      "Cc1ccc(C)": 1379,
      "ccc(": 1380,
      "C3O)": 1381,
      "c2ccccc2N1": 1382,
      "CCN(Cc2ccccc2)CC1": 1383,
      "c2ccnc(N": 1384,
      "c1cn(-": 1385,
      "CC(N)=O)": 1386,
      "c1c(-": 1387,
      "c1ccc(OC)cc1": 1388,
      "CN2C(=O)": 1389,
      "CC(C)N": 1390,
      "c1-c1ccccc1": 1391,
      "C1CCC1": 1392,
      "c1c2c(": 1393,
      "c3C)": 1394,
      "CC3)cc2)": 1395,
      "c45)": 1396,
      "H]": 1397,
      "C)cc(C)": 1398,
      "C(Cl)": 1399,
      "CS(=O)(=O)N": 1400,
      "Cc1ccc(-n2": 1401,
      "c2nc(N3": 1402,
      "c2N1": 1403,
      "c2ncc3": 1404,
      "CC(OC(=O)": 1405,
      "O=C(Nc1ccccc1": 1406,
      "Cc1cccc": 1407,
      "(CC(=O)N": 1408,
      "C(CCC4": 1409,
      "C(=O)Nc1ccccc1": 1410,
      "CCCC)": 1411,
      "3)C1": 1412,
      "c1c(O)": 1413,
      "COC(=O)C1": 1414,
      "c1ccc(F)": 1415,
      "nc2c(": 1416,
      "c3ccc(C(F)(F)F)cc": 1417,
      "CN)": 1418,
      "=O)N": 1419,
      "c3cc(N": 1420,
      "c2ccc(-c3n": 1421,
      "C12CC3CC(CC(C3)C1)": 1422,
      "O=C(C=Cc1ccccc1)": 1423,
      "c13)": 1424,
      "[P": 1425,
      "H+]": 1426,
      "c1c[nH]cn1": 1427,
      "c(=O)n3": 1428,
      "C2)C1": 1429,
      "O=S(=O)(c1ccccc1)": 1430,
      "O)cc3)": 1431,
      "c2ccc(Cl)cc2Cl)": 1432,
      "CN2CCN(": 1433,
      "C2CCC(": 1434,
      "c6cccc": 1435,
      "nc2)": 1436,
      "n2C)": 1437,
      "COc1cc2c(cc1OC)": 1438,
      "C(O)(": 1439,
      "O=c1[nH]c(=O)": 1440,
      "c2ccc(Cl)cc2)cc1": 1441,
      "C(CC(C)C)": 1442,
      "c3cc(O)": 1443,
      "c2Cl)": 1444,
      "Cc1cc(N": 1445,
      "c1cc(F)cc": 1446,
      "CNC": 1447,
      "(C(=O)N": 1448,
      "C(=NO)": 1449,
      "OCc2ccccc2)": 1450,
      "C5(C)": 1451,
      "c(SCC(=O)N": 1452,
      "2)CC1)": 1453,
      "cc4)": 1454,
      "C2CCCC2)": 1455,
      "COC(": 1456,
      "CCl": 1457,
      "O=C(Nc1n": 1458,
      "c2nc(N)": 1459,
      "cn3": 1460,
      "COc1ccc(-n2": 1461,
      "COCCO": 1462,
      "c3cccc4cccc": 1463,
      "nc(SCC(=O)N": 1464,
      "CCC(C)(C)": 1465,
      "c2ccc(Cl)": 1466,
      "CCCC(=O)N": 1467,
      "C4CC4)": 1468,
      "CC4CC(CC(C": 1469,
      "c4ccccn4)": 1470,
      "c4ccco": 1471,
      "C2CCCN2": 1472,
      "4)cc2": 1473,
      "c2ccc(OC": 1474,
      "c1ccc2c(c1)N": 1475,
      "c1nccs1": 1476,
      "OCC1OC(": 1477,
      "nn(-": 1478,
      "4CCOCC4)cc": 1479,
      "CCc3ccccc3)": 1480,
      "CCc2ccccc2C1": 1481,
      "CCCCC2)c1": 1482,
      "N)cc": 1483,
      "C(=O)OCC)": 1484,
      "CC5)cc": 1485,
      "CCC(C(=O)N": 1486,
      "O=C(CCCC": 1487,
      "CC=C(C)": 1488,
      "CC(C)(O)": 1489,
      "CC1OC(": 1490,
      "c(S(=O)(=O)N": 1491,
      "c2ccccc2c1=O": 1492,
      "c1N": 1493,
      "CCC4(C)C3": 1494,
      "[nH]n1": 1495,
      "O=C(OC1": 1496,
      "Cc1cn(": 1497,
      "cc(OC)": 1498,
      "COc1ccc(Cl)cc1": 1499,
      "c3ncccc3": 1500,
      "c2c(O)": 1501,
      "C(C)(O)": 1502,
      "nc2ccccc21": 1503,
      ")N1CC": 1504,
      "c2ccc(O)cc2)": 1505,
      "C2)CC1": 1506,
      "c3cco": 1507,
      "C(#": 1508,
      "c([N+](=O)[O-])": 1509,
      "c3cc(F)cc": 1510,
      "(CC)": 1511,
      "cc1)": 1512,
      "(=O)o": 1513,
      "c1c(Cl)cc": 1514,
      "C(c2ccccc2)N1": 1515,
      "c1o": 1516,
      "CC(CO)": 1517,
      "O=c1cc(-c2ccccc2)": 1518,
      "n1cc(": 1519,
      "NC(=O)c1ccccc1": 1520,
      "c3c(F)cc": 1521,
      "O=C(C=Cc1ccccc1)N": 1522,
      "C(Cc2ccccc2)": 1523,
      "o2)c1": 1524,
      "c2ccccn2)CC1": 1525,
      "Cc1o": 1526,
      "C(N)=N": 1527,
      "n3)n": 1528,
      "c1ccc(-c2cs": 1529,
      "c4c3)": 1530,
      "c2ccc(Br)cc2)": 1531,
      "c4ccc(F)cc4)": 1532,
      "Cc1ccccc1-": 1533,
      ")N1CCN(c2ccccc2)CC1": 1534,
      "F)cccc1": 1535,
      "2)cc1)": 1536,
      "CC23": 1537,
      "CC4CC(CC(C4)C2)": 1538,
      "c1ccc(C(": 1539,
      "(C4": 1540,
      "CCC(F)": 1541,
      "c3ccccc3Cl)": 1542,
      "4CCCC4)": 1543,
      "P(=O)(O": 1544,
      "C(C)CO)": 1545,
      "c1cn2": 1546,
      "N=Cc1ccccc1": 1547,
      "C(=O)C(NC(=O)": 1548,
      "C2CCC3": 1549,
      "c2cncn": 1550,
      "C=NNC(=O)": 1551,
      "c3cc4cccc": 1552,
      "c1ncc(": 1553,
      "OCC(=O)N": 1554,
      "CCOCC2": 1555,
      "C3=N": 1556,
      "c2ccc(C(=O)O)": 1557,
      "nc(N2": 1558,
      "nc(NC(=O)": 1559,
      "c3ncccn": 1560,
      "c2c(c1": 1561,
      "C1=C(C)": 1562,
      "Cc1ccc(O)cc1": 1563,
      "c(=O)cc": 1564,
      "C1c1ccccc1": 1565,
      "CCc1cc(": 1566,
      "c4ccc(-": 1567,
      "c1ccco1)": 1568,
      "Cc1ccncc1": 1569,
      "CN2CCC(": 1570,
      "CC1O": 1571,
      "c3ccccc3F)": 1572,
      "=O)cc1": 1573,
      "[N-]": 1574,
      "O=C1CS": 1575,
      "CCCCC3": 1576,
      "c3cccc(C(F)(F)F)": 1577,
      "CCc1ccc(": 1578,
      "c3ccccc3-": 1579,
      "CCOCC2)c1": 1580,
      "c1ncccc1": 1581,
      "COc1ccc(S(=O)(=O)N": 1582,
      "Cc1[nH]": 1583,
      "N1CCC(": 1584,
      "Cc1nc(-": 1585,
      "c1ccc(O)cc1)": 1586,
      "C3CCCCC3": 1587,
      "c2ccc(F)": 1588,
      "CCCCCCN": 1589,
      "cc(-c3ccccc3)": 1590,
      "c4ccc5c(": 1591,
      "c4cccc(": 1592,
      "C6": 1593,
      "C1CCN(S(=O)(=O)": 1594,
      "Cc1cccc2": 1595,
      "c2c(-c3ccccc3)": 1596,
      "Cc1ccc(-c2n": 1597,
      "c1ccc(CC": 1598,
      "CCn1cc": 1599,
      "C(CS": 1600,
      "c2ccc(C)cc2)": 1601,
      "C(=O)N2CCN(": 1602,
      "c3nc(N": 1603,
      "C3(C)": 1604,
      "c2cccc([N+](=O)[O-])": 1605,
      "CCCC4)": 1606,
      "Cc2cc(": 1607,
      "c1nnc(-": 1608,
      "c2ccc3ccccc3c2)": 1609,
      "c2c1cc": 1610,
      "c2C)cc1": 1611,
      "ncn2)cc1": 1612,
      "c2cc(F)": 1613,
      "c1ccc(-c2nc(": 1614,
      "c3cs": 1615,
      "C1CC": 1616,
      "CO2": 1617,
      "C5CCC43C)": 1618,
      "c1ncc(-": 1619,
      "cccc4": 1620,
      "[Si": 1621,
      "c2scc": 1622,
      "s2)c1": 1623,
      "c4ccc(O)": 1624,
      "CCCCN(": 1625,
      "CNC(=O)N": 1626,
      "c4ccc(N": 1627,
      "c1cnc(N": 1628,
      "c1cnccn1": 1629,
      "N1CCCCC1": 1630,
      "c3ccc([N+](=O)[O-])cc": 1631,
      "c2cccc(C(F)(F)F)c2)": 1632,
      "C2=O)c1": 1633,
      "C3CCC4": 1634,
      "c2ccc3c(c2)OCCO": 1635,
      "C2CO": 1636,
      "CCCCn1": 1637,
      "CN=C(O)": 1638,
      "c23)c1": 1639,
      "CC1CC1": 1640,
      "c2cccc(C)": 1641,
      "c3cc(O": 1642,
      "COc1ccc2c(": 1643,
      "c4c3": 1644,
      "O)cc3": 1645,
      "CCn1cc(": 1646,
      "COc1ccccc1-": 1647,
      "c1cccs1)": 1648,
      "2)c1ccccc1": 1649,
      "Nc1ncc": 1650,
      "N#Cc1ccc(": 1651,
      "nc1N": 1652,
      "c3nnn": 1653,
      "[S+]([O-])": 1654,
      "[n+]([O-])": 1655,
      "c2nnc(-": 1656,
      "OCO3": 1657,
      "C4CCCCC": 1658,
      "c1ccsc1": 1659,
      "c1ccncc1)": 1660,
      "c2N": 1661,
      "c2nn[nH]": 1662,
      "nn1-": 1663,
      "CCN(CC": 1664,
      "COC(=O)N": 1665,
      "nc[nH]": 1666,
      "c(n1)": 1667,
      "c3ccc(C)cc3)": 1668,
      "C(=NN": 1669,
      "c(-c4ccccc4)": 1670,
      "n(Cc2ccccc2)": 1671,
      "S(C)(=O)=O": 1672,
      "CC2)C1": 1673,
      "CC3CC3)": 1674,
      "c2cccc(O)": 1675,
      "n3cccn": 1676,
      "c1nccs1)": 1677,
      "C1O)": 1678,
      "c2c3ccccc3": 1679,
      "c2no": 1680,
      "c3cn[nH]": 1681,
      "c1n[nH]": 1682,
      "CC(=O)NC(": 1683,
      "C2)n1": 1684,
      "c1nc2ccccc2s1": 1685,
      "C=CC(": 1686,
      "C(=O)NC2": 1687,
      "c23)CC1": 1688,
      "c3n2": 1689,
      "CC1CCCO1": 1690,
      "c1Cl": 1691,
      "O=c1cc(-": 1692,
      "C(=O)O1": 1693,
      "CC2C1": 1694,
      "c(=O)c(C(=O)O)": 1695,
      "(Cc3ccccc3)": 1696,
      "Cc1ccc(S(=O)(=O)N2": 1697,
      "ncc(": 1698,
      "c(=O)c2c1": 1699,
      ")NC1": 1700,
      "c4ccccc4)cc3)": 1701,
      "Cc1cc2c(": 1702,
      "c1nc(C)": 1703,
      "c1-2": 1704,
      "C2C": 1705,
      "CCNC1": 1706,
      "CCC12C": 1707,
      "4CCCCC4)": 1708,
      "C(=S)N1": 1709,
      "CCCCCC": 1710,
      "c1cc2cc(": 1711,
      "O=C(NCCN1": 1712,
      "c2ccc(F)cc2)cc1": 1713,
      "c2ccccc2)cc1)": 1714,
      "Nc1ncn": 1715,
      "CCOc1cc(": 1716,
      "c2ncccc2c1": 1717,
      "c1ccc2c(c1)OCCO2": 1718,
      "C1=O)N": 1719,
      "CCCCC2)CC1": 1720,
      "c3ccc4": 1721,
      "C#C": 1722,
      "CCCC(C)=": 1723,
      "c4ccc(Cl)cc4)": 1724,
      "C1C": 1725,
      "[PH]": 1726,
      "5CCO": 1727,
      "c2ccccc21)": 1728,
      "CC1=N": 1729,
      "c1ccc(-c2nc3ccccc3": 1730,
      "c1ccc(Cl)c(Cl)c1": 1731,
      "C(C)NC(=O)": 1732,
      "C)c1": 1733,
      "(CC": 1734,
      "O=C1CC2": 1735,
      ")cc1)": 1736,
      "c2cccc(F)c2)": 1737,
      "c2cc(Cl)ccc2": 1738,
      "C(O)C2O)": 1739,
      "c(=O)[nH]c2=O)": 1740,
      "c1ccc(CC2": 1741,
      "n2cc(": 1742,
      "c2cc(OC)c(OC)c(OC)": 1743,
      "CCCN1CCN(": 1744,
      "[Si]": 1745,
      "c3cccc(F)c3)": 1746,
      ")N1CCNCC1": 1747,
      "CC(C(=O)O)": 1748,
      "c2cco": 1749,
      "2)N": 1750,
      "C(=O)c3ccccc3": 1751,
      "cc1-": 1752,
      "c1ccc(N2CCN(": 1753,
      "c4cccc5": 1754,
      "3cccc": 1755,
      "C(=O)C3": 1756,
      "c2c1=O": 1757,
      "c1cccc(C(F)(F)F)c1": 1758,
      "c3c(Cl)cc": 1759,
      "N1CCCC1": 1760,
      "c3ccccc3n2)cc1": 1761,
      "e]": 1762,
      "c3cccc(-": 1763,
      "C(C(=O)": 1764,
      "C(=O)NS(=O)(=O)": 1765,
      "c6ccccc6": 1766,
      "c2n(": 1767,
      "N2CCC(": 1768,
      "c2c(N": 1769,
      "Br)c1": 1770,
      "c2cc(=O)": 1771,
      "CC3(": 1772,
      "=S)": 1773,
      "COc1cccc2": 1774,
      "C(O)C(O)C1O": 1775,
      "n1C": 1776,
      "OCc3ccccc3)": 1777,
      "3)n2)": 1778,
      "C1OC(CO)": 1779,
      "C2S": 1780,
      "=NN": 1781,
      "Cc1c(-": 1782,
      "nnc1": 1783,
      "Cc1nc2ccccc2": 1784,
      "CC=C(C)C)": 1785,
      "c4ccco4)": 1786,
      "C(Cc1ccccc1)NC(=O)": 1787,
      "ccc12": 1788,
      "OCCCC": 1789,
      "c2ccc(F)cc2)CC1": 1790,
      "CN3CCCC": 1791,
      ")cc21": 1792,
      "C=NN": 1793,
      "Cn1cc(-": 1794,
      "O=C1CO": 1795,
      "CN=C(": 1796,
      "c(n2)": 1797,
      "n2)C1": 1798,
      "c2cn[nH]": 1799,
      "c1csc(-": 1800,
      "CCS(=O)(=O)C1": 1801,
      "OC(C)(C)C)": 1802,
      "C(S)=N": 1803,
      "NC(=O)C(C": 1804,
      "c2ccc(-c3ccccc3)cc2)": 1805,
      "cn12": 1806,
      "Cc1s": 1807,
      "C(=O)N2CCC(": 1808,
      "CCOC1": 1809,
      "c(=O)n(C": 1810,
      "c3c[nH]c4ccccc34)": 1811,
      "n23)cc1": 1812,
      "n2cnc3c(": 1813,
      "nc2s": 1814,
      "Cc1ncc": 1815,
      "S(=O)(=O)c2ccccc2)": 1816,
      "c2cnc(N": 1817,
      "c1ccc(-c2ccccc2)": 1818,
      "c4cccnc4)": 1819,
      "O1)": 1820,
      "n5": 1821,
      "C(=O)OCC(=O)N": 1822,
      "nn3)": 1823,
      "CCC1(": 1824,
      "CN4": 1825,
      "c3cncc": 1826,
      "CC1CC1)": 1827,
      "c1nc(N)": 1828,
      "c(-c2ccccc2)n1": 1829,
      "c3ccc(C(=O)N": 1830,
      "c2ccncc2)cc1": 1831,
      "n(-c2ccccc2)n1": 1832,
      "c3ccc(OC)cc": 1833,
      "c4cc5": 1834,
      "c1ccc2s": 1835,
      "CCc1c(": 1836,
      "C[n+]1": 1837,
      "c3n2)": 1838,
      "Oc2ccccc21": 1839,
      "CC1(O)": 1840,
      "c3ccn": 1841,
      "Br)cc(": 1842,
      "CN(C)C)": 1843,
      "(C)C)cc1": 1844,
      "CCCO)": 1845,
      "C2CCCCC2": 1846,
      "c1cc(O": 1847,
      "n[nH]1": 1848,
      "O=C1c2ccccc2C(=O)N1": 1849,
      "O=C1CCC2": 1850,
      "C=O)": 1851,
      "COc1ccc(C(=O)": 1852,
      "c1ccc2nc(": 1853,
      "COc1cc(N": 1854,
      "c2)N": 1855,
      "O=C(Nc1ccc(": 1856,
      "Cc1cc(C)cc(": 1857,
      "c5ccc(": 1858,
      "c3ncnc(N": 1859,
      "C(=O)C1=": 1860,
      "COc1cc(C2": 1861,
      "CC1CCC(": 1862,
      "c2O)": 1863,
      "c1cn[nH]c1": 1864,
      "c1cc2c(s1)": 1865,
      "N=C(C)": 1866,
      "c1nnn": 1867,
      "=N1": 1868,
      "ncnc(N": 1869,
      "O=C(Nc1ccccc1)c1ccccc1": 1870,
      "c2cc1O": 1871,
      "c2ccccc2c1)": 1872,
      "CCO1": 1873,
      "c3ccccc3)cc2)cc1": 1874,
      "c2ccc(OC)cc2)": 1875,
      "O=C(Nc1ccccc1)N1": 1876,
      "C12CC3CC(CC(C3)C1)C2": 1877,
      "c2=O)c1": 1878,
      "c2ncnc3": 1879,
      "c4nn": 1880,
      "C(=O)c2ccccc21": 1881,
      "c-3": 1882,
      "c5cn": 1883,
      "C(C1)": 1884,
      "=C(C)": 1885,
      "c1cnc(N2": 1886,
      "c2ccc(OC)": 1887,
      "c2ccc(C3": 1888,
      "C1N": 1889,
      "c2ccc(Cl)cc2)CC1": 1890,
      "C23CC4CC(CC(C4)C2)": 1891,
      "C3CCCC3)": 1892,
      "Cc2ccccc2)CC1": 1893,
      "C1C2": 1894,
      "C1CCNCC1": 1895,
      "co2)cc1": 1896,
      "Cl)N": 1897,
      "COc1cc2c(": 1898,
      "c3[nH]2)cc1": 1899,
      "c(C2": 1900,
      "c3ccc(NC(=O)": 1901,
      "C(C)(C)C5CCC43C)": 1902,
      "O=C(NC1CCCCC1)": 1903,
      "n3-": 1904,
      "C(C)(C)C)cc1": 1905,
      "NC(=O)CS": 1906,
      "O=C1CCC(": 1907,
      "CCC4)": 1908,
      "CN(C)S(=O)(=O)": 1909,
      "c(CO": 1910,
      "Cc1ccc(S(=O)(=O)": 1911,
      "c2cccc3c2": 1912,
      "C(O)C2": 1913,
      "c2ccccc2o1": 1914,
      "c3ccc4[nH]": 1915,
      "nc1)": 1916,
      "C(C)O": 1917,
      "c1cnn(-": 1918,
      "c1ccc(-n2cn": 1919,
      "CCC(F)(F)": 1920,
      "nc1-c1ccccc1": 1921,
      "N(C)C(=O)": 1922,
      "c2cc(C3": 1923,
      "C2CCN(C": 1924,
      "sc2": 1925,
      "Cl)cn": 1926,
      "CC(C)C(NC(=O)": 1927,
      "O=C1CC(c2ccccc2)": 1928,
      "CCN(CC)C(=O)": 1929,
      "OCC(O)": 1930,
      "O=C(Nc1cccc(-": 1931,
      "c4ccc5c(c4)": 1932,
      "C1=CC2": 1933,
      "cccc12": 1934,
      "nc3cccc": 1935,
      "c1ccc(NS(=O)(=O)": 1936,
      "c3F)": 1937,
      "CC(CO": 1938,
      "OCCN": 1939,
      "CCCC(N": 1940,
      "CCn1c(=O)": 1941,
      "SC": 1942,
      "Cl)c1)": 1943,
      "CC(=O)Nc1ccccc1": 1944,
      "CCCN(CCC)": 1945,
      "nc3ccccc23)cc1": 1946,
      "c3cnc(N": 1947,
      "O=C(CN1C(=O)": 1948,
      "c3ccc(Cl)c(Cl)": 1949,
      "Cc1ccc(N2": 1950,
      "CCC3(CC2)": 1951,
      "CCN1CCOCC1": 1952,
      "cn4)": 1953,
      "CN=": 1954,
      "Cc1nn(C)": 1955,
      "c3cccc(C)": 1956,
      "CC2)n1": 1957,
      "C1CC1)": 1958,
      "[nH]cc": 1959,
      "c2ccncc2": 1960,
      "c2ccc(C": 1961,
      "C4=O)": 1962,
      "c3ccc(OC)": 1963,
      "cnc1)": 1964,
      "c1ccc2[nH]ccc2c1": 1965,
      "c3ccc(F)": 1966,
      "s1)c1ccccc1": 1967,
      "c3cccc(C(F)(F)F)c3)": 1968,
      "c23": 1969,
      "C(=O)N1CCN(C(=O)": 1970,
      "c1ccc(-c2ccc(-": 1971,
      "c4ncn": 1972,
      "CN(Cc1ccccc1)": 1973,
      "n2n1": 1974,
      "c3cc(Cl)ccc3": 1975,
      "OC5": 1976,
      "c2cccc(OC)": 1977,
      "C=CC=": 1978,
      "cc(O)": 1979,
      "S=": 1980,
      "c2ccc([N+](=O)[O-])cc2)": 1981,
      "C(=O)NCc1ccccc1": 1982,
      ")cc3": 1983,
      "CCN1CCC(": 1984,
      "O=P": 1985,
      "CNCC2": 1986,
      "n2cccn": 1987,
      "Cc1nc(N": 1988,
      "c2nccc(-": 1989,
      ")N(C": 1990,
      "CCCN1C(=O)": 1991,
      "C(=O)OCC": 1992,
      "C(Cc1c[nH]c2ccccc12)": 1993,
      "c2c(F)cccc2": 1994,
      "nnc(-": 1995,
      "c1ccc2c(-": 1996,
      "c1cc2cc": 1997,
      "c2ccccc2)NC(=O)": 1998,
      "n2c(": 1999,
      "OCO4": 2000,
      "CCl)": 2001,
      "NC(=O)C2": 2002,
      "CC(O)(": 2003,
      "c43)": 2004,
      "C34": 2005,
      "O=C(Cn1cc": 2006,
      "C(=O)N1c1ccccc1": 2007,
      "C5)": 2008,
      "O=c1ccn(C2": 2009,
      "c1c(F)cccc1": 2010,
      "c7": 2011,
      "[nH]2)c1": 2012,
      "O=C1C(": 2013,
      "c1ccc2c(c1)OCO2)": 2014,
      "c1cc(Cl)": 2015,
      "[nH]c12": 2016,
      "3)ccc21": 2017,
      "N1CCN(C(=O)": 2018,
      "CCC1)": 2019,
      "c(=N)": 2020,
      ")cc2)cc1": 2021,
      "c2ccccc2S": 2022,
      "c([N+](=O)[O-])c1": 2023,
      "c4ccc(C)": 2024,
      "COc1ccc2[nH]": 2025,
      "c2ccc3": 2026,
      "Cc1co": 2027,
      "O)cc(O)": 2028,
      "NC1=O": 2029,
      "C(=O)O)c1": 2030,
      "N=C(S)N": 2031,
      "c1ccc(Cl)cc1Cl": 2032,
      "c4cc(Cl)cc": 2033,
      "CCN(C)CC3)": 2034,
      "c2cn(": 2035,
      "CCCN(S(=O)(=O)": 2036,
      "cnn2": 2037,
      "C=CC2": 2038,
      "CC(=O)NC1": 2039,
      "3)n2)c1": 2040,
      "nc(O": 2041,
      "c1ccc(F)cc1F": 2042,
      "c3ccccc23)CC1": 2043,
      "c(=O)c2": 2044,
      "C(OC2": 2045,
      "C2(O)": 2046,
      "c4cccs": 2047,
      "cnn2-": 2048,
      "n3c(": 2049,
      "c1nc2ccccc2[nH]1": 2050,
      "C(CC(=O)O)": 2051,
      "O=C(OC": 2052,
      "c3ccc(O)cc3)": 2053,
      "c3c(c1)": 2054,
      "C1CCN(C(=O)": 2055,
      "nn1)": 2056,
      "3)cc(": 2057,
      "nc(SC": 2058,
      "c2cccc(NC(=O)": 2059,
      "4CCN(": 2060,
      "3)nc12": 2061,
      "c1cccc(S(=O)(=O)N": 2062,
      "C=CCO": 2063,
      "c2ncnc(N": 2064,
      "O=C1C=C2": 2065,
      "c1cncnc1": 2066,
      "c3cccc4ccccc34)": 2067,
      "CCNCC3)cc": 2068,
      "c1ccc2ncccc2c1": 2069,
      "CCCc1ccccc1": 2070,
      "c2ccc(O)cc2": 2071,
      "c4ccncc4)": 2072,
      "c2cccs2)cc1": 2073,
      "COc1ccc(CNC(=O)": 2074,
      "c3c(F)cccc3": 2075,
      "C1=C(O)": 2076,
      "CC2CCC(": 2077,
      "N2CCCCC2)": 2078,
      "CC(O)CO": 2079,
      "c2-c2ccccc2)cc1": 2080,
      "cn2)CC1": 2081,
      "c4ccc(OC)": 2082,
      "c1ccc(C#N)cc1": 2083,
      "C(=O)NC(CC(C)C)": 2084,
      "c2ccc(=O)": 2085,
      "c1cc(O)": 2086,
      "C2CCCCC2)cc1": 2087,
      "C1=C2": 2088,
      "nc3ccccc3": 2089,
      "2)c1C": 2090,
      "Cn1c(": 2091,
      "c2ccccc21)N": 2092,
      "c(Cl)cc1": 2093,
      "Cc1ccc2c(c1)OCO2": 2094,
      "4CCNCC4)": 2095,
      "C=Cc1ccccc1": 2096,
      "CCOC(=O)c1c(": 2097,
      "[N+]=": 2098,
      "CCCN(C)C)": 2099,
      "nnc1-": 2100,
      "c3n(": 2101,
      "c2cn1": 2102,
      "c2[nH]c3ccccc3": 2103,
      "nc3c2": 2104,
      "C(OC)": 2105,
      "CCN)": 2106,
      "c1ncn2C1": 2107,
      "O=C(NCCCN1": 2108,
      "CCCN(C)": 2109,
      "CCNC(=O)N": 2110,
      "c2nn": 2111,
      "c2cc(Br)cc": 2112,
      "CC4)cc3)": 2113,
      "3CCN(": 2114,
      "OO": 2115,
      "nn12": 2116,
      "nc1C": 2117,
      "[Si](C)": 2118,
      "CCCO1)": 2119,
      ")ccc1-": 2120,
      "CCN3CCCC": 2121,
      "oc(=O)": 2122,
      "c1ccc(CS": 2123,
      "C1CCN(C": 2124,
      "O=C(NC(": 2125,
      "ccc1O": 2126,
      "O=C(C=Cc1ccc(": 2127,
      "C(=O)C(C)": 2128,
      "CN1CCCC1": 2129,
      "C(=Cc1ccccc1)": 2130,
      "c2ncnc3[nH]": 2131,
      "C1(O)": 2132,
      "[nH]c2ccccc12": 2133,
      "c(F)c2)": 2134,
      "cc1Cl": 2135,
      "CCN2CCOCC2)": 2136,
      "nn(C)": 2137,
      "c1ccc(-n2cc": 2138,
      "C(C)C)c1": 2139,
      "CC1CCN(": 2140,
      "ncc4": 2141,
      "c1cc2[nH]": 2142,
      "C(=O)OC2": 2143,
      "C(=O)NC(CC(=O)O)": 2144,
      "CC1CCC2": 2145,
      "CCCN=C(N)N": 2146,
      "n3ccnc3)": 2147,
      "C(=O)N(C)C)": 2148,
      "(C#N)cc": 2149,
      "c3c1": 2150,
      "CCCCN)": 2151,
