{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 102,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 102
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          0
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          1
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<bos>": 0,
      "<eos>": 1,
      "<pad>": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "(": 6,
      ")": 7,
      "*": 8,
      "+": 9,
      "-": 10,
      ".": 11,
      "/": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "6": 19,
      "7": 20,
      "8": 21,
      "9": 22,
      ":": 23,
      "<": 24,
      "=": 25,
      ">": 26,
      "?": 27,
      "@": 28,
      "B": 29,
      "C": 30,
      "F": 31,
      "H": 32,
      "I": 33,
      "N": 34,
      "O": 35,
      "P": 36,
      "S": 37,
      "[": 38,
      "\\": 39,
      "]": 40,
      "b": 41,
      "c": 42,
      "e": 43,
      "i": 44,
      "l": 45,
      "n": 46,
      "o": 47,
      "p": 48,
      "r": 49,
      "s": 50,
      "~": 51,
      "cc": 52,
      "CC": 53,
      "O)": 54,
      "c1": 55,
      "C(": 56,
      "=O)": 57,
      "c(": 58,
      "c2": 59,
      "C)": 60,
      "c1cc": 61,
      "C(=O)": 62,
      "c3": 63,
      "c2cc": 64,
      ")cc": 65,
      "(=O)": 66,
      "(C)": 67,
      "C1": 68,
      "c1ccc(": 69,
      "CCCC": 70,
      "c3cc": 71,
      "CO": 72,
      "2)": 73,
      "F)": 74,
      "CN": 75,
      "c1cccc": 76,
      "C(=O)N": 77,
      "C2": 78,
      "Cl": 79,
      "c2cccc": 80,
      "cn": 81,
      ")cc1": 82,
      "CCN": 83,
      "c4": 84,
      "=C(": 85,
      "3)": 86,
      "CC1": 87,
      "n1": 88,
      "c2ccccc2": 89,
      "nc(": 90,
      "c2ccc(": 91,
      "C(C)": 92,
      "c1ccccc1": 93,
      "NC(=O)": 94,
      "c3cccc": 95,
      "[n": 96,
      "N)": 97,
      "CC(": 98,
      "H]": 99,
      "[nH]": 100,
      "CC(=O)": 101,
      "CCO": 102,
      "S(=O)": 103,
      "S(=O)(=O)": 104,
      "Cl)": 105,
      "CCN(": 106,
      "C3": 107,
      "O=C(": 108,
      "c3ccccc3": 109,
      "OC)": 110,
      "c1cc(": 111,
      "cccc": 112,
      "(F)": 113,
      "n2": 114,
      "C=": 115,
      "CC(C)": 116,
      "c2c(": 117,
      "c1n": 118,
      "c3ccc(": 119,
      "cc1": 120,
      "cc(": 121,
      "Cc1ccc(": 122,
      "C(F)": 123,
      "CC2": 124,
      "F)cc": 125,
      "c2)": 126,
      "CC(=O)N": 127,
      "c2ccccc2)": 128,
      "c2n": 129,
      "C(F)(F)": 130,
      "Cl)cc": 131,
      "+]": 132,
      "C(O)": 133,
      "c(=O)": 134,
      "c1cccc(": 135,
      ")N": 136,
      "COc1ccc(": 137,
      "4)": 138,
      "c2cc(": 139,
      "OC": 140,
      "=O": 141,
      "=N": 142,
      "CCC(": 143,
      "CCCN": 144,
      "-]": 145,
      "(C": 146,
      "c(-": 147,
      "[N": 148,
      "CCC": 149,
      "[O": 150,
      "[O-]": 151,
      "[N+]": 152,
      "c1)": 153,
      "2)cc1": 154,
      "Br": 155,
      "O=": 156,
      "N2": 157,
      "C(C": 158,
      "C(=O)O)": 159,
      "c4cccc": 160,
      "CC2)": 161,
      "c3c(": 162,
      "nc(-": 163,
      "Cc1": 164,
      "c2c1": 165,
      "C(=O)O": 166,
      "c3ccccc3)": 167,
      "C(C)(C)": 168,
      "c3)": 169,
      "c(C)": 170,
      "C(=": 171,
      "N1": 172,
      "c1ccccc1)": 173,
      "cs": 174,
      "(=O)[O-]": 175,
      "[N+](=O)[O-]": 176,
      "c5": 177,
      "O=C(N": 178,
      "nn": 179,
      "CC3": 180,
      "C#": 181,
      "Cc1cc": 182,
      "(O)": 183,
      "c4cc": 184,
      "C(F)(F)F)": 185,
      "CN1": 186,
      "c(N": 187,
      "c12": 188,
      "cc2": 189,
      "2)c1": 190,
      "c4ccccc4": 191,
      "COC(=O)": 192,
      "CS": 193,
      "1)": 194,
      "n(": 195,
      "CN(": 196,
      "c(O)": 197,
      "CC3)": 198,
      "c3n": 199,
      "CCC2": 200,
      "CC(O)": 201,
      "c2cccc(": 202,
      "S(=O)(=O)N": 203,
      "n3": 204,
      "CCC1": 205,
      "CC)": 206,
      "c(OC)": 207,
      "nc(N": 208,
      "Cn1": 209,
      "Cl)cc1": 210,
      "CCCCCCCC": 211,
      "2)CC1": 212,
      "co": 213,
      "COc1cc(": 214,
      "CN(C)": 215,
      ")cc2": 216,
      "C(=O)N1": 217,
      "F)cc1": 218,
      "C4": 219,
      "C(C)C)": 220,
      "C(N)": 221,
      "nc2": 222,
      "Cc1cc(": 223,
      "c1ccc2c(": 224,
      "CCOC(=O)": 225,
      "c(Cl)": 226,
      "N=C(": 227,
      "c[nH]": 228,
      "C2)": 229,
      "Cc1ccccc1": 230,
      "c2cn": 231,
      "c1cc2": 232,
      "CNC(=O)": 233,
      "c1ccc(-": 234,
      "cc3": 235,
      "O=C1": 236,
      "c3cc(": 237,
      "CC(C)(C)": 238,
      "CCN1": 239,
      "N=": 240,
      "nc1": 241,
      "Br)": 242,
      "c2ccc(Cl)cc": 243,
      "c1cn": 244,
      "C3)": 245,
      "O=C(O)": 246,
      "C(C)=O)": 247,
      "N(": 248,
      "Cc1n": 249,
      "CCCCC1": 250,
      "CN2": 251,
      "c1O": 252,
      ")N1": 253,
      "(C)C)": 254,
      ")cc(": 255,
      "C1O": 256,
      ")cc2)": 257,
      "C(F)(F)F)cc": 258,
      "C(=O)N2": 259,
      "CCN(C(=O)": 260,
      "C(C)(C)C)": 261,
      "C1=O": 262,
      "[N+](=O)[O-])": 263,
      "CCC3": 264,
      "cc2)": 265,
      "c1c(": 266,
      "cc(-": 267,
      "Cc2ccc(": 268,
      "c1ccc2c(c1)": 269,
      "NC(=O)N": 270,
      "ncn": 271,
      "N#": 272,
      "(=O)=O)": 273,
      "OC(": 274,
      "OC(=O)": 275,
      "o1": 276,
      "s1": 277,
      "c2nc(": 278,
      "CCCC1": 279,
      "C#N)": 280,
      "CC4": 281,
      "Cc1cccc(": 282,
      "c23)": 283,
      "c1nc(": 284,
      "CC2)cc1": 285,
      "OCO": 286,
      "=C(C)": 287,
      "c2)cc1": 288,
      "c1ccc(Cl)cc1": 289,
      "CC1)": 290,
      "c(F)": 291,
      "n2)cc1": 292,
      "NS(=O)(=O)": 293,
      "n2)": 294,
      "n(C)": 295,
      "3)cc1": 296,
      "cn1": 297,
      "c2[nH]": 298,
      "c1=O": 299,
      "c21": 300,
      "O)cc1": 301,
      "c3cccc(": 302,
      "c2ccc(F)cc": 303,
      "P(=O)": 304,
      "c4ccc(": 305,
      "OC1": 306,
      "C(=S": 307,
      "5)": 308,
      "CC=": 309,
      "CCn1": 310,
      "nc3": 311,
      "cc3)": 312,
      "C2=O)": 313,
      "N3": 314,
      "C(CO)": 315,
      "c1cccc2": 316,
      "C(=O)NC(": 317,
      "COc1cccc(": 318,
      "c1-": 319,
      "c2ccc3c(": 320,
      "CCNC(=O)": 321,
      "CCC4": 322,
      "n(-": 323,
      "c2ccccc21": 324,
      "COc1ccccc1": 325,
      "c2ccc(-": 326,
      "C=C": 327,
      "CC(=O)O)": 328,
      "c2ccccc2)cc1": 329,
      "CCN(C": 330,
      ")cc3)": 331,
      "CO)": 332,
      "Cc1ccc(-": 333,
      "C(N)=O)": 334,
      "c4ccccc4)": 335,
      "c4)": 336,
      "CCCO": 337,
      "c2cc3": 338,
      "COc1ccc(-": 339,
      "[n+]": 340,
      "c(=O)[nH]": 341,
      "n3)": 342,
      "C(=O)N(": 343,
      "c2=O)": 344,
      "S(C)": 345,
      "c2n1": 346,
      "c4c(": 347,
      "C2CCCC": 348,
      "c3ccc(Cl)cc": 349,
      "C12": 350,
      "c3ccc(F)cc": 351,
      "C(=N)": 352,
      "CCCN(": 353,
      "C)cc1": 354,
      "CCCN1": 355,
      "c3cn": 356,
      "CCC(C)": 357,
      ")cc3": 358,
      "C#N": 359,
      "CC4)": 360,
      "Nc1n": 361,
      "[O-])": 362,
      "c1ccc(O": 363,
      "c1ccc(F)cc1": 364,
      "NC(=O)C(": 365,
      "c2ccc3c(c2)": 366,
      "n1)": 367,
      "c2cccn": 368,
      "CCN(C)": 369,
      "CC(=O)O": 370,
      "S)": 371,
      "c2ccc(Cl)cc2)": 372,
      "CCS": 373,
      "OC)c(OC)": 374,
      "C2)cc1": 375,
      "c1ccc(N": 376,
      "c(N)": 377,
      "c2nc(-": 378,
      "C(=S)N": 379,
      "CC1(C)": 380,
      "ncc": 381,
      "c5cccc": 382,
      "C=N": 383,
      "([O-])": 384,
      "S(C)(=O)=O)": 385,
      "CCN2": 386,
      "c1OC": 387,
      "CCCC2": 388,
      "C5": 389,
      "CCN(CC)": 390,
      "Cn2": 391,
      "CCCC(": 392,
      "c(O": 393,
      "c1cc(-": 394,
      "C(O)C(O)": 395,
      "C(O": 396,
      "P(=O)(O)": 397,
      "CC(C)C)": 398,
      "COc1cc2": 399,
      "3)cc": 400,
      "c(C)c1": 401,
      "nn1": 402,
      "CCC(=O)N": 403,
      "c2)c1": 404,
      "c12)": 405,
      "CC(=O)N1": 406,
      "N(C)": 407,
      "c2cc(-": 408,
      "C2(": 409,
      "O1": 410,
      "3CCCC": 411,
      "c(C(=O)N": 412,
      "cn2": 413,
      "#N)": 414,
      "c2ncn": 415,
      "C=C(": 416,
      "C1=": 417,
      "C(=O)C(": 418,
      "nc(C)": 419,
      "Cc2ccccc2)": 420,
      "S(=O)(=O)N2": 421,
      "c2ccccc12": 422,
      "CCO)": 423,
      "Cl)c(Cl)": 424,
      "n(C": 425,
      "(-": 426,
      "cs1": 427,
      "c2s": 428,
      "C1)": 429,
      "no": 430,
      "Cc1cc(C)": 431,
      "cnc1": 432,
      "CN(C": 433,
      "c2cc1": 434,
      "Cc1cn": 435,
      "NC(": 436,
      "ncc1": 437,
      "CC(NC(=O)": 438,
      "CCOCC2)": 439,
      "C(Cc1ccccc1)": 440,
      "=C(O)": 441,
      "c2ccc(O": 442,
      "C4)": 443,
      "c2ncc": 444,
      "CS(=O)(=O)": 445,
      "c3ccc(F)cc3)": 446,
      "c1nc(-": 447,
      "COc1cc": 448,
      ")ccc1": 449,
      "O)cc": 450,
      "Cl)c1": 451,
      "CCC(O)": 452,
      "OCCO": 453,
      "c2cccc3": 454,
      "CC(N)": 455,
      "c3[nH]": 456,
      "C1(": 457,
      "nc2c1": 458,
      "SCC(=O)N": 459,
      "c3cccn": 460,
      "c2ccc(F)cc2)": 461,
      "n[nH]": 462,
      "C1CCCCC1": 463,
      "c5ccccc5": 464,
      "C3CCCC": 465,
      "n4": 466,
      "Br)cc1": 467,
      "CCOCC1": 468,
      "CN(C(=O)": 469,
      "CCOc1ccc(": 470,
      "c2ccc(C)": 471,
      "c34)": 472,
      "Cc1c(": 473,
      "C1(C)": 474,
      "c1c[nH]": 475,
      "OC2": 476,
      "C(O)=N": 477,
      "c3ccc(Cl)cc3)": 478,
      "CCOCC3)": 479,
      "C=C1": 480,
      "ccc(": 481,
      "cc(C)": 482,
      "c2o": 483,
      "c2)CC1": 484,
      "c1[nH]": 485,
      "c2ccc(Cl)cc2": 486,
      "cccc2": 487,
      "c4cc(": 488,
      "N=C(N)": 489,
      "(N)": 490,
      "O=S(=O)": 491,
      "nc(N)": 492,
      "cc4": 493,
      "c2nc3ccccc3": 494,
      ")cc(OC)": 495,
      "c2c(C)": 496,
      "Cc2ccccc2": 497,
      "c(cc1": 498,
      "C1CCN(": 499,
      "CCCC(=O)": 500,
      "CCCN2": 501,
      "c2ccco": 502,
      ")cc2)cc1": 503,
      "cccc1": 504,
      "C(F)(F)F)cc1": 505,
      "CSc1n": 506,
      "CC12": 507,
      "c3ccccc23)": 508,
      "c2cc(Cl)cc": 509,
      "C2=N": 510,
      "c1s": 511,
      "C(C)C": 512,
      "CC2)c1": 513,
      "c1cccc(-": 514,
      "n1-": 515,
      "cccn": 516,
      "c2cccc(Cl)": 517,
      "CC(F)": 518,
      "c23)cc1": 519,
      "c2cccs": 520,
      "C3=O)": 521,
      "[N+](=O)[O-])cc1": 522,
      "Cl)c(": 523,
      "[S": 524,
      "C=C2": 525,
      "c6": 526,
      "C(=O)OC)": 527,
      "c2ccn": 528,
      "O=S(=O)(": 529,
      "CN3": 530,
      "C(=O)NC": 531,
      "N=C(O)": 532,
      "CCC2(": 533,
      "CN1CCN(": 534,
      "c2nc(N": 535,
      "ccc3": 536,
      "OCC": 537,
      "C2=O": 538,
      "c2ccccc2)CC1": 539,
      "[N+]([O-])": 540,
      "c2ccc(O)": 541,
      "c2c[nH]": 542,
      "CC1(": 543,
      "C(=N": 544,
      "c2c(c1)": 545,
      "c3ccc(-": 546,
      "NC": 547,
      "c3ccc4c(": 548,
      "c(NC(=O)": 549,
      "C(=O)C2": 550,
      "C1=N": 551,
      "co1": 552,
      "c1ccc(NC(=O)": 553,
      "2)C1": 554,
      "3C)": 555,
      "(C(F)(F)F)": 556,
      "CCC(=O)O)": 557,
      "c2-": 558,
      "C(NC(=O)": 559,
      "cc2)cc1": 560,
      "C2=O)cc1": 561,
      "c3ccn": 562,
      "n2)c1": 563,
      "c2nnc(": 564,
      "(Cl)": 565,
      "C2O": 566,
      "n2cn": 567,
      "N4": 568,
      "(O": 569,
      "C(=O)N(C)": 570,
      ")ccc2": 571,
      "c1C": 572,
      "C(F)(F)F": 573,
      "O=[N+]([O-])": 574,
      "c1c(C)": 575,
      "=C1": 576,
      "CCc1n": 577,
      "S(N)": 578,
      "c3ccc(C)": 579,
      "CCS(=O)(=O)": 580,
      "c1ccc(N2": 581,
      "c2c(-": 582,
      "C(=O)OC": 583,
      "CCCC(C)": 584,
      "c3cc4": 585,
      "N1CCN(": 586,
      "N(C": 587,
      "nn2": 588,
      "CCCn1": 589,
      "nc12": 590,
      "c(OC)c1": 591,
      "c2ccc(OC)": 592,
      "N(C)C)": 593,
      "c3c2": 594,
      "S(N)(=O)=O)": 595,
      "Cc1cc2": 596,
      "O)c(O)": 597,
      "c(=": 598,
      "[nH]1": 599,
      "CC(O": 600,
      "s2)": 601,
      "C2(C)": 602,
      ")ccc1O": 603,
      "c3ccc(O": 604,
      "NC(=O)C1": 605,
      "C(O)C1O": 606,
      "c1nc(N": 607,
      "CCC2(C)": 608,
      "C(=O)O)cc1": 609,
      "c2cs": 610,
      "Cc1ccccc1)": 611,
      ")cc(OC)c1OC": 612,
      "CCCCC2)": 613,
      "C(=O)N3": 614,
      "c2ccccc2c1": 615,
      "C3CC3)": 616,
      "Cc1ccc(Cl)cc1": 617,
      "c3ccc4c(c3)": 618,
      "CN1C(=O)": 619,
      "C(=N)N": 620,
      "c2ccccc2)c1": 621,
      "C1CC1": 622,
      "C1=O)": 623,
      "C=CC(=O)": 624,
      "c2ccc(Br": 625,
      "CCC)": 626,
      "CC(=O)N2": 627,
      "c1ccccc1-": 628,
      "c2ccccc12)": 629,
      "c(=O)n2": 630,
      "c3ccco": 631,
      "c1c(O)": 632,
      "Cc3ccccc3": 633,
      "C(C(=O)N": 634,
      "CCC12": 635,
      "s1)": 636,
      "no1": 637,
      "C=C(C)": 638,
      "=C(N)": 639,
      "C2CC2)": 640,
      "CCCNC(=O)": 641,
      "c1cccnc1": 642,
      "c2cc(C)": 643,
      "CCc1ccc(": 644,
      "CC(F)(F)": 645,
      "c(C(=O)O)": 646,
      ")ccc3": 647,
      "OCC1": 648,
      "c2c(=O)": 649,
      "ccc2": 650,
      "c1ccc(Br)cc1": 651,
      "C(=O)NC(C": 652,
      "C2O)": 653,
      "n2cc": 654,
      "Cc1ccc(O": 655,
      "c2=O)cc1": 656,
      "Cc3ccccc3)": 657,
      "c2)n1": 658,
      "o2)cc1": 659,
      ")N(": 660,
      "N2CCN(": 661,
      "c3ncn": 662,
      "c(S": 663,
      "c(F)c1": 664,
      "CCCCO": 665,
      "CCN3": 666,
      "CC(CC(": 667,
      "c1cc(Cl)cc": 668,
      "CCC3(C)": 669,
      "C2CCN(": 670,
      "CC(=": 671,
      "Cc1nc(": 672,
      "Cc1ccc(NC(=O)": 673,
      "c3ccc(O)": 674,
      "[n+]1": 675,
      "c4cn": 676,
      "CCc1ccccc1": 677,
      "c2ccc(N": 678,
      "c3cc(Cl)cc": 679,
      "CCOC(=O)C1": 680,
      "C(N": 681,
      "C2)c1": 682,
      "CC(C)(C)O": 683,
      "ccc1": 684,
      "cc(OC)": 685,
      "c(N3": 686,
      "CC5": 687,
      "Cc1ccc2c(c1)": 688,
      "c(-c2ccccc2)": 689,
      "c1ccncc1": 690,
      "c(Cl)c1": 691,
      "c3ccco3)": 692,
      "ncc2": 693,
      "C(OC(C)=O)": 694,
      "O=c1": 695,
      "OC3": 696,
      "CC(=O)N(": 697,
      "COC(=O)C1": 698,
      "COC1": 699,
      "O)cc1)": 700,
      "c1cccc(F)": 701,
      "C(F)(F)F)c1": 702,
      "c2cccc(F)": 703,
      "3)cc2": 704,
      "c1nc2ccccc2": 705,
      "Cc1ccc(F)cc1": 706,
      "c2ccco2)": 707,
      "C(=C": 708,
      "cc(O)": 709,
      "4CCCC": 710,
      "CC(N": 711,
      "COc1ccc(C2": 712,
      "Cn1c(=O)": 713,
      "=C2": 714,
      "n2)CC1": 715,
      "c1ncc": 716,
      "cs3)": 717,
      "c(Br)": 718,
      ")N1CCN(": 719,
      "c3cccc4": 720,
      "s2)cc1": 721,
      "CC(=N": 722,
      "OC)cc1": 723,
      "O=C(C=": 724,
      "S1": 725,
      "C(C)(": 726,
      "CCCCCCCCCCCC": 727,
      "OCO3)": 728,
      "Nc1nc(": 729,
      "CC2(": 730,
      "(CO)": 731,
      "C(=O)C1": 732,
      "C(=O)NC1": 733,
      "CC=C(C)": 734,
      "c2ccccc2-": 735,
      "(=O)=O": 736,
      "c2ccc3ccccc3": 737,
      "cccc3": 738,
      "C(C#N)": 739,
      "c4ccc(F)cc": 740,
      "[S+]": 741,
      "CC(C)=": 742,
      "COc1ccc2c(c1)": 743,
      "c3cccc(Cl)": 744,
      "-2": 745,
      "c5cc": 746,
      "Cn1cc(": 747,
      "s3)": 748,
      "c3ccccn3)": 749,
      "[N+](=O)[O-])c1": 750,
      "cn2)": 751,
      "NC1": 752,
      "CCN1C(=O)": 753,
      "c2cc3c(": 754,
      "CC1CN(": 755,
      "O=C1N": 756,
      "c1ccccn1": 757,
      "CCC(NC(=O)": 758,
      "CC(C)O": 759,
      "c1cccc(Cl)c1": 760,
      "c2cccs2)": 761,
      "c2ccc([N+](=O)[O-]": 762,
      "sc1": 763,
      "c2ccccn2)": 764,
      "OC)c(OC)c(OC)": 765,
      "Nc1ccc(": 766,
      "(C)C3": 767,
      "C(C)=O": 768,
      "c2cccnc2)": 769,
      "N2C(=O)": 770,
      "o2)": 771,
      "c2C)": 772,
      "c2ccc(N3": 773,
      "c2cccc(C(F)(F)F)": 774,
      "c2ccc(NC(=O)": 775,
      "c3ccc(Cl)cc3": 776,
      "CCC(=O)": 777,
      "c3nn": 778,
      "CCCC2)": 779,
      "c4n": 780,
      "CC#": 781,
      "c1ccc(Cl)cc1)": 782,
      "c2ccc(F)cc2": 783,
      "P(=O)(O)O": 784,
      "n4)": 785,
      "nc(S": 786,
      "C(CO)C(O)C(O)": 787,
      "c(C#N)": 788,
      "oc(": 789,
      "3)c1": 790,
      "COc1ccc(NC(=O)": 791,
      "P(=O)(O)O)": 792,
      "C2CCCCC2)": 793,
      "N=C": 794,
      "C(c2ccccc2)": 795,
      "CCCCC1)": 796,
      "c1ccccc1)c1ccccc1": 797,
      "CCCCN1": 798,
      "c2ccc(S(=O)(=O)N": 799,
      ")ccc21": 800,
      "CCC(O": 801,
      "O2": 802,
      "N(C(=O)": 803,
      "C23": 804,
      "I)": 805,
      "C(CO": 806,
      "c2ccc3": 807,
      "NC(=S)N": 808,
      "C(C)(C)C": 809,
      "c4[nH]": 810,
      "c3ccc(OC)": 811,
      "c4ccc(Cl)cc": 812,
      "C1CCC2": 813,
      "=CC(=O)": 814,
      "c(=O)n(": 815,
      "c1cccc2cccc": 816,
      "n1cn": 817,
      "c2ccccc2Cl)": 818,
      "c1cccs1": 819,
      "cn1)": 820,
      "c(=O)o": 821,
      "c3cccnc3)": 822,
      "c2ccccc2n1": 823,
      "C(N)=O": 824,
      "-c1ccccc1": 825,
      "cnc2": 826,
      "C=CC(=O)N": 827,
      "COc1cc(-": 828,
      "c2cccc(-": 829,
      "CN(C)C(=O)": 830,
      "c1cs": 831,
      "CCOCC3": 832,
      "c(C(=O)": 833,
      "c2cc(F)cc": 834,
      ")cc(-": 835,
      "N=C1": 836,
      "OCO2": 837,
      "nc21": 838,
      "COc1cc2c(cc1": 839,
      "C(=O)N(C": 840,
      "cn3)": 841,
      "C(=N)N)": 842,
      "c1ccc2[nH]": 843,
      "Cc1cc(-": 844,
      "c3ncc": 845,
      "c(=O)n(C)": 846,
      "c(=O)n1": 847,
      "c2ncc(": 848,
      ")cc2)CC1": 849,
      "CCC(N": 850,
      "C2)CC1": 851,
      "c2c(O)": 852,
      "nc(O)": 853,
      "c3cccs3)": 854,
      "c3c(C)": 855,
      "c3ccncc3)": 856,
      "Cn1cn": 857,
      "c2cccc(Cl)c2)": 858,
      "F)c(F)": 859,
      ")cc21": 860,
      "c2ccccc2F)": 861,
      "CCN(C)C)": 862,
      "c1ccc(-c2n": 863,
      "c1ccco1": 864,
      "COc1cc(OC)": 865,
      "C2=C(": 866,
      "C(=O)NCC": 867,
      "sc2c1": 868,
      "CCOCC4)": 869,
      "c1ccc([N+](=O)[O-])cc1": 870,
      "c3s": 871,
      "c2ccc(C(F)(F)F)cc": 872,
      "CC(C)(": 873,
      "(C)C": 874,
      "c(=O)[nH]c1=O": 875,
      "F)c(": 876,
      "C(Cc2ccccc2)": 877,
      "C(OC(=O)": 878,
      "oc(-": 879,
      "c2ncccc2": 880,
      "c2ccncc2)": 881,
      "C3(": 882,
      "4)CC3)": 883,
      "C2CC3": 884,
      "O2)": 885,
      "C=O)": 886,
      "CC1=": 887,
      "c2nnn": 888,
      "CCOCC2)cc1": 889,
      "ncnc3": 890,
      "cs1)": 891,
      "(C)c1": 892,
      "C(=S)": 893,
      "C(C(=O)O)": 894,
      "CCC(N)": 895,
      "c2ccc3c(c2)OCO3)": 896,
      "c2c(Cl)cc": 897,
      "CCCC3": 898,
      "c4ccccc34)": 899,
      "(=O)o": 900,
      "c3cccnc3": 901,
      "CCCC1)": 902,
      "N2CCOCC2)": 903,
      "c2nc(C)": 904,
      "CCCN(C(=O)": 905,
      "c3ccccc32)": 906,
      "C3CCCCC3)": 907,
      "c3ccc(Br": 908,
      "c2ccccc2)n1": 909,
      "c(O)c1": 910,
      "c3ccc(F)cc3": 911,
      "n2c(": 912,
      "S(=O)(=O)N1": 913,
      "c2c(F)cc": 914,
      ")cc2)c1": 915,
      "(C#N)": 916,
      "c1ncn2": 917,
      "C2=": 918,
      "F)cc2": 919,
      "c1nnc(": 920,
      "C=NNC(=O)": 921,
      "CC1=C(": 922,
      "ncc(": 923,
      "c2cccc3cccc": 924,
      "C(=O)Nc1ccc(": 925,
      "c1ccccc1)N": 926,
      "c3=O)": 927,
      "CC2)CC1": 928,
      "CCCCN": 929,
      "c1cc(C)": 930,
      "CCN1CCN(": 931,
      "O=C(NC1": 932,
      "CC(=O)OC1": 933,
      "c2cc(O": 934,
      "Cc1cccc(-": 935,
      "CCOCC1)": 936,
      "Cc1ccc(C(=O)N": 937,
      "S)N": 938,
      "[N+](C)": 939,
      "Cl)cc2": 940,
      "Cc1ccc(S(=O)(=O)N": 941,
      "c3cc(C)": 942,
      "CCC=": 943,
      "CCCCCCCCCCCCCCCC": 944,
      "n2-": 945,
      "c3ccccc23)cc1": 946,
      "Br)cc": 947,
      "c1=O)": 948,
      "c1c(-": 949,
      "NC(=O)O": 950,
      "S(=O)(=O)c1ccc(": 951,
      "Cl)c(Cl)c1": 952,
      "c2nnc(-": 953,
      "c3nc4ccccc4": 954,
      "c2c3c(": 955,
      "c2cc3cccc": 956,
      "c2nc3c(": 957,
      "c1cccc(F)c1": 958,
      ")cc12": 959,
      "c2cc1OC": 960,
      "C=Cc2ccc(": 961,
      "c1ccc(F)cc1)": 962,
      "c2c1)": 963,
      "COc1cccc(-": 964,
      "O=c1[nH]": 965,
      "c3cc(-": 966,
      "C2C1": 967,
      "C(=O)N1CCN(": 968,
      "C21": 969,
      "CCC3(": 970,
      "OC4": 971,
      "C(=O)c1ccccc1": 972,
      "CCC3)": 973,
      "c2ccc(C(=O)N": 974,
      "c1cccn": 975,
      "NC(=O)CS": 976,
      "CC5)": 977,
      "c1cccc2c1": 978,
      "co1)": 979,
      "n2cc(": 980,
      "c3ccccc32)cc1": 981,
      "C(F)F)": 982,
      "C#N)cc1": 983,
      "C3O": 984,
      "6)": 985,
      "OCO4)": 986,
      "Cc1ccc(N": 987,
      "[n+]2": 988,
      "nc2n1": 989,
      "c3ccc(C(F)(F)F)cc": 990,
      "c2ccc(-c3ccccc3": 991,
      "c(-c3ccccc3)": 992,
      "ccn": 993,
      "C(=O)NC(Cc1ccccc1)": 994,
      "O)c1": 995,
      "c5ccccc5)": 996,
      "CC(=O)Nc1ccc(": 997,
      "O)c(": 998,
      "c4ccccc43)": 999,
      "CNS(=O)(=O)": 1000,
      "-c1ccc(": 1001,
      "c1cn(": 1002,
      "c3cccc(F)": 1003,
      "c2)C1": 1004,
      "c1cc2cccc": 1005,
      "C(=O)NC(C)": 1006,
      "CC1OC(": 1007,
      "COc1ccc(OC)": 1008,
      "n12": 1009,
      "CCCN3": 1010,
      "c2[nH]1": 1011,
      "CCOCCO": 1012,
      "N1C(=O)": 1013,
      "O=C(Nc1ccc(": 1014,
      "3)CC1": 1015,
      "c5c(": 1016,
      "c2cc(NC(=O)": 1017,
      "c2cc(S(=O)(=O)N": 1018,
      "c2cc3c(cc2": 1019,
      "NC(=O)C2": 1020,
      "c3ccc(C)cc3)": 1021,
      "c(C(F)(F)F)": 1022,
      "CC(C(=O)N": 1023,
      "C3O)": 1024,
      "CCC(=O)O": 1025,
      "CN)": 1026,
      "[nH]c(=O)": 1027,
      "c5ccc(": 1028,
      "cc21": 1029,
      "4)cc3)": 1030,
      "c4c3": 1031,
      "c2ccc(O)cc2)": 1032,
      "P(=O)(O": 1033,
      "CCCN(C": 1034,
      "CCOc1ccccc1": 1035,
      "CCC2(CC1)": 1036,
      "FC(F)(F)": 1037,
      "C(=O)N1CCCC1": 1038,
      "CCl": 1039,
      "COc1ccc2c(": 1040,
      "COc1ccc(C(=O)N": 1041,
      "c1ncc(": 1042,
      "CN1CCC(": 1043,
      "OCc1ccccc1)": 1044,
      "c(=S)": 1045,
      "nn3": 1046,
      "S)=N": 1047,
      "N=C(N)N": 1048,
      "CCc2ccccc2)": 1049,
      "oc2c1": 1050,
      "o3)": 1051,
      "ncc3": 1052,
      "Cn3": 1053,
      "CCOc1cc(": 1054,
      "C(=O)N1CCC(": 1055,
      "COc1ccc(N": 1056,
      "c2ccc(Cl)cc2Cl)": 1057,
      "CCc1cc(": 1058,
      "C(O)(": 1059,
      "c3cc4c(": 1060,
      "CC(=O)NC(": 1061,
      "Cn1c(": 1062,
      "c1c[nH]c2ccccc12)": 1063,
      "c2ccc(Cl)c(Cl)": 1064,
      "c2cc(Cl)ccc2": 1065,
      "CC=C(": 1066,
      "Oc1ccc(": 1067,
      "Cc1ccc(C)": 1068,
      "c3cccc(Cl)c3)": 1069,
      "c2ccc(C)cc2)": 1070,
      "n2C)": 1071,
      "CCc2c(": 1072,
      "on1": 1073,
      "c2ccc(Br)cc2)": 1074,
      "Nc1ncn": 1075,
      "C(F)(F)F)cc(C(F)(F)F)": 1076,
      "CCc1ccccc1)": 1077,
      "CS(=O)(=O)N": 1078,
      "CCC43C)": 1079,
      "CN2C(=O)": 1080,
      "CC1O": 1081,
      "cc4)": 1082,
      "C(C)C)cc1": 1083,
      "c1ncn": 1084,
      "n2cnc3c(": 1085,
      "c5)": 1086,
      "ccnc1": 1087,
      "CC(F)(F)F)": 1088,
      "CCCC3)": 1089,
      "nc(N3": 1090,
      "Cc2cc(": 1091,
      "CC(N)=O)": 1092,
      "c1nc2c(": 1093,
      "Nc1ccccc1": 1094,
      "Cc1no": 1095,
      "c4cccn": 1096,
      "c2F)": 1097,
      "c2C1": 1098,
      "CCCC)": 1099,
      "P(=O)(": 1100,
      "c3ccccc3)CC2)": 1101,
      "c3c2)": 1102,
      "C(=O)OC(C)(C)C)": 1103,
      "CCCCC3)": 1104,
      "n2nc(": 1105,
      "nc2-": 1106,
      "nc2c(": 1107,
      "C3(C)": 1108,
      "Cc1cs": 1109,
      "C#C": 1110,
      "c3C)": 1111,
      "CCCCC2": 1112,
      "C1CCC(": 1113,
      "OCc1ccccc1": 1114,
      "cc12": 1115,
      "cn3": 1116,
      "c4cccc(": 1117,
      "CCn1c(": 1118,
      "CN2CCN(": 1119,
      "CCn1cc(": 1120,
      "C(Cl)": 1121,
      "c1cccc(O": 1122,
      "CC(C)N": 1123,
      "2)n1": 1124,
      "COc1cc2c(cc1OC)": 1125,
      "c3c[nH]": 1126,
      "c2ccc(Cl)cc2)cc1": 1127,
      "c3cc(O)": 1128,
      ")cc1)": 1129,
      "c2cc(C(=O)N": 1130,
      "Cc1ccc(O)cc1)": 1131,
      "c(-c3ccc(": 1132,
      "=C(N": 1133,
      ")cc4)": 1134,
      "C5(C)": 1135,
      "c3ccc4ccccc4": 1136,
      "c1ccc(C(=O)N": 1137,
      "c2cc(N": 1138,
      "Cc1nc(-": 1139,
      "CCC4(C)C3": 1140,
      "c1ccc(O)cc1": 1141,
      "c34": 1142,
      "c2nc(N)": 1143,
      "c1c(Cl)cc": 1144,
      "C5)": 1145,
      "Cc1cccc": 1146,
      "CCC(C)(C)": 1147,
      "c3nc(-": 1148,
      "CCCN1C(=O)": 1149,
      "c1cc2c(": 1150,
      "c2cn(": 1151,
      "CCC1(": 1152,
      "c2c[nH]c3ccccc23)": 1153,
      "c3o": 1154,
      "CC2)n1": 1155,
      "ccc1O": 1156,
      "CCCCn1": 1157,
      "O=C(CSc1n": 1158,
      "ccc4": 1159,
      "CC(C)(O)": 1160,
      "C(=O)OCC)": 1161,
      "CCCCC2)cc1": 1162,
      "c1N": 1163,
      "C=CC1": 1164,
      "CC21": 1165,
      "O=S(=O)(N": 1166,
      "CC2)C1": 1167,
      "C(C)(O)": 1168,
      "OC(C)(C)": 1169,
      ")cc4": 1170,
      "NC(=O)c1ccccc1": 1171,
      "C=CC(": 1172,
      "3)cc2)": 1173,
      "COc1ccc(Cl)cc1": 1174,
      "Cc1cc(N": 1175,
      "C(C)=": 1176,
      "c2ccc(Cl)": 1177,
      "N=C2": 1178,
      "c2ccc(C(=O)O)": 1179,
      "c2ccc(OC)cc2)": 1180,
      "CCCS": 1181,
      "c2ccncc": 1182,
      "c3cc(F)cc": 1183,
      "c3ccccc3Cl)": 1184,
      "c2cccc3ccccc23)": 1185,
      "COc1ccc(C(=O)": 1186,
      "nc4": 1187,
      "C(N)=N": 1188,
      "nn(-": 1189,
      "c1cccc(NC(=O)": 1190,
      "c4ccc(F)cc4)": 1191,
      "Cc1c[nH]": 1192,
      "C(=O)N2CCN(": 1193,
      "Cc1cn(": 1194,
      "nc2ccccc12": 1195,
      "CCOCC4": 1196,
      "c3ccc([N+](=O)[O-]": 1197,
      "c3c(F)cc": 1198,
      "c1cc(F)cc": 1199,
      "NC(=O)C(C": 1200,
      "nc1-": 1201,
      "F)cccc1": 1202,
      ")c1ccccc1": 1203,
      "c(=O)n3": 1204,
      "c-2": 1205,
      "C4CCCC": 1206,
      "CCc3ccccc3": 1207,
      "[nH]2)": 1208,
      "c2c(c1": 1209,
      "n3cn": 1210,
      "[n+](": 1211,
      "C(F)(F)F)c3)": 1212,
      "C(CO)C(O)": 1213,
      "Cc1o": 1214,
      "NC(=O)c1ccc(": 1215,
      "CCC(=O)N1": 1216,
      "c1nnc(-": 1217,
      "c2cc(F)": 1218,
      "c1cc2c(cc1": 1219,
      "3CCCC3)": 1220,
      "Cc1c(-": 1221,
      "c3ccc(N4": 1222,
      "C(C)CO)": 1223,
      "o1)": 1224,
      "CC(OC(=O)": 1225,
      "CC(CO)": 1226,
      "c3cc2": 1227,
      "c2ccs": 1228,
      "cc2)c1": 1229,
      "C3CCC4": 1230,
      "c3)cc2": 1231,
      "c2ccc3n": 1232,
      "c2cccc(O": 1233,
      "c(N2": 1234,
      "c1ccc2ccccc2c1": 1235,
      "4CCOCC4)": 1236,
      "CCCCN)": 1237,
      "c2n[nH]": 1238,
      "c3ccc(O)cc3)": 1239,
      "COC(": 1240,
      "n1cc(": 1241,
      "c3ccccc3F)": 1242,
      "c1cccc2ccccc12": 1243,
      "OCC2": 1244,
      "C1CCCC1": 1245,
      "c3ccc(N": 1246,
      "c2c1=O": 1247,
      "c(S(=O)(=O)N": 1248,
      "3CCCCC3)": 1249,
      "CN=C(O)": 1250,
      "c3ccc4c(c3)OCO4)": 1251,
      "C1CCCCC1)": 1252,
      "CCCCNC(=O)": 1253,
      "[N-]": 1254,
      "C1=C(": 1255,
      "c1cccc(N": 1256,
      "CCc2ccccc2": 1257,
      "Cc2c(": 1258,
      "COc1ccc(S(=O)(=O)N": 1259,
      "N1CCC(": 1260,
      "c2ccc3[nH]": 1261,
      "c1nc(C)": 1262,
      "nc2)": 1263,
      "SC)": 1264,
      "C1CC2": 1265,
      "C(C)(C)C)cc1": 1266,
      "n1-c1ccccc1": 1267,
      "CCCC(=O)N": 1268,
      "Cc1ccco1": 1269,
      "COC(=O)c1ccc(": 1270,
      "C2C3": 1271,
      "C3CCCC3)": 1272,
      "C(=O)C=": 1273,
      "CN2CCC(": 1274,
      "CN(C)C)": 1275,
      "Cc1cc(C)cc(": 1276,
      "c2cccc(C(F)(F)F)c2)": 1277,
      "C=NN": 1278,
      "nc2ccccc21": 1279,
      "c2cccc([N+](=O)[O-])": 1280,
      "C2CCC1": 1281,
      "C(=Cc2ccc(": 1282,
      "Cc1[nH]": 1283,
      "C1)C2": 1284,
      "OCC(=O)N": 1285,
      "C3)cc1": 1286,
      "nn2)": 1287,
      "CCCl)": 1288,
      "c2ccccc2)cc1)": 1289,
      "C5CCC43C)": 1290,
      "OCc2ccccc2)": 1291,
      "c3ccc(OC)cc3)": 1292,
      "S(=O)(=O)c1ccccc1": 1293,
      "CCCCN(": 1294,
      "c1cccc(C(F)(F)F)c1": 1295,
      "c4ccc(O)": 1296,
      "Cc1ccccc1)N": 1297,
      "c3nc(": 1298,
      "CC3CC(CC(": 1299,
      "C(=NO)": 1300,
      "S2": 1301,
      "cn2)cc1": 1302,
      "c2Cl)": 1303,
      "c13)": 1304,
      "CNC(=O)N": 1305,
      "SC": 1306,
      "c2cccc(C)": 1307,
      "c1cc(N": 1308,
      "CC(C)CC(NC(=O)": 1309,
      "c1ccccn1)": 1310,
      "c2cc(=O)": 1311,
      "S(C)(=O)=O": 1312,
      "c([N+](=O)[O-])": 1313,
      "COc1c(": 1314,
      "C2)C1": 1315,
      "c2cccc(F)c2)": 1316,
      "[S+]([O-])": 1317,
      "[n+]([O-])": 1318,
      "N#Cc1ccc(": 1319,
      "c2C)cc1": 1320,
      "c2nc(N3": 1321,
      "C1O)": 1322,
      "c1ccc(-n2": 1323,
      ")N1CCC(": 1324,
      "c2ccc(Cl)cc2)CC1": 1325,
      "n1C": 1326,
      "c1ccccc1O": 1327,
      "nc(NC(=O)": 1328,
      "c2cccc(O)": 1329,
      "c2c(F)cccc2": 1330,
      "C4CC4)": 1331,
      "OCO4": 1332,
      "c1cccnc1)": 1333,
      "c3cc4c(cc3": 1334,
      "n(-c2ccccc2)": 1335,
      "C3=N": 1336,
      "CCN(S(=O)(=O)": 1337,
      "CC3CC(CC(C3)": 1338,
      "C2CCCC2)": 1339,
      "c(=O)c(C(=O)O)": 1340,
      "COCCO": 1341,
      "O3)": 1342,
      "C(CCC4": 1343,
      "c1c2c(": 1344,
      "O=C(NN=": 1345,
      "NC1=O": 1346,
      "CCC12C": 1347,
      "c2cc(OC)": 1348,
      "CCC5": 1349,
      "c4ccc(Cl)cc4)": 1350,
      "c2nc(-c3ccccc3)": 1351,
      "c(=O)[nH]1": 1352,
      "c3cc(Cl)ccc3": 1353,
      "CCCC(C)=": 1354,
      "Cc1cccc2": 1355,
      "c1cc(O)": 1356,
      "C(=O)c2ccccc2": 1357,
      "Br)c1": 1358,
      "CCc3ccccc3)": 1359,
      "cc2c1": 1360,
      "C2=O)c1": 1361,
      "C(=O)NC2": 1362,
      "ncnc32)": 1363,
      "COc1cccc2": 1364,
      "CC(C)CC(": 1365,
      "Cc2ccc(F)cc": 1366,
      "(c2ccccc2)": 1367,
      "c2c(N)": 1368,
      "C)c1": 1369,
      "CCCO)": 1370,
      "c2ccc(C#N": 1371,
      "ncn1": 1372,
      "OCC1OC(": 1373,
      "c3cccc(F)c3)": 1374,
      "oc(=O)": 1375,
      "[Si": 1376,
      "CC1(O)": 1377,
      "c2cc(OC)c(OC)c(OC)": 1378,
      "c1ncccc1": 1379,
      "c2ccccc2c1=O": 1380,
      "ccn1": 1381,
      "c1ccc(C(F)(F)F)cc1": 1382,
      "O=C(O": 1383,
      "Cn1cc(-": 1384,
      "sc3": 1385,
      "3CCCCC3": 1386,
      "nn2)cc1": 1387,
      "N(C)C(=O)": 1388,
      "Br)cc(": 1389,
      "[Si]": 1390,
      "c(C": 1391,
      "cnc3": 1392,
      "C(C)N": 1393,
      "[nH]c2c1": 1394,
      "c3ccc(Br)cc3)": 1395,
      "c2cccnc2": 1396,
      "nn12": 1397,
      "CC1=N": 1398,
      "c1ccc(-c2cn": 1399,
      "Cc1ccc(S(=O)(=O)N2": 1400,
      "c1ccccc12": 1401,
      "4)cc3": 1402,
      "Cc1ccccc1-": 1403,
      "c3ccccc3)cc2": 1404,
      "c4ccco": 1405,
      "c3c(Cl)cc": 1406,
      "c4ccncc": 1407,
      "COC(=O)N": 1408,
      "COc1ccccc1-": 1409,
      "C3=": 1410,
      "C(=O)N2CCC(": 1411,
      "CC4CC(CC(": 1412,
      "CC(C(=O)O)": 1413,
      "O=C(COC(=O)": 1414,
      ")N2": 1415,
      "C2CCC(": 1416,
      "n(-c3ccccc3)": 1417,
      "c4ccccc4)CC3)": 1418,
      "c4ccccc4)cc3)": 1419,
      "c2ccc([N+](=O)[O-])cc2)": 1420,
      "C6": 1421,
      "c2no": 1422,
      "C(Cc1ccccc1)NC(=O)": 1423,
      "c1ccccc1Cl": 1424,
      "CCC2)": 1425,
      "CN4": 1426,
      ")ccc1-": 1427,
      "cnc2c1ncn2": 1428,
      "[nH]2)cc1": 1429,
      "N2CCC(": 1430,
      "N)cc1": 1431,
      "CC2)ccc1": 1432,
      "S(=O)(=O)O)": 1433,
      "CC2=O)": 1434,
      "C(CC(C)C)": 1435,
      "c3ccc(Cl)c(Cl)": 1436,
      "o2)c1": 1437,
      "N=C(C)": 1438,
      "CCC=C(C)": 1439,
      "c1cc(Cl)ccc1": 1440,
      "c2ccc3ccccc3c2)": 1441,
      "c2ccccc2)C1": 1442,
      "COc1cc(C2": 1443,
      "C(S)=N": 1444,
      "CCn2": 1445,
      "NC(=O)CO": 1446,
      "CN(C)c1ccc(": 1447,
      "C2C": 1448,
      "[nH]1)": 1449,
      "N1CCOCC1": 1450,
      "c3ccc(C(F)(F)F)cc3)": 1451,
      "CCNCC3)": 1452,
      "c2ccc(OC": 1453,
      "CC3)cc2": 1454,
      "CC(O)(": 1455,
      "cn2)CC1": 1456,
      "ccc12": 1457,
      "CC1CCCO": 1458,
      "c1cc2cc(": 1459,
      "C1(C)C": 1460,
      "n2c1": 1461,
      "O=C1c2ccccc2": 1462,
      "nn3)": 1463,
      "C(C(=O)": 1464,
      "c3ccc(C(=O)N": 1465,
      "O=C(CN1": 1466,
      "N=C(N": 1467,
      "[nH]c(": 1468,
      "n2C": 1469,
      "c3ccccc3)cc2)": 1470,
      "c1nc(-c2ccccc2)": 1471,
      "Clc1ccc(": 1472,
      "C(=O)O1": 1473,
      "(CC)": 1474,
      "C(C)O": 1475,
      "c-": 1476,
      "OC)c1": 1477,
      "c45)": 1478,
      "c2cc(N3": 1479,
      "cc1)": 1480,
      "CC4CC(CC(C4)": 1481,
      "CCCCCC": 1482,
      "COc1cc(N": 1483,
      "c1ccc2c(c1)OCO2": 1484,
      "nnc1-": 1485,
      "c2ccc(F)cc2)CC1": 1486,
      "c1ccc(C)cc1": 1487,
      "nnc1": 1488,
      "c2ccc(F)cc2)cc1": 1489,
      "c6cccc": 1490,
      "Cc1cccnc1": 1491,
      "c2cc(O)": 1492,
      "Cc1s": 1493,
      "CC=C(C)C)": 1494,
      "[nH]3)": 1495,
      "CC2CC2)": 1496,
      "ccc(-": 1497,
      "3)cc2)cc1": 1498,
      "CCCC2)cc1": 1499,
      "Cl)c1)": 1500,
      "(CC(=O)N": 1501,
      "C1CO": 1502,
      "C(=O)OCC(=O)N": 1503,
      "F)c(Cl)": 1504,
      "ncn2": 1505,
      "=S)": 1506,
      "C2(O)": 1507,
      "c2=O)c1": 1508,
      "CCNS(=O)(=O)": 1509,
      "c1ccc2c(c1": 1510,
      "c2cc1O": 1511,
      ")ccn1": 1512,
      "NC(=O)C(CC(C)C)": 1513,
      "c2c(Cl)cccc2": 1514,
      "c1o": 1515,
      "s2)c1": 1516,
      "c3)cc": 1517,
      "C1C": 1518,
      "c1nc(N)": 1519,
      "C(C)(C)C5CCC43C)": 1520,
      "c1ccc(OC)cc1": 1521,
      "COc1ccc(-c2n": 1522,
      "CNC": 1523,
      "c3cccc4cccc": 1524,
      "CCNCC1": 1525,
      "C=C3": 1526,
      "C(c1ccccc1)": 1527,
      "C(=O)N(C)C)": 1528,
      "C2)n1": 1529,
      "c3c(-": 1530,
      "CC1CCCCC1)": 1531,
      "nc1N": 1532,
      "CC4CC(CC(C4)C2)": 1533,
      "Cc1ccc(Cl)cc1)": 1534,
      "c4ncc": 1535,
      "CCCCCC1": 1536,
      "CC(O)C(O)": 1537,
      "c2cncc": 1538,
      "c2co": 1539,
      "N2CCN(C(=O)": 1540,
      "O=C(O)C1": 1541,
      "C=C2S": 1542,
      "c2cnn3": 1543,
      "cccc4": 1544,
      "c43)": 1545,
      "c1ccco1)": 1546,
      "C(=O)NS(=O)(=O)": 1547,
      "c1ccc(S(=O)(=O)N": 1548,
      "c1ccccc1Cl)": 1549,
      "cc(N": 1550,
      "c1ccc2c(c1)OCCO": 1551,
      "CCl)": 1552,
      "CCCCCCN": 1553,
      "c3cccc(C)": 1554,
      "cc2c(": 1555,
      "CCCN(CCC)": 1556,
      "C(=O)C(C)": 1557,
      "CCn1c(=O)": 1558,
      "CCCNC(=N)N)": 1559,
      "(Cc2ccccc2)": 1560,
      "CC(C)C(": 1561,
      "c3ccc(NC(=O)": 1562,
      "Cc1nn(C)": 1563,
      "c1cccc2ccccc12)": 1564,
      "c1ccccc1)N1": 1565,
      "CCN2C(=O)": 1566,
      "c4ccccn4)": 1567,
      "=C(N)N)": 1568,
      "c2n(": 1569,
      "c3cccc(C(F)(F)F)c3)": 1570,
      "NC(=O)C(N)": 1571,
      "CC(O)CO": 1572,
      "c3ncccc3": 1573,
      "c1cc(-c2ccccc2)": 1574,
      "N=C(S)N": 1575,
      "COc1ccc(O": 1576,
      "c2cccc(OC)": 1577,
      "cc(Cl)": 1578,
      "c(=O)c2c1": 1579,
      "Cc1nc(N": 1580,
      "CC3(": 1581,
      "Cc1ccc(-n2": 1582,
      "c2O)": 1583,
      "c(NC": 1584,
      "Cc2ccc(-": 1585,
      "C2CC(": 1586,
      "C(O)C(O)C1O": 1587,
      "c23)CC1": 1588,
      "c(=N)": 1589,
      "c3ccncc3": 1590,
      "c3ccccc3)cc": 1591,
      "CCC21": 1592,
      "c1ccc(F)": 1593,
      "CCCN(C)": 1594,
      "Cc1ccc(F)cc1)": 1595,
      "Cc1c(C)": 1596,
      "c2ccnc(N": 1597,
      "OC(CO": 1598,
      "n5": 1599,
      "CCCN(C)C)": 1600,
      "c1ccc2o": 1601,
      "CCN)": 1602,
      "CC2CCCO": 1603,
      "C1CC": 1604,
      "C4=O)": 1605,
      "O=C(CS": 1606,
      "CC1CCC(": 1607,
      "c1cc(Cl)": 1608,
      "Cc1ccncc1": 1609,
      "c4ccc5c(": 1610,
      "c23)c1": 1611,
      "c4ccc(C)": 1612,
      "c2ccc(Cl)c(Cl)c2)": 1613,
      "nc3ccccc3": 1614,
      "C(=O)OCC": 1615,
      "nc3)": 1616,
      "c4cc(Cl)cc": 1617,
      "CCN(C)CC3)": 1618,
      "c2ccc(C(F)(F)F)cc2)": 1619,
      "Cc1ccc([N+](=O)[O-])cc1": 1620,
      "Cn1cc": 1621,
      "Cc1ccc(S(=O)(=O)": 1622,
      "c(=O)n(-": 1623,
      "CN(C)S(=O)(=O)": 1624,
      "c([N+](=O)[O-])c1": 1625,
      "CCC(CC)": 1626,
      "CCN(CC)C(=O)": 1627,
      "c4c3)": 1628,
      "c1ccc(Cl)": 1629,
      "CCC(C(=O)N": 1630,
      "(C4": 1631,
      "c4ccc(-": 1632,
      "OCO2)": 1633,
      "c2s1": 1634,
      "c1ccc(F)cc1F": 1635,
      "c2ccc3c(c2)OCCO": 1636,
      "N1CCN(C(=O)": 1637,
      "nn(C)": 1638,
      "c1cncc(": 1639,
      "c2nn[nH]": 1640,
      "c3cco": 1641,
      "c1cccs1)": 1642,
      "C34": 1643,
      "c1c(F)cccc1": 1644,
      "ncnc(N": 1645,
      "C(=O)O)c1": 1646,
      "5CCCC": 1647,
      "CC1CCN(": 1648,
      "COc1ccc2[nH]": 1649,
      "OO": 1650,
      "c3c(F)cccc3": 1651,
      "N(CC(=O)N": 1652,
      "c2ccccc21)": 1653,
      "c4ccc(N": 1654,
      "COc1ccc(CNC(=O)": 1655,
      "CC2(C)": 1656,
      "c3ccc(Cl)c(Cl)c3)": 1657,
      "c3ccc(C#N": 1658,
      "c4ccc(OC)": 1659,
      "c2c(N": 1660,
      "c(-c2ccc(": 1661,
      "CN1C(=O)C(": 1662,
      "c1cc(=O)": 1663,
      "C(=O)NC(CC(C)C)": 1664,
      "CO1": 1665,
      "c(F)c2)": 1666,
      "Cc1ccc(O)cc1": 1667,
      "C12CC3CC(CC(C3)": 1668,
      "C1(O)": 1669,
      "ccc2c1": 1670,
      "CN=C(": 1671,
      "c(O)c(": 1672,
      "C1OC(": 1673,
      "CCOC(=O)N1": 1674,
      "CC(C)C(NC(=O)": 1675,
      "n(CC(=O)N": 1676,
      "=C(C#N)": 1677,
      "C(c3ccccc3)": 1678,
      "c2cccnc2)cc1": 1679,
      "C3CCN(": 1680,
      "c3cc(OC)": 1681,
      "c1ccc(OC": 1682,
      "[Si](C)": 1683,
      "Cc1cc(Cl)cc": 1684,
      "c1c(N": 1685,
      "c1ccc(Cl)c(Cl)c1": 1686,
      "CC1CC1)": 1687,
      "CC(O)(C": 1688,
      "Cc1c(C(=O)N": 1689,
      "c(=O)[nH]c2=O)": 1690,
      "Oc1ccccc1": 1691,
      "c3F)": 1692,
      "CCC1C2": 1693,
      "C3(O)": 1694,
      "C(C)O)": 1695,
      "c2ccc(Cl)cc2)c1": 1696,
      "CC(c2ccccc2)": 1697,
      "C(=O)NC(CC(=O)O)": 1698,
      "nc3c(": 1699,
      "CCCCC(": 1700,
      "c[nH]1": 1701,
      "C4(C)": 1702,
      "NC(=O)OC(C)(C)C)": 1703,
      "Cc2cn": 1704,
      "OC(C)": 1705,
      "CCNC(=O)N": 1706,
      "O=C(C1": 1707,
      "NC(=O)C(C)": 1708,
      "c3cc4cccc": 1709,
      "CC(OC(C)=O)": 1710,
      "c1ccccc1F": 1711,
      "Fc1ccc(": 1712,
      "CC(=O)NC1": 1713,
      "NCC": 1714,
      "nc1C": 1715,
      "c4cccc(Cl)": 1716,
      "c23": 1717,
      "c3ccc(O)cc3": 1718,
      "C(C)C)c1": 1719,
      "c2ccc(O)cc2": 1720,
      "[N+]=": 1721,
      "CO2": 1722,
      "c(=O)n2C": 1723,
      "[N+](C)(C)": 1724,
      "CCC(O)(": 1725,
      "c1cccc([N+](=O)[O-])c1": 1726,
      "c2cc(C(F)(F)F)cc": 1727,
      "c(=O)n(C": 1728,
      "C(=O)NO)": 1729,
      "C(F)(F)F)cc2": 1730,
      "CC3)cc": 1731,
      "c5cc(": 1732,
      "C(C)=O)cc1": 1733,
      "C(OC)": 1734,
      "c3cs": 1735,
      "OCC(": 1736,
      "SC1=": 1737,
      "c2cccc(Br)": 1738,
      "OCCCC": 1739,
      "CCOC)": 1740,
      "OC(CO)C(O)C(O)": 1741,
      "n3C)": 1742,
      "[N+]=[N-]": 1743,
      "c4ccco4)": 1744,
      "nc2)cc1": 1745,
      "c1ccc(Cl)cc1Cl": 1746,
      "Cc2ccccc2)cc1": 1747,
      "C=C(C)C1": 1748,
      "5CCO": 1749,
      "c1cn(-": 1750,
      "CC1CCCCC1": 1751,
      "ccc21": 1752,
      "CC(=O)N(C)": 1753,
      "c2ncn(": 1754,
      "Cc1cccc(C)c1": 1755,
      ")N1CCOCC1": 1756,
      "OCO3": 1757,
      "c1ncc(-": 1758,
      "c3ccc(Cl)": 1759,
      "cc1Cl": 1760,
      "n3cc": 1761,
      "c3cccc(-": 1762,
      "COc1ccccc1N1CCN(": 1763,
      "c(Cl)cc1": 1764,
      "CC3)cc1": 1765,
      "COc1ccc(-n2": 1766,
      "c2ccco2)cc1": 1767,
      "C3CCCCC3": 1768,
      "C(F)(F)F)c1)": 1769,
      "c3cc(OC)c(OC)c(OC)": 1770,
      "c4cc5": 1771,
      "c(=N": 1772,
      "Cc1cccs1": 1773,
      "C(F)(F)F)cc1)": 1774,
      "C2CO": 1775,
      "c2cc(Cl)": 1776,
      "c3ccc(C)cc3": 1777,
      "C(CC(=O)O)": 1778,
      "CCCC4)": 1779,
      "c1c(N)": 1780,
      "cc5": 1781,
      "CC23": 1782,
      "COc1ccc(CN": 1783,
      "COc1ccc(S(=O)(=O)N2": 1784,
      "C=CC=": 1785,
      "C[n+]1": 1786,
      ")cc2)n1": 1787,
      "Cl)cc3": 1788,
      "CCN1CCC(": 1789,
      "c1ccc(-c2ccc(": 1790,
      "c1cc(O": 1791,
      "c2ccc(C)cc2)cc1": 1792,
      "cc(C(=O)N": 1793,
      "e]": 1794,
      "C(C)(C)O)": 1795,
      "c1nn(-": 1796,
      "c2ccncc2": 1797,
      "CCOC(=O)C1=C(C)": 1798,
      "CC4)cc3)": 1799,
      "c2cc(O)cc": 1800,
      "Cn2cn": 1801,
      "NC(=N": 1802,
      "c3ccc([N+](=O)[O-])cc3)": 1803,
      "CC3CC3)": 1804,
      "C=CC(=O)O": 1805,
      "c2cc(Cl)cc(Cl)": 1806,
      "Cc1noc(C)c1": 1807,
      "C(=O)C3": 1808,
      "c2cccs2)cc1": 1809,
      "c2nc(O)": 1810,
      "CCCC4": 1811,
      "CC#N)": 1812,
      "C(=O)Nc1ccccc1": 1813,
      "CC(O)CN": 1814,
      "C(=N)O)": 1815,
      "OCc3ccccc3)": 1816,
      "c2cccc(NC(=O)": 1817,
      "ncnc21": 1818,
      "C(=S)NC(=O)": 1819,
      "c1cccc(Cl)c1)": 1820,
      "cnn2": 1821,
      "CC1CC1": 1822,
      "c3c(O)": 1823,
      "C2CC(O)": 1824,
      "c1cn2": 1825,
      "C23CC4CC(CC(C4)C2)": 1826,
      "nc(SCC(=O)N": 1827,
      "C(C)=N": 1828,
      "COC(=O)C(": 1829,
      "c1-c1ccccc1": 1830,
      "[N+](=O)[O-])cc": 1831,
      "3CCCC3": 1832,
      "cccn3)": 1833,
      "c1nnn": 1834,
      "cc3c(": 1835,
      "c3ccc4": 1836,
      "c3ccccc3)CC2)cc1": 1837,
      "nnc(-": 1838,
      "CCCC2(C)": 1839,
      "cc(-c3ccccc3)": 1840,
      "CCNCC2)": 1841,
      "O=C(CCCC": 1842,
      "CC1CCC2": 1843,
      "CC(=O)NC(C)": 1844,
      "C1CCC1": 1845,
      "Cn1nc(": 1846,
      ")N1CCCC1": 1847,
      "=C": 1848,
      "c1ccc(S(=O)(=O)N2": 1849,
      "CC(C)C": 1850,
      "(C)C)cc1": 1851,
      "c2ccc(Br)cc2": 1852,
      "c3ccc(C(=O)O)": 1853,
      "Cc1c(O)": 1854,
      "CC1CO": 1855,
      "n(C)c1=O": 1856,
      "NC1=N": 1857,
      "4)cc": 1858,
      "c3ccccc3-": 1859,
      "c2c1cc": 1860,
      "C(=S)N(": 1861,
      "CCCO3)": 1862,
      "CCCN=C(N)N)": 1863,
      "CN(Cc1ccccc1)": 1864,
      "c3ccc(S(=O)(=O)N": 1865,
      "CCCN)": 1866,
      "c(F)cc2": 1867,
      "c(NS(=O)(=O)": 1868,
      "nc2s": 1869,
      "CC(C)(C)C)": 1870,
      "C(C)=C(": 1871,
      "c2ccc(F)cc2F)": 1872,
      "cc2)CC1": 1873,
      "C(C)C(=O)N": 1874,
      "N#CC1": 1875,
      "Cl)c(Cl)c1)": 1876,
      "CC(C)n1": 1877,
      "COc1ccc(CCNC(=O)": 1878,
      "CCCCC3": 1879,
      "C2CCCN2": 1880,
      "c1ccn": 1881,
      "C=C(C#N)": 1882,
      "c(CN": 1883,
      "oc12": 1884,
      "COc2ccc(": 1885,
      "n2n1": 1886,
      ")N(C": 1887,
      "c6ccccc6": 1888,
      "c3ccs": 1889,
      "3)C2": 1890,
      "Nc1nc(N)": 1891,
      "c2ccc([N+](=O)[O-])cc2": 1892,
      "N=N": 1893,
      "(C#": 1894,
      "Cc1ccc(-c2n": 1895,
      "c2ccccn2)cc1": 1896,
      "Cc1cc(O)": 1897,
      "cn12": 1898,
      "c2cccc3c2": 1899,
      "CCC2(C)C(": 1900,
      "c21)": 1901,
      "c2ccccc2c1)": 1902,
      "cs2)cc1": 1903,
      "3)C1": 1904,
      "c2cc(-c3ccccc3)": 1905,
      "CCC3(CC2)": 1906,
      "O2)cc1": 1907,
      "Cc1ccc(OC": 1908,
      "c7": 1909,
      "CCOC(": 1910,
      "no2)cc1": 1911,
      "oc1": 1912,
      "NS(=O)(=O)c1ccc(": 1913,
      "CCC3(C)C(CCC4": 1914,
      "cc(O": 1915,
      "c2ccc(-c3n": 1916,
      "c4ccc5c(c4)": 1917,
      "c(F)c(F)": 1918,
      "c1ccccc1F)": 1919,
      "C(F)(F)C(F)(F)": 1920,
      "c2c(OC)": 1921,
      "C1CC(": 1922,
      "cc(OC)c1OC": 1923,
      "c1cc(NC(=O)": 1924,
      "c2ccncc2)cc1": 1925,
      "Nc1nc(N": 1926,
      "nn1)": 1927,
      "[nH]n1": 1928,
      "cc1-": 1929,
      "n(Cc2ccccc2)": 1930,
      "c3ccc(OC(F)(F)F)cc": 1931,
      "=S": 1932,
      "C(O)C2O)": 1933,
      "CN1CCCC1": 1934,
      "nc(O": 1935,
      "Cn2cc(": 1936,
      "c2ccccc2)CC1)": 1937,
      "c(C(N)=O)": 1938,
      "CN1CCN(C(=O)": 1939,
      "c1ccc2nc(": 1940,
      "nc(N2": 1941,
      "Cc1ccco1)": 1942,
      "c1ccncc1)": 1943,
      "Cc1cccc(NC(=O)": 1944,
      "c1cccc(F)c1)": 1945,
      ")cc(C)": 1946,
      "Cc1ccc(N2": 1947,
      "c4cccs": 1948,
      "c2)cc1OC": 1949,
      "c3cccc(O)": 1950,
      "C(=O)c3ccccc3": 1951,
      "c1Cl": 1952,
      "nn1-": 1953,
      "CC(=O)N1CCN(": 1954,
      "CCC=CCC=": 1955,
      "c4ccccc4)cc3": 1956,
      "C32": 1957,
      "NC(C)=O)": 1958,
      "CCCN1CCN(": 1959,
      "CCN(C)CC2)": 1960,
      "[N+]1": 1961,
      "Cc1c(N": 1962,
      "N3CCOCC3)": 1963,
      "CCC(C)(": 1964,
      "NCCCC": 1965,
      "c1ccc(-c2ccccc2)cc1": 1966,
      "C(CS": 1967,
      "c2cn(-": 1968,
      "CC(C)(C)N": 1969,
      "C(=O)NC(Cc2ccccc2)": 1970,
      "C(=O)CS": 1971,
      "Cc1ccc(Br)cc1": 1972,
      "c(SCC(=O)N": 1973,
      "C4O)": 1974,
      "C2CCN(C(=O)": 1975,
      "c4n3)": 1976,
      "[nH]c(-": 1977,
      "O=P": 1978,
      "OC1=O": 1979,
      "C(=O)NCc1ccccc1": 1980,
      "C3=C(": 1981,
      "Cc1cccc(N": 1982,
      "B(O)": 1983,
      "CC(O)=N": 1984,
      "c1-2": 1985,
      ")NO": 1986,
      "c1co": 1987,
      "Cc1ncc(": 1988,
      "CC(O)C1": 1989,
      "Cc2n": 1990,
      "nc3c2": 1991,
      "Cn1c(-": 1992,
      "CC(C)C1": 1993,
      "c3cc(OC)c(OC)": 1994,
      "C1CCN(S(=O)(=O)": 1995,
      "c2cco": 1996,
      "C2(C)C": 1997,
      "C2C(": 1998,
      "CC2CCCCC2)": 1999,
      "c3n2)": 2000,
      "C1c1ccccc1": 2001,
      "c2ccc(OC)c(OC)": 2002,
      "cccc12": 2003,
      "CCc1c(": 2004,
      "C(CO)C(O)C1O": 2005,
      "C(C2)": 2006,
      "c1cnc(N": 2007,
      "c2ccc(F)cc2)c1": 2008,
      "C(=O)NC(CCC(=O)O)": 2009,
      "O)cc2)cc1": 2010,
      "C(=O)C=C": 2011,
      "CCC4(C)C3CCC12C": 2012,
      "ncnc32)C(O)C1O": 2013,
      "c3ccccc13)": 2014,
      "CC(C)N1": 2015,
      "c4cccc(F)": 2016,
      "N#CC(": 2017,
      "C(=S)N1": 2018,
      "c1O)": 2019,
      "COCCNC(=O)": 2020,
      "c2ccc(NC(=O)N": 2021,
      "C(F)(F)F)cc2)": 2022,
      "n2)C1": 2023,
      "CCC(=O)N(": 2024,
      "Cc1c(Cl)cc": 2025,
      "c3nc(N": 2026,
      "c2ccccc2O": 2027,
      "Cc1cc(NC(=O)": 2028,
      "c2cccc([N+](=O)[O-])c2)": 2029,
      "CCOC(=O)N": 2030,
      "F)cc3": 2031,
      "CC12CCC3": 2032,
      "c4cccnc4)": 2033,
      "OC5": 2034,
      "c3ccc(Cl)cc3Cl)": 2035,
      "S1(=O)=O": 2036,
      "c4ccc(Cl)cc4": 2037,
      "O=C1CC(": 2038,
      "OCCO4)": 2039,
      "cs2)": 2040,
      ")C(=O)O": 2041,
      "C2CCCCC2)cc1": 2042,
      "CCCn1c(=O)": 2043,
      "c3ccc(Br)cc3": 2044,
      "Nc1nc(-": 2045,
      "COCCN": 2046,
      "c3cc(O": 2047,
      "c5c4": 2048,
      "CC(C)(C)c1ccc(": 2049,
      "C(=O)N2CC": 2050,
      "n[nH]1": 2051,
      ")Nc1ccccc1": 2052,
      "c3ncc(": 2053,
      "CCN(Cc2ccccc2)CC1": 2054,
      "c2ccc(F)c(F)": 2055,
      "O=c1cc(": 2056,
      "c1cc(C(=O)N": 2057,
      "n2)n1": 2058,
      "C1=C(O)": 2059,
      "CC1(C)CC(=O)": 2060,
      "CCN2CCOCC2)": 2061,
      "c-3": 2062,
      "C3=O": 2063,
      "C=CC2": 2064,
      "N1CCCC1": 2065,
      "c1cccc(O)c1": 2066,
      "C(C)CO)C(=O)": 2067,
      "cn4)": 2068,
      "c2o1": 2069,
      "NC(=O)CNC(=O)": 2070,
      "CCN(CC": 2071,
      "CCC4(": 2072,
      "C2CN(": 2073,
      "O)cc2)": 2074,
      "c1ccc(C#N)cc1": 2075,
      "Cc1ccc(-c2ccccc2-": 2076,
      "O=c1c2ccccc2": 2077,
      "c3cccc(OC)": 2078,
      "C1CCN(C(=O)": 2079,
      "C)n1": 2080,
      "c4cccc5": 2081,
      "[Si](C)(C)": 2082,
      "C12C": 2083,
      "COc1ccc(OC)c(": 2084,
      "CCN4": 2085,
      "O=C(NO)": 2086,
      "c4ccc(O": 2087,
      "c1nc2cc(": 2088,
      "c(Cl)c(Cl)": 2089,
      "c2c(-c3ccccc3)": 2090,
      "CC1C": 2091,
      "COc1ccc(C2=N": 2092,
      "O=S1": 2093,
      "Cc1ccc2[nH]": 2094,
      "c3ccccc3C)": 2095,
      "c1c(OC)": 2096,
      "NC(=O)c1cc(": 2097,
      ")ccc1Cl": 2098,
      "4CCCC4)": 2099,
      "C12CC3CC(CC(C3)C1)C2": 2100,
      "c2ccccc2O)": 2101,
      "Cc1cccn": 2102,
      "c3c[nH]c4ccccc34)": 2103,
      "nnnc1": 2104,
      "c1ccc(Br)cc1)": 2105,
      "c3cccc4ccccc34)": 2106,
      "c4ccc(F)cc4": 2107,
      "CC1CCCO1": 2108,
      "c(C)c(C)": 2109,
      "Cc4ccccc4)": 2110,
