{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 60,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 60
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          0
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          1
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<bos>": 0,
      "<eos>": 1,
      "<pad>": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "(": 6,
      ")": 7,
      "*": 8,
      "+": 9,
      "-": 10,
      ".": 11,
      "/": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "6": 19,
      "7": 20,
      "8": 21,
      "9": 22,
      ":": 23,
      "<": 24,
      "=": 25,
      ">": 26,
      "?": 27,
      "@": 28,
      "B": 29,
      "C": 30,
      "F": 31,
      "H": 32,
      "I": 33,
      "N": 34,
      "O": 35,
      "P": 36,
      "S": 37,
      "[": 38,
      "\\": 39,
      "]": 40,
      "b": 41,
      "c": 42,
      "l": 43,
      "n": 44,
      "o": 45,
      "p": 46,
      "r": 47,
      "s": 48,
      "~": 49,
      "cc": 50,
      "CC": 51,
      "c1": 52,
      "O)": 53,
      "=O)": 54,
      "(C": 55,
      "(=O)": 56,
      "c2": 57,
      "c1cc": 58,
      "(C)": 59,
      "C(=O)": 60,
      "c(": 61,
      "c2cc": 62,
      "2)": 63,
      "NC(=O)": 64,
      "c3": 65,
      "n1": 66,
      "F)": 67,
      "(=O)N": 68,
      "c(C": 69,
      "CCC": 70,
      "cc1": 71,
      "c1cccc": 72,
      "CO": 73,
      "cn": 74,
      "CC1": 75,
      "c2cccc": 76,
      "c1n": 77,
      "C1": 78,
      "c1ccc(": 79,
      "C)": 80,
      "CCN": 81,
      "C(": 82,
      "c2)": 83,
      "CCO": 84,
      "3)": 85,
      "O=": 86,
      "c(C)": 87,
      "c3cc": 88,
      "N)": 89,
      "c1ccccc1": 90,
      "H]": 91,
      "[n": 92,
      "[nH]": 93,
      "Cc1cc": 94,
      "CC(=O)N": 95,
      "(F)": 96,
      "C(=O)N": 97,
      "l)": 98,
      "CN": 99,
      "C(C)": 100,
      "c2n": 101,
      "S(=O)": 102,
      "CC(C)": 103,
      "O=C(": 104,
      "n2": 105,
      "CC2)": 106,
      "cs": 107,
      "C2": 108,
      "c(-": 109,
      "c2ccccc2": 110,
      "NC(=O)N": 111,
      "(C(=O)N": 112,
      "Cc1n": 113,
      "c1ccc(C": 114,
      "c3cccc": 115,
      "(C(=O)": 116,
      "c1)": 117,
      "CC(": 118,
      "c(F)": 119,
      "c(=O)": 120,
      "cc2)": 121,
      "N1": 122,
      "nn": 123,
      "(-": 124,
      "O=C(N": 125,
      "cc2": 126,
      "CC2": 127,
      "c3ccccc3": 128,
      "o1": 129,
      "c2ccccc2)": 130,
      "OC)": 131,
      "ccc1": 132,
      "#N)": 133,
      "2)cc1": 134,
      "=O": 135,
      "S(=O)(=O)": 136,
      "C(C": 137,
      "c1cccc(": 138,
      "c1cn": 139,
      "CCN(": 140,
      "(C)C)": 141,
      "c(C(=O)N": 142,
      "Cc1ccc(": 143,
      "N2": 144,
      "CCCCC": 145,
      "c2c(": 146,
      "S(=O)(=O)N": 147,
      "Cn1": 148,
      "1)": 149,
      "ccc2": 150,
      "cn1": 151,
      "2)c1": 152,
      "COC(=O)": 153,
      "CCCC": 154,
      "Br": 155,
      "c(Cl)": 156,
      "(Cl)": 157,
      "(F)F)": 158,
      "NC(=O)C": 159,
      "s1": 160,
      "OC": 161,
      "nc1": 162,
      "CCN(C(=O)": 163,
      "(N)": 164,
      "c4": 165,
      "O=C(C": 166,
      "COc1ccc(": 167,
      "nc(": 168,
      "Br)": 169,
      "Cc1": 170,
      "c2ccc(": 171,
      "COc1cc": 172,
      "n2)": 173,
      "CCC(": 174,
      "CCC(=O)N": 175,
      "n(C)": 176,
      "c2cn": 177,
      "F)cc1": 178,
      "CCCN": 179,
      "CCCO": 180,
      "c1C": 181,
      "CCn1": 182,
      "CCNC(=O)": 183,
      "c2ccc(F)": 184,
      "CCCC1": 185,
      "(F)(F)F)": 186,
      "c2c(c1)": 187,
      "nc2": 188,
      "CC)": 189,
      "Cc1ccccc1": 190,
      "c3)": 191,
      "c(C)c1": 192,
      "co": 193,
      "n1)": 194,
      "cc(": 195,
      "n3": 196,
      "CC(=O)": 197,
      "c[nH]": 198,
      "N#": 199,
      "C1CC1": 200,
      "CC3)": 201,
      "ncc": 202,
      "(C)C(=O)": 203,
      "COc1ccc(C": 204,
      "c3ccccc3)": 205,
      "NC(=O)c2cc": 206,
      "CCOC(=O)": 207,
      "C2)": 208,
      "CCN1": 209,
      "CNC(=O)": 210,
      "cs1": 211,
      "c2ncc": 212,
      "c1ccccc1)": 213,
      "Cl)": 214,
      "Cc2cc": 215,
      "n2cc": 216,
      "c1ccc2c(c1)": 217,
      "Sc1n": 218,
      "c3c(": 219,
      "c1cccc(C": 220,
      "nc(-": 221,
      "C(=O)N1": 222,
      "CCc1n": 223,
      "c2c1": 224,
      "Cl": 225,
      "CCN(C": 226,
      "c(N": 227,
      "2CC": 228,
      "c1ccc(F)cc1": 229,
      "4)": 230,
      "=O)cc1": 231,
      "cnc1": 232,
      "C=": 233,
      "CN1": 234,
      "nc(C": 235,
      "no": 236,
      "CCOCC1": 237,
      "c(=O)[nH]": 238,
      "c(F)cc": 239,
      "CN(": 240,
      "(C)C": 241,
      "c1=O": 242,
      "c1ccc(-": 243,
      "CC(=O)N1": 244,
      "no1": 245,
      "C(F)": 246,
      "CC(C)(C)": 247,
      "CCC1": 248,
      "n(": 249,
      "cccc": 250,
      "CC2)cc1": 251,
      "c1ccc(Cl)": 252,
      "n(-": 253,
      "C(C)C)": 254,
      "c1ncc": 255,
      "CC(O)": 256,
      "CN(C": 257,
      "Cc1ccc(C": 258,
      "COc1ccccc1": 259,
      "nn1": 260,
      "cc1)": 261,
      "cnc2": 262,
      "c2ccccc21": 263,
      "OC(=O)": 264,
      "2)CC1": 265,
      "c2ccc(F)cc2)": 266,
      "Cc1cc(C)": 267,
      "CCCCC1": 268,
      "(N)=O)": 269,
      "C3": 270,
      "c(N)": 271,
      "CN(C(=O)": 272,
      "S(C)": 273,
      "nc(C)": 274,
      "NC(=O)c1cc": 275,
      "CCC(C)": 276,
      "(C#N)": 277,
      "c2)cc1": 278,
      "n3)": 279,
      "co1": 280,
      "CCC2": 281,
      "Cc1cc(": 282,
      "S(C)(=O)": 283,
      "Cc1cccc": 284,
      "c12": 285,
      "c(-c2cc": 286,
      "NS(=O)(=O)": 287,
      "Cc1cccc(": 288,
      "OCC(=O)N": 289,
      "OCC": 290,
      "Cc1no": 291,
      "n2)cc1": 292,
      "c2)c1": 293,
      "C(N)": 294,
      "c1cc(": 295,
      "CC2)c1": 296,
      "c3c(c2)": 297,
      "Cn1cc": 298,
      "OCCO": 299,
      "c(C#N)": 300,
      "OC(C)": 301,
      "(O)": 302,
      "OCO": 303,
      "NC(=O)C2": 304,
      "n[nH]": 305,
      "2cc": 306,
      "c1ccc(C(=O)N": 307,
      "c2C)": 308,
      "n2cn": 309,
      "O=C1": 310,
      "CC1)": 311,
      "c(OC)": 312,
      "c2ccc(Cl)": 313,
      "CCO)": 314,
      "CN(C)": 315,
      "c(-c3cc": 316,
      "c(S": 317,
      "Cc1cn": 318,
      "n(C": 319,
      "ncc1": 320,
      "C#": 321,
      "cs2)": 322,
      "NC(=O)C1": 323,
      "N2CC": 324,
      "c(NC(=O)": 325,
      "c(C)cc": 326,
      "C(C)C": 327,
      "CC(C": 328,
      "c2cccc(": 329,
      "cn2)": 330,
      "sc1": 331,
      ")N": 332,
      "CN(C)C(=O)": 333,
      "c2cc(": 334,
      "n1cc": 335,
      "2CCO": 336,
      "CCCN(C(=O)": 337,
      "Cc1ccc(-": 338,
      "c1ccc(F)": 339,
      "=O)c1": 340,
      "CS": 341,
      "c(C2": 342,
      "ncc2)": 343,
      "1)N": 344,
      "cn3)": 345,
      "c2ccc3c(c2)": 346,
      "c2s": 347,
      "n2)c1": 348,
      "c1cs": 349,
      "Cc1cs": 350,
      "CCNC(=O)N": 351,
      "Cc1ccc(C(=O)N": 352,
      "3)cc1": 353,
      "c1cccc(F)": 354,
      "N2CCO": 355,
      "ccc21": 356,
      "c2ncn": 357,
      "nc3": 358,
      "c1ccco1": 359,
      "c2ccc(C)": 360,
      "cc3": 361,
      "c1s": 362,
      "c2cccc(F)": 363,
      "CC(C)C)": 364,
      "c2cccn": 365,
      "c1cccc(C(=O)N": 366,
      "N(C)C(=O)": 367,
      "c1ccc(Cl)cc1": 368,
      "c2)CC1": 369,
      "c4cccc": 370,
      "S(=O)(=O)N1": 371,
      "Cc1cc(C(=O)N": 372,
      "c1cccc(-": 373,
      "CCC(C": 374,
      "CCCN(": 375,
      "c2[nH]": 376,
      "co2)": 377,
      "c2cs": 378,
      "NC(=O)C(C)": 379,
      "C2CC2)": 380,
      "ccn1": 381,
      "s2)": 382,
      "N3": 383,
      "c2ccccc2F)": 384,
      "c3ncc": 385,
      "NC(=O)CC": 386,
      "c(C(C)": 387,
      "c2c(C)": 388,
      "3CC3)": 389,
      "ccc3": 390,
      "NC(C)": 391,
      "N(C)": 392,
      "ncn": 393,
      "S(C)(=O)=O)": 394,
      "CCCC3)": 395,
      "c(F)c1": 396,
      "c3cn": 397,
      "NCC": 398,
      "c2)n1": 399,
      "c1c(C)": 400,
      "N1CC": 401,
      "cc21": 402,
      "nc(S": 403,
      "c1cc(F)": 404,
      "c1cc(-": 405,
      "COc1ccc(-": 406,
      "c1cc(C": 407,
      "C)cc1": 408,
      "C3)": 409,
      "CC(C)O": 410,
      "CCCN1": 411,
      "C2CC": 412,
      "NC1": 413,
      "c1ccc(C)": 414,
      "NC": 415,
      "OC(F)": 416,
      "CC2)n1": 417,
      "CCCn1": 418,
      "c2ccccn2)": 419,
      "c(Cl)cc": 420,
      "c1cccc(Cl)": 421,
      "O=S(=O)": 422,
      "c2cc(C)": 423,
      "CCN(CC)": 424,
      "c1cccnc1": 425,
      "c2ccccc12": 426,
      "c3ccc(F)cc": 427,
      "c1cccc2": 428,
      "cs1)": 429,
      "(F)F": 430,
      "s1)": 431,
      "COc1cccc(": 432,
      "c2=O)": 433,
      "CC(N)": 434,
      "c2cc(F)": 435,
      "CCN1C(=O)": 436,
      "CCCCC2)": 437,
      "CSc1n": 438,
      "c4ccccc4": 439,
      "nn2": 440,
      "c2no": 441,
      "n1-": 442,
      "NC(=O)N1": 443,
      "c1=O)": 444,
      "ccc1F": 445,
      "c2ccc(F)cc2": 446,
      "cc2)cc1": 447,
      "N1CCOCC1": 448,
      "n3cc": 449,
      "CCn1cc": 450,
      "c1ccncc1": 451,
      "c1c[nH]": 452,
      "c1cc2": 453,
      "N(": 454,
      "on1": 455,
      "C#N)": 456,
      "C1)": 457,
      "CCN(C(=O)N": 458,
      "C1CCCC1": 459,
      "Sc2n": 460,
      "[nH]1": 461,
      "c(C(=O)": 462,
      "CC(F)(F)F)": 463,
      "c1cccs1": 464,
      "c2cccc(Cl)": 465,
      "OC)c1": 466,
      "Nc1n": 467,
      "CCC(=O)N1": 468,
      "Cc2ccccc2": 469,
      "CC3": 470,
      "CC(NC(=O)": 471,
      "c2ccncc2)": 472,
      "co3)": 473,
      "cnc1)": 474,
      "cc2)c1": 475,
      "O=S(=O)(": 476,
      "CCCNC(=O)": 477,
      "CC(C(=O)N": 478,
      "c1cc(C(=O)N": 479,
      "N1CCCC1": 480,
      "cs3)": 481,
      "COc1cc(": 482,
      "c1cc(Cl)": 483,
      "(C(F)(F)F)": 484,
      "(N)(=O)": 485,
      "c23)": 486,
      "c(=O)n(C)": 487,
      "cnc3)": 488,
      "CCOCC3)": 489,
      "c2ccccc2)c1": 490,
      "CCC(O)": 491,
      "c2ccccc2)cc1": 492,
      "C1=O": 493,
      "cn1)": 494,
      "CCCC2": 495,
      "c(C(F)(F)F)": 496,
      "o2)": 497,
      "NC(=O)CO": 498,
      "c4cc": 499,
      "n1cn": 500,
      "Br)cc1": 501,
      "n1C": 502,
      "c2nc(C)": 503,
      "CCOc1ccccc1": 504,
      "c2n1": 505,
      "CC=": 506,
      "Cc1nn(C)": 507,
      "Cc1cc(C": 508,
      "c1ccccn1": 509,
      "C(C)(C)C)": 510,
      "2CCC": 511,
      "Cc1noc(C)c1": 512,
      "CCCCC2": 513,
      "Cc1cccc(C": 514,
      "c2nc3ccccc3": 515,
      "C)c1": 516,
      "c1cccc(F)c1": 517,
      "COc1ccc(C(=O)N": 518,
      "(C)c1": 519,
      "CCOc1ccc(": 520,
      "C(O)": 521,
      "c(Cl)c1": 522,
      "c2ccccc2)CC1": 523,
      "C2)c1": 524,
      "CNC(=O)N": 525,
      "c1cc(C)": 526,
      "c(OC)c1": 527,
      "c3nn": 528,
      "ncc2": 529,
      "cn2)cc1": 530,
      "c1no": 531,
      "C2)cc1": 532,
      "S(N)(=O)": 533,
      "c(-c2ccccc2)": 534,
      "c2nc(C": 535,
      "c2ccccc2Cl)": 536,
      "c1[nH]": 537,
      "C1CCN(C(=O)": 538,
      "3cc": 539,
      "c1ncccc1": 540,
      "CCC3)": 541,
      "CCC#N)": 542,
      "O=C(NCc1cc": 543,
      "Cc1o": 544,
      "c1ccccn1)": 545,
      "N1CCN(": 546,
      "c2ccc(Cl)cc2)": 547,
      "C(N)=O": 548,
      "CC(=O)N(": 549,
      "CCC(C(=O)N": 550,
      "CCO1": 551,
      "(CO)": 552,
      "Cn1cn": 553,
      "nc(C(=O)N": 554,
      "Cc1nc(C": 555,
      "Cc1ccc(C)": 556,
      "C(C)(C)": 557,
      "n2nn": 558,
      "c2cc(Cl)": 559,
      "c2nc(-c3cc": 560,
      "N(C": 561,
      "cn2": 562,
      "c3ccc(F)cc3)": 563,
      "c1o": 564,
      "CCN2": 565,
      "[nH]c(=O)": 566,
      "c3ccccc32)": 567,
      "c2ccc(OC)": 568,
      "CC(N)=O)": 569,
      "CC1CCCO": 570,
      "C1CCCCC1": 571,
      "C(N)=O)": 572,
      "n3cn": 573,
      "c1cccnc1)": 574,
      "C1CC1)": 575,
      "c2)C1": 576,
      "n(CC(=O)N": 577,
      "cc12": 578,
      "cc(Br)": 579,
      "ncc3)": 580,
      "2CCN(": 581,
      "c2cccs2)": 582,
      "c1ccccc1F": 583,
      "c(O)": 584,
      "c2o": 585,
      "ccc12": 586,
      "CCCC3": 587,
      "nnc1": 588,
      "no2)": 589,
      "c3ccccn3)": 590,
      "C1(": 591,
      "Cc1ncc": 592,
      "CCCCC3)": 593,
      "OCCO2": 594,
      "n2)CC1": 595,
      "nc2c1": 596,
      "c1ccc(F)cc1)": 597,
      "CCN(CC)C(=O)": 598,
      "ncc1)": 599,
      "CC(=O)Nc1ccc(": 600,
      "C(=O)O": 601,
      "Cc1n[nH]": 602,
      "CCS": 603,
      "c(=O)[nH]1": 604,
      "c2c[nH]": 605,
      "CC1CC": 606,
      "nc2n1": 607,
      "COc1cccc(C": 608,
      "O)cc1": 609,
      "(C)C)cc1": 610,
      "CC(=O)N(C)": 611,
      "ncn1": 612,
      "(C(N)=O)": 613,
      "c3cccnc3)": 614,
      "c3ccco3)": 615,
      "c(F)cccc1": 616,
      "NC(=O)c2cn": 617,
      "N2C(=O)": 618,
      "c1cccc(Cl)c1": 619,
      "CCCO2)": 620,
      "C(C)C(=O)N": 621,
      "c1)N": 622,
      "OCO2": 623,
      "CC(=O)N(C": 624,
      "c2ccco2)": 625,
      "c(=O)o": 626,
      "cc2c1": 627,
      "[nH]n1": 628,
      "N)cc1": 629,
      "nc1-": 630,
      "c(=O)n2": 631,
      "O=C(CO": 632,
      "CCc1ccc(": 633,
      "Cc1ccc(F)cc1": 634,
      "c1nc2ccccc2": 635,
      "C3CC3)": 636,
      "cc3)": 637,
      "C1CCN(": 638,
      "c2ccc(-": 639,
      "CC(C)(C)O": 640,
      "cc2Cl)": 641,
      "n[nH]1": 642,
      "cc2)n1": 643,
      "NC(=O)CN": 644,
      "c1ccccc1F)": 645,
      "3)c1": 646,
      "o2)cc1": 647,
      "cc(F)": 648,
      "OC(C)(C)C)": 649,
      "c1ccc(-n2cc": 650,
      "ccc1=O": 651,
      "CCN(C)": 652,
      "2CC2)": 653,
      "c1ccco1)": 654,
      "c3s": 655,
      "c1cccc2cc": 656,
      "CCCC(=O)N": 657,
      "c2cc(C(=O)N": 658,
      "O=C(NCC": 659,
      "C2)n1": 660,
      "O=C(c1cc": 661,
      "c3ccccc23)": 662,
      "c12)": 663,
      "2ccccc2": 664,
      "c2c(F)cc": 665,
      "c(C)cc1": 666,
      "N2CCCC2": 667,
      "c(NC(=O)N": 668,
      "c(-c3ccccc3)": 669,
      "CCC2)": 670,
      "c2ccccc2)n1": 671,
      "c3[nH]": 672,
      "cc(C(=O)N": 673,
      "CCC3": 674,
      "Cc1nc(C)": 675,
      "(=O)[nH]": 676,
      "N2CCOCC2)": 677,
      "2CCCC2": 678,
      "nc2)": 679,
      "(C)=O)": 680,
      "NC(=O)c1ccc(": 681,
      "c2cc3": 682,
      "CN1C(=O)": 683,
      "NC(C)=O)": 684,
      "Cc1cccnc1": 685,
      "c2ccs": 686,
      "COc1ccc(OC)": 687,
      "CCC2(": 688,
      "CC(=O)N2": 689,
      "c2ccc(C": 690,
      "c2cccc(C)": 691,
      "ccc1Cl": 692,
      "NC(=O)CSc1n": 693,
      "c(NC(=O)c2cc": 694,
      "nc(N": 695,
      "CCC(=O)": 696,
      "C(C#N)": 697,
      "c2cnn(C)": 698,
      "-c1n": 699,
      "CC#N)": 700,
      "C(F)(F)F": 701,
      "Cn1cc(": 702,
      "CC(N": 703,
      "CNS(=O)(=O)": 704,
      "Cc1ccco1": 705,
      "ccc1C": 706,
      "c3cccs3)": 707,
      "CC(=O)c1ccc(": 708,
      "c2cccnc2)": 709,
      "NC(=O)c1cn": 710,
      "3CCCC3)": 711,
      "CC(=O)O": 712,
      "CC1(C)": 713,
      "Cc1cccc(C(=O)N": 714,
      "C(C)(C)C": 715,
      "S(C)(=O)=O": 716,
      "c1ccc(C#N)": 717,
      "c2cc(F)ccc2": 718,
      "c(NC(=O)C": 719,
      "O1": 720,
      "N(C(=O)": 721,
      "CC1(": 722,
      "C2CC2)cc1": 723,
      "c1ccc(OC)": 724,
      "CCNS(=O)(=O)": 725,
      "C(=O)N(C)": 726,
      "CCCCC1)": 727,
      "cc(-": 728,
      "c2ccc(Br)": 729,
      "nn2)cc1": 730,
      "c2cccc(F)c2)": 731,
      "c2cc(-": 732,
      "CCc1ccccc1": 733,
      "c(S(=O)(=O)N": 734,
      "c1c(F)cccc1": 735,
      "N1CCC(": 736,
      "CC(C)c1n": 737,
      "Cc1cc2": 738,
      "n12": 739,
      "c(cc1": 740,
      "c1cccs1)": 741,
      "NC(=O)N(C)": 742,
      "nn(C)": 743,
      "3CCOCC3)": 744,
      "c4c(": 745,
      "c(Br)": 746,
      "COc1cc(C": 747,
      "Cc1ccc(S(=O)(=O)N": 748,
      "(C)(C)C)": 749,
      "c2ccc(C(=O)N": 750,
      "-c1ccccc1": 751,
      "COc1cccc(C(=O)N": 752,
      "c(CC(=O)N": 753,
      "CS(=O)(=O)": 754,
      "c2ccc(F)c(F)": 755,
      "nn3": 756,
      "CC(O": 757,
      "OC2": 758,
      "c(N2": 759,
      "Cc1c(C(=O)N": 760,
      "c1ccc(Cl)cc1)": 761,
      "CCCO3)": 762,
      "cc2)CC1": 763,
      "nc1S": 764,
      "CC4)": 765,
      "O=C(Cn1": 766,
      "O=C(C1": 767,
      "c3ccncc3)": 768,
      "nnn2": 769,
      "nc(N)": 770,
      "c(CN": 771,
      "C1=": 772,
      "c2ccccc21)": 773,
      "CCCO)": 774,
      "CCc1no": 775,
      "COc1cc(C)": 776,
      "cc2F)": 777,
      "OCO3)": 778,
      "NC(=O)NC": 779,
      "2CCOCC2)": 780,
      "c2n[nH]": 781,
      "CCCc1n": 782,
      "cnc3": 783,
      "CCn1cn": 784,
      "c2=O)cc1": 785,
      "2CCCC2)": 786,
      "O=C(O": 787,
      "C(F)(F)F)": 788,
      "Cc1ccc2c(c1)": 789,
      "C1CC": 790,
      "cnc12": 791,
      "cs2)cc1": 792,
      "c1cnn(-": 793,
      "c1ccncc1)": 794,
      "c1ccc(F)c(F)c1": 795,
      "s3)": 796,
      "CCNC2": 797,
      "c2ccc(O)": 798,
      "CC(NC(=O)N": 799,
      "c1ncn": 800,
      "c2ccccc2n1": 801,
      "ccc1O": 802,
      "c3ccccc3F)": 803,
      "c2ccc(C#N)": 804,
      "nccc1": 805,
      "cn2)CC1": 806,
      "CCCCCC1": 807,
      "c1ccsc1": 808,
      "#N": 809,
      "c1ccc(O": 810,
      "c(C)n1": 811,
      "c2nnc(C": 812,
      "cnc21": 813,
      "ccccc3": 814,
      "cc(C)": 815,
      "c2C)cc1": 816,
      "NC(=O)CS": 817,
      "S(N)(=O)=O)": 818,
      "N2CCN(C(=O)": 819,
      "nc(C)c1": 820,
      "c(CO)": 821,
      "OC(F)F)": 822,
      "N#Cc1ccc(": 823,
      "c(SCC(=O)N": 824,
      "CCOCC1)": 825,
      "c21": 826,
      "c2ccccc2)C1": 827,
      "CCCC2)": 828,
      "CCCN1C(=O)": 829,
      "c(C)cc(C)": 830,
      "NCC(=O)N": 831,
      "c2cccc(-": 832,
      "(C)C)c1": 833,
      "2CCC(": 834,
      "2)n1": 835,
      "cc(OC)c1": 836,
      "nc2ccccc21": 837,
      "s2)cc1": 838,
      "c1)C(=O)": 839,
      "O=C(CC": 840,
      "N1CCN(C(=O)": 841,
      "nc1C": 842,
      "c1ccccc1Cl": 843,
      "O=C(Nc1n": 844,
      "c3cccc(F)": 845,
      "CCN(C)C(=O)": 846,
      "sc1C": 847,
      "CCCN(C": 848,
      "c2ccc(N)": 849,
      "CC(=O)N1CC": 850,
      "C(C(=O)N": 851,
      "nc12": 852,
      "Cc1ccc(Cl)": 853,
      "c1cccc2c1": 854,
      "CN1CCN(C(=O)": 855,
      "cn2)c1": 856,
      "n3cccn3)": 857,
      "Cn1nn": 858,
      "CCCC1)": 859,
      "ncn2": 860,
      "c1cnn(C)": 861,
      "COc1ccc(Cl)": 862,
      "CCC(CC)": 863,
      "cc2C)": 864,
      "c2ccc(F)cc2F)": 865,
      "c1ccc(C)cc1": 866,
      "CCOC1": 867,
      "n2nc(C)": 868,
      "NC(=O)NC(C)": 869,
      "Cc1s": 870,
      "n2cccn2)": 871,
      "cc(Cl)": 872,
      "cnc2)": 873,
      "Cc1cc(-": 874,
      "Cc1nn(C)c(C)c1": 875,
      "C2(": 876,
      "nc(NC(=O)": 877,
      "C(=O)N1CCC(": 878,
      "c2ccccc12)": 879,
      "c1ccc(Br)cc1": 880,
      "CC2(": 881,
      "nnn1-": 882,
      "2)C1": 883,
      "c3n": 884,
      "c3cc(C)": 885,
      "CS(=O)(=O)N": 886,
      "O=C(NC1": 887,
      "C(C)C)cc1": 888,
      "o1)": 889,
      "c1ccc(S(=O)(=O)N": 890,
      "c1ccc2[nH]": 891,
      "c1ccccc1)N": 892,
      "n(C)n1": 893,
      "nc1)": 894,
      "c(C)c(C)": 895,
      "-n1cc": 896,
      "c2nnc(-": 897,
      "COCCNC(=O)": 898,
      "CC1CO": 899,
      "(C(=O)O": 900,
      "cs2)c1": 901,
      "C#N": 902,
      "O=S(=O)(N": 903,
      "c(C(C)C)": 904,
      "c2cccc3cc": 905,
      "cc(C": 906,
      "c1N": 907,
      "c(C(C)(C)C)": 908,
      "s2)c1": 909,
      "Cc1nc(-": 910,
      "c1ccc(C(=O)": 911,
      "cc1Cl": 912,
      "c[nH]1": 913,
      "c2n(": 914,
      "CC(C)O1": 915,
      "cc1C(=O)N": 916,
      "CC1CC1": 917,
      "n1)N": 918,
      "N1CCCCC1": 919,
      "c1ccc(-n2cn": 920,
      "CC(C)NC(=O)": 921,
      "nc3)": 922,
      "ccc1OC": 923,
      "2CCCC": 924,
      "OCCO3)": 925,
      "(F)(F)F": 926,
      "nn3)": 927,
      "c2cccc(Cl)c2)": 928,
      "c2cccc3": 929,
      "c1n[nH]": 930,
      "c1ccc2c(c1)OCO2": 931,
      "COc1": 932,
      "oc1": 933,
      "c1cccc(F)c1)": 934,
      "c2C1": 935,
      "COc1cc(OC)": 936,
      "n2ncc": 937,
      "n4": 938,
      "c(=O)n1": 939,
      "N2CCN(": 940,
      "c2cncc": 941,
      "nn1C": 942,
      "O=C(CSc1n": 943,
      "c(NC": 944,
      "n2)n1": 945,
      "COc1ccc(C)cc1": 946,
      "nc2cccc": 947,
      "n2C)": 948,
      "c2nn": 949,
      "c1cc(Br)": 950,
      "Cn1c(=O)": 951,
      "CC1CCN(C(=O)": 952,
      "c2sccc2": 953,
      "c3nc(C)": 954,
      "nn12": 955,
      "CC1CC1)": 956,
      "c2cc1": 957,
      "c(C(N)=O)": 958,
      "c2cc(C": 959,
      "no3)": 960,
      "C=CCNC(=O)": 961,
      "CCCN(C(=O)N": 962,
      "4CC4)": 963,
      "N1CCN(C": 964,
      "CCNC(=O)C": 965,
      "CS(=O)(=O)N1": 966,
      "C2CCCC2)": 967,
      "Cc1cc(=O)": 968,
      "C2CC2)c1": 969,
      "o2)c1": 970,
      "c(C)o1": 971,
      "CC1CCCO1": 972,
      "c(CC)": 973,
      "c2cc(Cl)ccc2": 974,
      "O)c1": 975,
      "c1ccccc1)C(=O)": 976,
      "Cc1cccc(C)c1": 977,
      "n2c1": 978,
      "c2ccccc2c1": 979,
      "CC1CN(C(=O)": 980,
      "OCC2": 981,
      "C2=O)": 982,
      "c2c(C)no": 983,
      "ccc23)": 984,
      "N(C)C(=O)N": 985,
      "c3ncccn3)": 986,
      "cc(=O)": 987,
      "c1ccc(C(F)(F)F)": 988,
      "c3cc(F)": 989,
      "c3ccccc32)cc1": 990,
      "c3C)": 991,
      "c(Cl)cc3)": 992,
      "nc1N": 993,
      "c(-c2cccs2)": 994,
      "sc1C(=O)N": 995,
      "Cc1ccc(NC(=O)": 996,
      "(-c2ccccc2)": 997,
      "c(C2CC2)": 998,
      "O=c1[nH]": 999,
      "c1Cl": 1000,
      "c2)s1": 1001,
      "N1C(=O)": 1002,
      "c4)": 1003,
      "c(C(=O)NC": 1004,
      "S(=O)(=O)N(C)": 1005,
      "c4c(c3)": 1006,
      "N)c1": 1007,
      "Cc1cc(F)": 1008,
      "(CC)": 1009,
      "COCCO": 1010,
      "COC(=O)N": 1011,
      "NCc2cc": 1012,
      "CCSc1n": 1013,
      "co2)cc1": 1014,
      "c1cc(F)ccc1": 1015,
      "nc(SCC(=O)N": 1016,
      "CCCn1cc": 1017,
      "c2ccccc2c1=O": 1018,
      "COc1ccc(F)cc1": 1019,
      "COc1cc2": 1020,
      "CC(C)n1": 1021,
      "c(=O)n(": 1022,
      "no2)cc1": 1023,
      "c1ccc(NC(=O)": 1024,
      "n2n": 1025,
      "c1ccccc1Cl)": 1026,
      "CCN(CC(=O)N": 1027,
      "c1ccc2n": 1028,
      "CCCN2C(=O)": 1029,
      "c1ccccc1O": 1030,
      "NC(=O)NCC": 1031,
      "(C(=O)NC": 1032,
      "c1ccc2c(c1)OCCO2": 1033,
      "c4ccccc4)": 1034,
      "CC(=O)c1cccc(": 1035,
      "c1nccs1": 1036,
      "c3cccc(F)c3)": 1037,
      "CCc1o": 1038,
      "CC(C)C(=O)N": 1039,
      "COC(=O)C1": 1040,
      "OCO2)": 1041,
      "CCNc1n": 1042,
      "2CCN(C": 1043,
      "COc1ccc(Cl)cc1": 1044,
      "c(CO": 1045,
      "CCn1nc(C)": 1046,
      "c2cco": 1047,
      "c2ccccc2C1": 1048,
      "=N": 1049,
      "-n1cn": 1050,
      "sc2c1": 1051,
      "2CCN(C(=O)": 1052,
      "N1CCO": 1053,
      "o3)": 1054,
      "3CC": 1055,
      "C=CCn1": 1056,
      "S(C)(=O)=O)cc1": 1057,
      "N(C)C)": 1058,
      "N3CCOCC3)": 1059,
      "sc1)": 1060,
      "COc1cccc(-": 1061,
      "c1cccc(C#N)": 1062,
      "CC1=O": 1063,
      "CC(C)OC(C)": 1064,
      "Cc1[nH]": 1065,
      "no1)": 1066,
      "c2)cn1": 1067,
      "c3ccc(F)cc3": 1068,
      "c(C)s1": 1069,
      "CN(C)S(=O)(=O)": 1070,
      "O=C(CC1": 1071,
      "c1ccc(F)cc1F": 1072,
      "C(=O)N1CC": 1073,
      "nn(-": 1074,
      "c3ccccc32)c1": 1075,
      "c2ccc(NC(=O)": 1076,
      "cc1C": 1077,
      "2CC3": 1078,
      "c2cccc(C#N)": 1079,
      "c2=O)c1": 1080,
      "c2cn[nH]": 1081,
      "c1cc2ccccc2": 1082,
      "c1cn[nH]": 1083,
      "CCCNC(=O)N": 1084,
      "Cc1occc1": 1085,
      "Cc1ccncc1": 1086,
      "c2C)c1": 1087,
      "c(C(C)=O)": 1088,
      "OCC(F)F)": 1089,
      "c1cccc(C)c1": 1090,
      "n3C)": 1091,
      "nc2s": 1092,
      "2CCCCC2": 1093,
      "c2ncccc2": 1094,
      "n3cncn3)": 1095,
      "Cc1cc(C)cc(": 1096,
      "(C)C(=O)N": 1097,
      "ccn3)": 1098,
      "nnn1": 1099,
      "c1cccc(Br)": 1100,
      "[nH]1)": 1101,
      "COc1cc(C(=O)N": 1102,
      "CC(NC(=O)c1cc": 1103,
      "n2)C1": 1104,
      "CN(CC(=O)N": 1105,
      "c2ccccc21)N": 1106,
      "COc1ccc(C(=O)": 1107,
      "c(O": 1108,
      "C1CCCN(C(=O)": 1109,
      "n(-c2ccccc2)": 1110,
      "c(N)c1": 1111,
      "c1ccc(O)": 1112,
      "CCOc1ccc(C(=O)N": 1113,
      "Cc1ccc(C(=O)": 1114,
      "C1CO": 1115,
      "OCC(F)(F)F)": 1116,
      "CCN2C(=O)": 1117,
      "nn2)": 1118,
      "c1ccccc1NC(=O)": 1119,
      "cs1)N": 1120,
      "3CCCCC3)": 1121,
      "CC(C)C": 1122,
      "O=c1": 1123,
      "CCC2(CC1)": 1124,
      "C(NC(=O)": 1125,
      "(CC(=O)N": 1126,
      "s2)CC1": 1127,
      "n(-c3ccccc3)": 1128,
      "CCC(C(N)=O)": 1129,
      "CCn1cc(": 1130,
      "cn3": 1131,
      "Cc1ccccc1)": 1132,
      "CC1CCCO1)": 1133,
      "CCCO1": 1134,
      "Cc1cccc(-": 1135,
      "OC(C)C(=O)N": 1136,
      "CN(C(=O)N": 1137,
      "Cn1cc(C(=O)N": 1138,
      "c3ncn": 1139,
      "cccc1": 1140,
      "nc21": 1141,
      "c1ccccc1C(=O)N": 1142,
      "oc1C": 1143,
      "CCN(S(=O)(=O)": 1144,
      "(N)=O)cc1": 1145,
      "-n1": 1146,
      "nc2-": 1147,
      "COc1ccc2c(c1)": 1148,
      "SCC(=O)N": 1149,
      "n2n1": 1150,
      "c2nnc3": 1151,
      "CC(Sc1n": 1152,
      "CCNC(=O)N1": 1153,
      "C(c1ccccc1)": 1154,
      "CC(=O)Nc1n": 1155,
      "c3ccc(Cl)cc3)": 1156,
      "C(CO)": 1157,
      "CCc1onc(C)c1": 1158,
      "CC(C)CNC(=O)": 1159,
      "COc1ccc(S(=O)(=O)N": 1160,
      "c1cccc(NC(=O)": 1161,
      "c2ccc3c(c2)OCO3)": 1162,
      "c1ccc(NC(=O)c2cc": 1163,
      "c(F)c(F)": 1164,
      "CCOc1ccc(C": 1165,
      "c(=O)n(C": 1166,
      "OC)cc1": 1167,
      "Cn1cc(C": 1168,
      "c2nc3cc": 1169,
      "c2cccc(N)": 1170,
      "COCCN1": 1171,
      "CO)": 1172,
      "Cc1cccc2": 1173,
      "CNc1n": 1174,
      "FC(F)": 1175,
      "CCCCC2)cc1": 1176,
      "CC(OC(=O)": 1177,
      "c3c2": 1178,
      "COCC(C)": 1179,
      "c2ccccc2C)": 1180,
      "c2ccc(F)cc2)CC1": 1181,
      "NC(=O)CSc2n": 1182,
      "O=C(Cn1cc": 1183,
      "NC(=O)CNC(=O)": 1184,
      "Cc1cccs1": 1185,
      "C(C)=O)": 1186,
      "(C(=O)OC)": 1187,
      "COC(=O)C(C)": 1188,
      "cc2C1": 1189,
      "c(=O)n(CC(=O)N": 1190,
      "C(C(N)=O)": 1191,
      "c(SC": 1192,
      "S1": 1193,
      "c3cnccn3)": 1194,
      "O2": 1195,
      "c1sccc1": 1196,
      "CCCCn1": 1197,
      "nc2)cc1": 1198,
      "c2c(C)cc": 1199,
      "c1c(C)[nH]": 1200,
      "c3c(C)": 1201,
      "c(CCC(=O)N": 1202,
      "C(C)C)c1": 1203,
      "=O)N": 1204,
      "Cc1nc(-c2cc": 1205,
      "[nH]2)": 1206,
      "CCCCC2)c1": 1207,
      "Cc1ccc(Cl)cc1": 1208,
      "c1ccc(C#N)cc1": 1209,
      "c2cccc(C": 1210,
      "sc3)": 1211,
      "CC2)cn1": 1212,
      "OC(F)(F)F)": 1213,
      "NC(=O)NCc2cc": 1214,
      "CC(=O)N1CCCC1": 1215,
      "cs2)CC1": 1216,
      "cnn1-": 1217,
      "C#CCN1": 1218,
      "c3ccc4c(c3)": 1219,
      "no2)c1": 1220,
      "NCC2": 1221,
      "CCS(=O)(=O)N": 1222,
      "c2cccc(OC)": 1223,
      "C(=O)C1": 1224,
      "1CC1)": 1225,
      "CCC1)": 1226,
      "c1cc(Cl)ccc1": 1227,
      "ccc2c1": 1228,
      "Cc1ccsc1": 1229,
      "c2ccc(O": 1230,
      "C2CCO": 1231,
      "c1cnn2": 1232,
      "c2nc3c(": 1233,
      "nc2C)": 1234,
      "n2c(": 1235,
      "CCCC(C(=O)N": 1236,
      "CCCC3=O)": 1237,
      "O=C(NCC1": 1238,
      "c(Cl)cccc1": 1239,
      "Nc1": 1240,
      "C(=O)N1CCN(": 1241,
      "cccc3": 1242,
      "[nH]c2c1": 1243,
      "C(=O)Nc1n": 1244,
      "c2cc(N)": 1245,
      "C2=O)cc1": 1246,
      "Cc1noc(C": 1247,
      "Cc1ccnc(": 1248,
      "OCCO2)": 1249,
      "CCC(CO)": 1250,
      "c(F)c1)": 1251,
      "c2nc(-": 1252,
      "c1co": 1253,
      "c3cs": 1254,
      "c1cccc(C(F)(F)F)": 1255,
      "CC(CO)": 1256,
      "c(NC(=O)C2": 1257,
      "c(C)c1C": 1258,
      "c3no": 1259,
      "O=C1N": 1260,
      "c1cc2c(cc1": 1261,
      "Cc1nnc(": 1262,
      "c2c1C": 1263,
      "OCCCO": 1264,
      "Cc1n[nH]c(C)c1": 1265,
      "N#Cc1ccccc1": 1266,
      "c2noc(C": 1267,
      "C(=O)N1CCCC1": 1268,
      "c2ccccn2)c1": 1269,
      "c2nnnn2": 1270,
      "Nc1cc": 1271,
      "Cc1cc(NC(=O)": 1272,
      "3ccccc3": 1273,
      "(OC)": 1274,
      "C2CCCCC2)": 1275,
      "Cc2ccccc2)": 1276,
      "c3ccccc3Cl)": 1277,
      "CC(=O)Nc1cccc(": 1278,
      "N2CCCC2)": 1279,
      "sc3": 1280,
      "cc(OC)c1OC": 1281,
      "c2ccccn2)cc1": 1282,
      "COc1ccc(NC(=O)": 1283,
      "CC(C)(C": 1284,
      "CCC(=O)N2": 1285,
      "[nH]c1=O": 1286,
      "c2cc(OC)": 1287,
      "c2c(N)": 1288,
      "c3cccc(Cl)": 1289,
      "co2)c1": 1290,
      "Cc1nc2ccccc2": 1291,
      "c2cc3c(": 1292,
      "CCc1ccc(C": 1293,
      "c1ccc2c(c1)OCO2)": 1294,
      "CCCCC3": 1295,
      "Cc1cc(Cl)": 1296,
      "Cn1ncc2": 1297,
      "CC2CCCO2)": 1298,
      "CC(C#N)": 1299,
      "C(N": 1300,
      "Cc1ccc(C(C)": 1301,
      "Cc1ccc(F)": 1302,
      "c2ncc(C(=O)N": 1303,
      "CC1CN(": 1304,
      "C(=O)OC": 1305,
      "O=C(Nc1cc": 1306,
      "c1ccc(NC(=O)N": 1307,
      "COc1ncccc1": 1308,
      "c2)o1": 1309,
      "c2cccnc2": 1310,
      "c2ncccn2)": 1311,
      "cn1)N": 1312,
      "nn1)": 1313,
      "c2c1)": 1314,
      "Cc1cc(C)n(": 1315,
      "ccc2n1": 1316,
      "CC2CCCO": 1317,
      "c2c(s1)": 1318,
      "3CCC3)": 1319,
      "c3ncccc3": 1320,
      "CC#": 1321,
      "c1cc2c(": 1322,
      "c2)no1": 1323,
      "c(=O)n2C": 1324,
      "CCS(=O)(=O)": 1325,
      "CCC(C)(C)": 1326,
      "c2ccc(F)cc2)cc1": 1327,
      "cc2)C1": 1328,
      "c2ccc(N3": 1329,
      "CC(C)(O)": 1330,
      "c2cccc(C(=O)N": 1331,
      "c2cccc(C(F)(F)F)": 1332,
      "c2nccn2": 1333,
      "Cc1ncc(C": 1334,
      "csc1": 1335,
      "Cc1ccc(NC(=O)N": 1336,
      "cnc2s": 1337,
      "Cc2cn": 1338,
      "c1ccc(N": 1339,
      "CCN(CCO)": 1340,
      "Cc1nnc(C": 1341,
      "CCS(=O)(=O)N1": 1342,
      "c2)cs1": 1343,
      "(CCO)": 1344,
      "c3cc(F)ccc3": 1345,
      "C)C(=O)": 1346,
      "c1ccc(Br)": 1347,
      "C(C)=O": 1348,
      "c1cccc(Cl)c1)": 1349,
      "c(CNC(=O)N": 1350,
      "NC(=O)c1cccc(": 1351,
      "3)CC1": 1352,
      "CC(=O)N1CCC(": 1353,
      "O=C(Cc1cc": 1354,
      "c2c(c1": 1355,
      "(C(C)C)": 1356,
      "Cc1nc(": 1357,
      "C(=O)NC1": 1358,
      "(-c3ccccc3)": 1359,
      "c2F)": 1360,
      "CC2)C1": 1361,
      "c2cccc(Br)": 1362,
      "NC(=O)NC1": 1363,
      "nc2)c1": 1364,
      "O=C(c1cn": 1365,
      "c1cc(F)ccc1F": 1366,
      "C(=O)Nc1ccccc1": 1367,
      "CCCCO": 1368,
      "CN(CC": 1369,
      "c2c(F)cccc2F)": 1370,
      "c1C#N": 1371,
      "CNC(=O)C1": 1372,
      "Cc1cccc(NC(=O)": 1373,
      "c1ccc(F)cc1)N": 1374,
      "Cc3ccccc3": 1375,
      "c3ccc(C)": 1376,
      "C(C)O": 1377,
      "CCCNC(=O)c1cc": 1378,
      "c2ccc(F)cc2)c1": 1379,
      "Nc1ccccc1": 1380,
      "CC1O": 1381,
      "c2cc(Br)": 1382,
      "c3cccc(Cl)c3)": 1383,
      "c3nccs3)": 1384,
      "c1cccc(Br)c1": 1385,
      "Cc1cc(F)ccc1": 1386,
      "C3=O)": 1387,
      "CCn1nn": 1388,
      "C(CC)": 1389,
      "Cc1ccc(O": 1390,
      "c2nccs2)": 1391,
      "CN1CCO": 1392,
      "FC(F)(F)": 1393,
      "c(-c2ccco2)": 1394,
      "c3ccccc3)CC2)": 1395,
      "C=C(C)": 1396,
      "Cc1cc(C)n(-": 1397,
      "Cc2ccco2)": 1398,
      "c23)cc1": 1399,
      "2CCOCC2)cc1": 1400,
      "COc1ccc(C(C)": 1401,
      "c2ccc(Cl)cc2": 1402,
      "ccc12)": 1403,
      "C2CCC": 1404,
      "c(=O)[nH]1)": 1405,
      "n3ccnc3)": 1406,
      "c(N(C)C)": 1407,
      "c2C#N)": 1408,
      "CCCC(C)": 1409,
      "C1CCCC1)": 1410,
      "CC(F)(F)F": 1411,
      "CC1CN(C": 1412,
      "Cc1csc(C": 1413,
      "CCCS": 1414,
      "cnc2c1": 1415,
      "N2CCCC2=O)cc1": 1416,
      "C(c2ccccc2)": 1417,
      "cnn1C": 1418,
      "c4ccccc43)": 1419,
      "O=C(COC(=O)": 1420,
      "2CCOCC2": 1421,
      "c2cc(C)ccc2": 1422,
      "c1ccc(NC(=O)C2": 1423,
      "CC1CCCCC1": 1424,
      "c1cc(=O)": 1425,
      "c1cc(OC)": 1426,
      "c1ccccc1)C(=O)N": 1427,
      "OC(F)F": 1428,
      "c2c(C)nn(C)": 1429,
      "nc2ccccc12": 1430,
      "c3cco": 1431,
      "NC(=O)c1ccccc1": 1432,
      "CC(CC(C": 1433,
      "c2cc(NC(=O)": 1434,
      "CCCC(C": 1435,
      "Cc1nc(C(=O)N": 1436,
      "CN1CCN(": 1437,
      "co1)": 1438,
      "O=C(CS": 1439,
      "cn12": 1440,
      "c2ncccn2)CC1": 1441,
      "c1cnn(C": 1442,
      "c(-c4cc": 1443,
      "cc2s1": 1444,
      "c1ccc(F)cc1F)": 1445,
      "c2ccccc2O": 1446,
      "c2ccccc2F)CC1": 1447,
      "c(=O)c1": 1448,
      "c1cccc(NC(=O)N": 1449,
      "NC1=O": 1450,
      "c2ccc(C(F)(F)F)": 1451,
      "c2c(Cl)cc": 1452,
      "c1cc(N)": 1453,
      "N(C)C": 1454,
      "C1CCCO1": 1455,
      "c2ccc(F)cc2)n1": 1456,
      "CC2CCC1": 1457,
      "c3cnn(C)": 1458,
      "Cc1ncsc1": 1459,
      "2(=O)": 1460,
      "C2)C1": 1461,
      "CCNC(=O)C1": 1462,
      "c2ncnc(N": 1463,
      "C2CC2)CC1": 1464,
      "N#Cc1": 1465,
      "C)n1": 1466,
      "2CCCCC2)": 1467,
      "on1)": 1468,
      "c3ccccn2": 1469,
      "C2)cn1": 1470,
      "COc1n": 1471,
      "c2ccc(C)cc2)": 1472,
      "CCC)": 1473,
      "nnc1-": 1474,
      "=C": 1475,
      "NC(=O)C1CCN(C(=O)": 1476,
      "c1cc2cc": 1477,
      "C(N)=O)cc1": 1478,
      "CC2=O)cc1": 1479,
      "c1ccc(OC)cc1": 1480,
      "c2nc(C3CC3)": 1481,
      "OCO4)": 1482,
      "c1cnn(C)c1": 1483,
      "c3ccc(C)cc": 1484,
      "Cc1nnc2n1": 1485,
      "n4)": 1486,
      "oc1)": 1487,
      "COc1ccc(CC(=O)N": 1488,
      "Cc1cc(Br)": 1489,
      "oc2c1": 1490,
      "O=C(NC1CC1)": 1491,
      "C(F)F)": 1492,
      "CCC(C)NC(=O)": 1493,
      "CN(CC)": 1494,
      "Cc1nccn1": 1495,
      "C(=O)NC(C)": 1496,
      "Cc1ccc(-c2n": 1497,
      "COCCN(C": 1498,
      "n3cnnn3)": 1499,
      "CCC(C)C)": 1500,
      "CC(=O)NC1": 1501,
      "S1(=O)": 1502,
      "c1nc(-": 1503,
      "nn2)c1": 1504,
      "n2)s1": 1505,
      "ccn1)": 1506,
      "CC1CCCN(C(=O)": 1507,
      "n2cncn2)": 1508,
      "CCn1cc(C(=O)N": 1509,
      "n2nnnc2": 1510,
      "COC1": 1511,
      "[nH]c3": 1512,
      "CCOc1ccc(-": 1513,
      "c1ccc2c(c1)CO": 1514,
      "c1cccc(NC(=O)c2cc": 1515,
      "c2nc(-c3ccccc3)": 1516,
      "c(-c2ccncc2)": 1517,
      "2CCC3": 1518,
      "COc1ccc(NC(=O)N": 1519,
      "c1csc(-": 1520,
      "CCCc2ccccc21": 1521,
      "c2ccccc2F)c1": 1522,
      "ccc1N": 1523,
      "CCOC(=O)C1": 1524,
      "#N)cc1": 1525,
      "c1scnc1": 1526,
      "N2CCCC2=O)": 1527,
      "nc2ccccn12": 1528,
      "c2cc(C)o": 1529,
      "OC(C": 1530,
      "c1cccc(O": 1531,
      "c1cccc(C#N)c1": 1532,
      "Cn1nc(C": 1533,
      "c1ccc(CN": 1534,
      "O=C(Cn1cn": 1535,
      "CO1": 1536,
      "N(C)S(=O)(=O)": 1537,
      "NC(C)=O)cc1": 1538,
      "CCc1noc(CC)": 1539,
      "CCCN2": 1540,
      "NC(=O)C(C)O": 1541,
      "c1ccsc1)": 1542,
      "c(C(=O)N(C)": 1543,
      "cnc2n1": 1544,
      "CC(=O)NC(C)": 1545,
      "NC(=O)Cn2": 1546,
      "CCC(F)(F)F)": 1547,
      "c2ccc(C(N)=O)": 1548,
      "COc1ccccc1O": 1549,
      "CCO2": 1550,
      "c2c[nH]c3ccccc23)": 1551,
      "CC2)CC1": 1552,
      "c2n(n1)": 1553,
      "3CCCO3)": 1554,
      "c3ccc(Cl)": 1555,
      "COC(=O)c1ccc(": 1556,
      "C3CCCC3)": 1557,
      "CC(C)(C)OC(=O)N1": 1558,
      "nc2s1": 1559,
      "ccc2N1": 1560,
      "c1cnccn1": 1561,
      "OC(C)(C)C": 1562,
      "nc2n": 1563,
      "c(Br)c1": 1564,
      "C2CCN(": 1565,
      "c2cccc(O)": 1566,
      "C(C)N": 1567,
      "(Br)": 1568,
      "c1cnn(": 1569,
      "CN1CC": 1570,
      "N1CCCC(": 1571,
      "Cc1nnc(S": 1572,
      "C2)s1": 1573,
      "CCc1": 1574,
      "COc1ccc(C2": 1575,
      "c1nnc(-": 1576,
      "CC(C)C(": 1577,
      "CC(=O)N1CCN(C(=O)": 1578,
      "c2nnc3n2": 1579,
      "CCOc1ncccc1": 1580,
      "S(=O)(=O)N(C)C)": 1581,
      "O=C(Nc1ccccc1": 1582,
      "c(C)n3)": 1583,
      "CCN1CCOCC1": 1584,
      "c2cn(C)": 1585,
      "c3c(F)cc": 1586,
      "c2-": 1587,
      "CCC4)": 1588,
      "CC2)s1": 1589,
      "c1cc(F)cc(F)": 1590,
      "c(-c2cccnc2)": 1591,
      "c1ccccc1N": 1592,
      "c2ccccc2-": 1593,
      "c2ccccc2C#N)": 1594,
      "nc2cc": 1595,
      "c2ccccc2n": 1596,
      "cc2)s1": 1597,
      "c1nnc(C": 1598,
      "CCCC4)": 1599,
      "Cc1cc(C(=O)": 1600,
      "c1c(F)cccc1F": 1601,
      "c3o": 1602,
      "Cn1nccc1": 1603,
      "NC(=O)Cn2cc": 1604,
      "c2N)cc1": 1605,
      "O=C(NCc1ccccc1": 1606,
      "N#Cc1cccc(": 1607,
      "n(C(C)C)": 1608,
      "n12)": 1609,
      "CCC(O": 1610,
      "CCN3": 1611,
      "CC(F)F)": 1612,
      "CCC(NC(=O)": 1613,
      "c1cn[nH]c1": 1614,
      "CC(=O)N1CCN(": 1615,
      "cnn2": 1616,
      "nnc1S": 1617,
      "Cc1ccccn1": 1618,
      "c3ccccc3C)": 1619,
      "C(=O)N2": 1620,
      "n(C)c1=O": 1621,
      "CCC#N)C(=O)": 1622,
      "CCn1cnnc1": 1623,
      "C1CCC1": 1624,
      "cnc23)": 1625,
      "2NCC": 1626,
      "C2CCCCC2": 1627,
      "COC(=O)c1ccc(C": 1628,
      "Cc1cnn(": 1629,
      "cn4)": 1630,
      "c2nc3ccccc3[nH]": 1631,
      "cc1F": 1632,
      "c2scnc2": 1633,
      "Cn1n": 1634,
      "c2ccc3ccccc3": 1635,
      "c(C(=O)O": 1636,
      "c2ccc3c(c2)OCCO3)": 1637,
      "c(N)n1": 1638,
      "c2cc[nH]": 1639,
      "NC(=O)COC(=O)": 1640,
      "2CCCC2)cc1": 1641,
      "c3sccc3": 1642,
      "ccn2": 1643,
      "c2nc[nH]": 1644,
      "c1ccc(O)cc1": 1645,
      "O=S(=O)(C": 1646,
      "C1CCCN1C(=O)": 1647,
      "c3cccc(C)": 1648,
      "CCc1nnc(": 1649,
      "noc1C": 1650,
      "c1cccc(C(F)(F)F)c1": 1651,
      "Cc1noc(C2": 1652,
      "cc(Cl)c1": 1653,
      "C(=O)N1CCN(C(=O)": 1654,
      "c1ccc(O)cc1)": 1655,
      "[nH]c1=O)": 1656,
      "CCC2)c1": 1657,
      "[nH]3)": 1658,
      "cc2)cn1": 1659,
      "NC(=O)c2cc(C)": 1660,
      "c2nncn2": 1661,
      "c1cn(C)": 1662,
      "cccc2": 1663,
      "c(O)c1": 1664,
      "COCc1ccccc1": 1665,
      "c1cc(C(F)(F)F)": 1666,
      "OCCCO2": 1667,
      "COc1ccc(-c2n": 1668,
      "c1ccc(C(F)(F)F)cc1": 1669,
      "3c(": 1670,
      "c1cccc(-n2cn": 1671,
      "ccc2F)": 1672,
      "N2CC(C(=O)N": 1673,
      "2CCCC(": 1674,
      "c1cc(-c2ccccc2)": 1675,
      "c3nc4ccccc4": 1676,
      "Cc2ccncc2)": 1677,
      "(Cc2ccccc2)": 1678,
      "Cc1nnc(-": 1679,
      "Cc1ccc(OCC(=O)N": 1680,
      "CCN1CCN(C(=O)": 1681,
      "N#Cc1ccc(C": 1682,
      "sc2n1": 1683,
      "c3nnnn3": 1684,
      "c1ccc(C(C)": 1685,
      "CCC1CC": 1686,
      "CCOC)": 1687,
      "Cc1cc(N)": 1688,
      "C2)CC1": 1689,
      "c1nc(C)": 1690,
      "c1nccs1)": 1691,
      "c(CCNC(=O)": 1692,
      "3CCO": 1693,
      "c(CNC(=O)": 1694,
      "c1ccc(F)c(F)c1)": 1695,
      "CC1=": 1696,
      "c2cc(F)ccc2F)": 1697,
      "CC2)no1": 1698,
      "Cc2ccc(C)": 1699,
      "cn[nH]": 1700,
      "cc2)no1": 1701,
      "C(=O)N1CCCCC1": 1702,
      "c2csc(C)": 1703,
      "c2ccccc2)s1": 1704,
      "cc(N)": 1705,
      "CCCOC(=O)": 1706,
      "CCOC(=O)C1=": 1707,
      "S(N)(=O)=O)cc1": 1708,
      "cc(OC)": 1709,
      "C2C1": 1710,
      "Cc1c(C)": 1711,
      "N1CCOCC1)": 1712,
      "c1cccc(C(=O)": 1713,
      "COCC(=O)N": 1714,
      "Cc1ncn": 1715,
      "S(=O)(=O)c1ccccc1": 1716,
      "Cc1cccc(O": 1717,
      "c2ccccc2OC)": 1718,
      "CC(C)C1": 1719,
      "S(C)(=O)=O)c1": 1720,
      "c2cccs2)CC1": 1721,
      "ncc(C(=O)N": 1722,
      "CC(C)(C)OC(=O)N": 1723,
      "NC2": 1724,
      "Cc1nc(C2": 1725,
      "CCC(NC(=O)N": 1726,
      "C2)no1": 1727,
      "c2noc(-c3cc": 1728,
      "c4ncc": 1729,
      "CC3CCCO3)": 1730,
      "C1NCC": 1731,
      "N(CCO)": 1732,
      "(NC(=O)": 1733,
      "(Cl)ccc3": 1734,
      "COc1cc2c(cc1": 1735,
      "c2ccccc2c1=O)": 1736,
      "cc2cc": 1737,
      "c3ccsc3)": 1738,
      "c1cccc2ccccc12": 1739,
      "cc2c(": 1740,
      "CCc1cccc(": 1741,
      "c2ccccc2O1": 1742,
      "CNC(=O)c1cccc(": 1743,
      "c3cnn(C)c3)": 1744,
      "Cc1cc(NC(=O)N": 1745,
      "C(C)NC(=O)": 1746,
      "Cc1ccccc1F": 1747,
      "c2ccc3[nH]": 1748,
      "C=CC": 1749,
      "C)CC1": 1750,
      "C#Cc1cccc(": 1751,
      "-n1cnnn1": 1752,
      "Cc2ccc3c(c2)": 1753,
      "O=C(NCc1cccc": 1754,
      "COC(=O)C(": 1755,
      "c(C2CCCO2)": 1756,
      "COCCn1": 1757,
      "c2nc(N)": 1758,
      "CC)c1": 1759,
      "N=": 1760,
      "CN(C)c1n": 1761,
      "c2)c1C": 1762,
      "c1ccc(-n2ccnn2)cc1": 1763,
      "c(=": 1764,
      "C1CCOCC1": 1765,
      "c2co": 1766,
      "CCc1ccc(C(=O)N": 1767,
      "COc1ccnc(": 1768,
      "Cn1nc(C(=O)N": 1769,
      "Cc1ccc(NC(=O)c2cc": 1770,
      "c2c3c(": 1771,
      "Cc1ccc(S(=O)(=O)": 1772,
      "n2)cn1": 1773,
      "c1cc(C#N)": 1774,
      "c1)c1ccccc1": 1775,
      "2CCCN2C(=O)": 1776,
      "CN2": 1777,
      "COC(=O)c1cccc(": 1778,
      "CCOC(=O)c1cn": 1779,
      "O=C(NCC(O)": 1780,
      "c1ccc2c(c1)CCC2": 1781,
      "c1cc(S(=O)(=O)N": 1782,
      "o2)CC1": 1783,
      "c1ccc(C#N)cc1)": 1784,
      "CCOC1)": 1785,
      "c2ccccc2F)cc1": 1786,
      "c[nH]1)": 1787,
      "Cc1cnc(C(=O)N": 1788,
      "c1c[nH]c2ccccc12)": 1789,
      "CCCC1CN(C(=O)": 1790,
      "n[nH]2)": 1791,
      "COCC1": 1792,
      "CC1CCCCN1C(=O)": 1793,
      "2CCCN(C(=O)": 1794,
      "(CCC#N)": 1795,
      "c2cc3c(cc2": 1796,
      "CCOC(=O)c1n": 1797,
      "co2)CC1": 1798,
      "n2c(=O)": 1799,
      "C(=O)N1CCN(C": 1800,
      "c1ccc(N2": 1801,
      "N1CCCCCC1": 1802,
      "c2ccccc2)o1": 1803,
      "c2ccc(OC)cc2)": 1804,
      "CCC(=O)N(C)": 1805,
      "c2c1=O": 1806,
      "c1ccc(-c2cs": 1807,
      "c3nc(-": 1808,
      "C#CCNC(=O)": 1809,
      "Cc1ccc(-n2cc": 1810,
      "O=C(CCc1n": 1811,
      "c1ccc2ccccc2c1": 1812,
      "3)C1)": 1813,
      "C(=O)NCC": 1814,
      "c2nnc(": 1815,
      "c2cnn(": 1816,
      "c2ccnn2": 1817,
      "n(C)c(=O)": 1818,
      "c2c(C)noc2C)": 1819,
      "c(N3": 1820,
      "2CCC(C)": 1821,
      "c1cccc(C)": 1822,
      "c(Cl)c1)": 1823,
      "Cc1ccc(CC(=O)N": 1824,
      "O=C(CNC(=O)": 1825,
      "OC1": 1826,
      "nc(C(F)(F)F)": 1827,
      "Cc1cc(C)n2": 1828,
      "c2ccc(NC(=O)C": 1829,
      "C(=O)N(C)C": 1830,
      "COc1ccc(C(O)": 1831,
      "c1ccc2c(c1)OCCO2)": 1832,
      "c2ccc(S(=O)(=O)N": 1833,
      "CC(C)N(C(=O)": 1834,
      "CCc1c(C)": 1835,
      "c2N)": 1836,
      "O=C(CCNC(=O)": 1837,
      "c1cc(=O)[nH]": 1838,
      "c2ncccc2c1": 1839,
      "c2ccc[nH]": 1840,
      "c2ccc(C)c(C)": 1841,
      "c3=O)": 1842,
      "c(C3CC3)": 1843,
      "c1cn2cc": 1844,
      "Cc1nc(N": 1845,
      "cc23)": 1846,
      "c1nnc(": 1847,
      "c2cccc3ccccc23)": 1848,
      "c1ccc(OC": 1849,
      "c2ccccc2Br)": 1850,
      "c3c(F)cccc3": 1851,
      "CC(NS(=O)(=O)": 1852,
      "Cc2ccccc2C1": 1853,
      "Cn1cccc1": 1854,
      "CCCNC(=O)C1": 1855,
      "nnc3": 1856,
      "c3ccc(C#N)": 1857,
      "CCN1CCOCC1)": 1858,
      "Cc1nn": 1859,
      "CCCCC2)CC1": 1860,
      "c2ccc(F)cc2)C1": 1861,
      "2CCOCC2)c1": 1862,
      "NC(=O)Cn1": 1863,
      "cc2)cs1": 1864,
      "Cc1ccc(N2": 1865,
      "c2)cc1OC": 1866,
      "CCO2)n1": 1867,
      "CCOC(=O)N": 1868,
      "c3nc(C": 1869,
      "c2cccs2)cc1": 1870,
      "cccc21": 1871,
      "Cn1ccnc1": 1872,
      "CCc2ccccc2)": 1873,
      "Cc1ccoc1": 1874,
      "ccc2o1": 1875,
      "CC(=O)OC)": 1876,
      "O=C1CO": 1877,
      "c2cnn(-": 1878,
      "c2ccc(F)c(F)c2)": 1879,
      "n1N": 1880,
      "CN1CCOCC1": 1881,
      "CC(N)=O": 1882,
      "cnc12)": 1883,
      "Cc2ccc(Cl)": 1884,
      "cc(Br)c1": 1885,
      "sc2": 1886,
      "cc2)o1": 1887,
      "C=CCN(": 1888,
      "CC3CC3)": 1889,
      "CCc1cc(": 1890,
      "CC2CC2)": 1891,
      "COc1cc(-": 1892,
      "COc1ccccc1-": 1893,
      "n2nc(-": 1894,
      "nc(C2": 1895,
      "CCc1ccccc1)": 1896,
      "c2ccc(S(C)(=O)=O)": 1897,
      "COc3ccccc3": 1898,
      "CCc1nc(C": 1899,
      "CNC(=O)C": 1900,
      "nc(SC": 1901,
      "c(Cl)c2)": 1902,
      "on3)": 1903,
      "C2CCCC2)cc1": 1904,
      "c1c(F)cccc1F)": 1905,
      "c3ccc(C)cc3)": 1906,
      "n2c(C)": 1907,
      "c2nnc3ccccn2": 1908,
      "Cn2cc": 1909,
      "cnc4)": 1910,
      "c(-c2ccccc2)n1": 1911,
      "c1-": 1912,
      "CC(C)OC(=O)": 1913,
      "cc2C)cc1": 1914,
      "ncnc21": 1915,
      "c2cccs2)c1": 1916,
      "(CC2)": 1917,
      "[nH]c2=O)": 1918,
      "COc1ccc(F)": 1919,
      "c1noc(C": 1920,
      "CCN(C(C)=O)": 1921,
      "c2ccccc2O)": 1922,
      "cc1OC": 1923,
      "CC(=O)Nc1ccccc1": 1924,
      "CC(=O)Nc1cc(": 1925,
      "C1CC(=O)N(": 1926,
      "c2ccc(S(N)(=O)=O)": 1927,
      "O2)": 1928,
      "CC(c1ccccc1)": 1929,
      "OCCO4)": 1930,
      "Cc1cc(NC(=O)c2cc": 1931,
      "COc1ccc(NC(=O)c2cc": 1932,
      "CCOc1cccc(": 1933,
      "CC(C)NC(=O)N": 1934,
      "c1ncc(C(=O)N": 1935,
      "nn1-": 1936,
      "c2Cl)": 1937,
      "CC1(C(=O)N": 1938,
      "CC1CCN(": 1939,
      "c1cccc2ncc": 1940,
      "c3ccoc3)": 1941,
      "Cc1cc(=O)[nH]": 1942,
      "Nc1ccc2c(c1)": 1943,
      "CC1CCC(": 1944,
      "cc2c(n1)": 1945,
      "c2n(c1=O)": 1946,
      "c34)": 1947,
      "nnc2": 1948,
      "c1nc(C": 1949,
      "c2cccc(C(N)=O)": 1950,
      "c1nc2ccccc2[nH]1": 1951,
      "cc(C)c1": 1952,
      "ccc1=O)": 1953,
      "c(C(=O)OC)": 1954,
      "CCn2cc": 1955,
      "ccc2=O)": 1956,
      "COC(=O)C1(": 1957,
      "NC(C)=O": 1958,
      "c2cccnc2)cc1": 1959,
      "c1cc(C2CC2)": 1960,
      "Cc1nc(C)c(C(=O)N": 1961,
      "c1ccc(Cl)c(Cl)c1": 1962,
      "N1CC(C(=O)N": 1963,
      "c1c[nH]c2ccccc12": 1964,
      "c1ccc(S": 1965,
      "CCCn1cn": 1966,
      "no2)C1": 1967,
      "ccc1NC(=O)": 1968,
      "N1CC2": 1969,
      "c1ccco1)N": 1970,
      "c2cccc(F)c2)c1": 1971,
      "c3cccc4": 1972,
      "c1cccs1)N": 1973,
      "CCOC(C)": 1974,
      "C(=O)N1CCOCC1": 1975,
      "OC(F)F)cc1": 1976,
      "4CCO": 1977,
      "n[nH]2)cc1": 1978,
      "c(=O)[nH]c1=O": 1979,
      "CCC(O)CC1": 1980,
      "c2nc(-c3ccncc3)": 1981,
      "COC(=O)c1": 1982,
      "(C)C(C)": 1983,
      "NC(=O)c1cc2": 1984,
      "c1ccc2o": 1985,
      "c2nnc(C)": 1986,
      "C3CCCCC3)": 1987,
      "c2cnn(C)c2)": 1988,
      "c2n(n1)CCCC2": 1989,
      "c1ccoc1": 1990,
      "CCC(N)=O)": 1991,
      "C1CCCN(": 1992,
      "CCCCNC(=O)": 1993,
      "Cc1cccc(F)": 1994,
      "N2CCOCC2)cc1": 1995,
      "n[nH]1)": 1996,
      "c2cc(F)ccc21": 1997,
      "c2ccco2)CC1": 1998,
      "c1ccccc1C": 1999,
      "c3cc4": 2000,
      "c(-c2ccccn2)": 2001,
      "COc1ccc(O": 2002,
      "c2C)n1": 2003,
      "Cc1nn(": 2004,
      "c(OCC(=O)N": 2005,
      "c1ccc(N)cc1": 2006,
      "CCCO1)": 2007,
      "CC(NC(=O)C1": 2008,
      "nn(C": 2009,
      "CC(CC(C3)C1)": 2010,
      "Cc2cccn": 2011,
      "Cc2cccs2)": 2012,
      "c1nc2ccccc2s1": 2013,
      "2CC3CC(CC(C3)C1)": 2014,
      "c3ccc4c(c3)OCO4)": 2015,
      "COCCCNC(=O)": 2016,
      "CC1C(=O)N": 2017,
      "Cn1nc(-": 2018,
      "CCOC(=O)c1s": 2019,
      "c(F)cc3)": 2020,
      "CCN2CCOCC2)": 2021,
      "c3ccc(Cl)cc3": 2022,
      "[nH]n1)": 2023,
      "oc1=O": 2024,
      "C2=O)c1": 2025,
      "c2ccsc2)": 2026,
      "Cc1ccccc1O": 2027,
      "c1nccnc1": 2028,
      "O=C1CC": 2029,
      "c2ncnn2": 2030,
      "Cc1cc(C)n(C": 2031,
      "c(-c2ccc3c(c2)": 2032,
      "(CNC(=O)": 2033,
      "c2cnn(-c3ccccc3)": 2034,
      "n1nn": 2035,
      "=C(": 2036,
      "c(=O)n3": 2037,
      "CC(C)(C)C(=O)N": 2038,
      "CO2": 2039,
      "C2=O": 2040,
      "ccc2Cl)": 2041,
      "c(=O)[nH]2)": 2042,
      "C2)o1": 2043,
      "Cc1nc2ccccc2n1": 2044,
      "CC(S": 2045,
      "n3nc(C)": 2046,
      "Cc1nn(-c2ccccc2)": 2047,
      "S(N)(=O)=O": 2048,
      "O=C(CN": 2049,
      "c3ccc(O)": 2050,
      "c1scnc1C1CC1": 2051,
      "n(C)c1": 2052,
      "c2cc(=O)": 2053,
      "c2c(C)cc(C)": 2054,
      "n2)cc1OC": 2055,
      "CN(CC)C(=O)": 2056,
      "COc1ccc(CN": 2057,
      "N2CCN(C": 2058,
      "n2cccn2)c1": 2059,
      "c2cccc3c2": 2060,
      "COc1cccc2c1": 2061,
      "c2ccc(Br)cc2)": 2062,
      "c1ccc(C(N)=O)cc1": 2063,
      "OC(=O)C": 2064,
      "o2)n1": 2065,
      "c2nc3ccccc3s2)": 2066,
      "NS(C)(=O)=O)": 2067,
      "CCC(C)n1": 2068,
      "NC(=O)CCC(=O)": 2069,
      "CCO2)": 2070,
      "c1ccc(F)c(C(=O)N": 2071,
      "cn2)cc1)": 2072,
      "c1ccnc(": 2073,
      "c3n[nH]": 2074,
      "[nH]n3)": 2075,
      "COc1cc(Cl)": 2076,
      "COc1ccccc1CNC(=O)": 2077,
