{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 128,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 128
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": "(\\[[^\\]]+]|<|Br?|Cl?|N|O|S|P|F|I|b|c|n|o|s|p|\\(|\\)|\\.|=|#|-|\\+|\\\\\\\\|\\/|:|~|@|\\?|>|\\*|\\$|\\%[0-9]{2}|[0-9])"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<bos>": 1,
      "<eos>": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "(": 6,
      ")": 7,
      "*": 8,
      "+": 9,
      "-": 10,
      ".": 11,
      "/": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "6": 19,
      "7": 20,
      "8": 21,
      "9": 22,
      ":": 23,
      "<": 24,
      "=": 25,
      ">": 26,
      "?": 27,
      "@": 28,
      "B": 29,
      "C": 30,
      "F": 31,
      "H": 32,
      "I": 33,
      "N": 34,
      "O": 35,
      "P": 36,
      "S": 37,
      "[": 38,
      "\\": 39,
      "]": 40,
      "b": 41,
      "c": 42,
      "l": 43,
      "n": 44,
      "o": 45,
      "p": 46,
      "r": 47,
      "s": 48,
      "~": 49,
      "cc": 50,
      "CC": 51,
      "c1": 52,
      "C(": 53,
      "O)": 54,
      "c2": 55,
      "=O)": 56,
      "c1cc": 57,
      "c(": 58,
      "C(=O)": 59,
      "C)": 60,
      "c2cc": 61,
      "c1cccc": 62,
      "2)": 63,
      "O=": 64,
      "cn": 65,
      "1CC": 66,
      "O=C(": 67,
      "(=O)": 68,
      "c3": 69,
      "c1ccccc1": 70,
      "c1ccc(": 71,
      "cc1": 72,
      "n1": 73,
      "NC(=O)": 74,
      "(C)": 75,
      "CO": 76,
      "c2cccc": 77,
      "F)": 78,
      "H]": 79,
      "[n": 80,
      "[nH]": 81,
      "NC": 82,
      "c1n": 83,
      "CN": 84,
      "2CC": 85,
      "c2ccccc2": 86,
      "CC1": 87,
      "C(=O)N": 88,
      "C1": 89,
      ")N": 90,
      "3)": 91,
      "(C": 92,
      "c3cc": 93,
      "c2n": 94,
      "C(C)": 95,
      "(=O)N": 96,
      "O=C(N": 97,
      "2)cc1": 98,
      "N)": 99,
      "cs": 100,
      "S(=O)": 101,
      "CCO": 102,
      "c(C)": 103,
      "C1CC": 104,
      "n2": 105,
      "c2)": 106,
      "CCC": 107,
      "l)": 108,
      "c(-": 109,
      "N(": 110,
      "c1cn": 111,
      "c(C": 112,
      "c2ccccc2)": 113,
      "1)": 114,
      "CC(=O)N": 115,
      "(F)": 116,
      "c1)": 117,
      "c3cccc": 118,
      ")N1CC": 119,
      "c1ccccc1)": 120,
      "CC(C)": 121,
      "c1cccc(": 122,
      "c1cc(": 123,
      "nn": 124,
      "2)c1": 125,
      "O=C(C": 126,
      "c(=O)": 127,
      "O=C(NC": 128,
      "CC(": 129,
      "Cc1n": 130,
      "cc2": 131,
      "CCN": 132,
      "c2c(": 133,
      "c3ccccc3": 134,
      "c2ccc(": 135,
      "c1ccc(-": 136,
      "co": 137,
      "NC(=O)N": 138,
      "cc(": 139,
      "CN(": 140,
      "S(=O)(=O)": 141,
      "CCC1": 142,
      "Cc1ccc(": 143,
      "ccc1": 144,
      "=O": 145,
      "OCC": 146,
      "OC": 147,
      "ccc2": 148,
      "NC(=O)C": 149,
      "c1ccn": 150,
      "COc1ccc(": 151,
      "cn1": 152,
      "OC)": 153,
      "c[nH]": 154,
      "#N)": 155,
      "2)n": 156,
      "o1": 157,
      "c1nn": 158,
      "c1ccc2c(": 159,
      "COC(=O)": 160,
      "CCCC": 161,
      "s1": 162,
      "C(=O)NC": 163,
      "c4": 164,
      "cccn": 165,
      "2)CC1": 166,
      "CC1CC": 167,
      "c2cn": 168,
      "c1ccc2c(c1)": 169,
      "cs1": 170,
      "c1ccc(C": 171,
      "Cc1cc": 172,
      "(-": 173,
      "c2c1": 174,
      "N(C(=O)": 175,
      "3)n": 176,
      "Cn1": 177,
      "2)n1": 178,
      "S(=O)(=O)N": 179,
      "Br": 180,
      "C(F)": 181,
      "N2CC": 182,
      "[nH]1": 183,
      "(Cl)": 184,
      "ncc": 185,
      "C2": 186,
      "3CC": 187,
      "c(F)": 188,
      "CC2": 189,
      "(F)F)": 190,
      "c(Cl)": 191,
      "cnc1": 192,
      "c1ccccc1)N": 193,
      "CC(=O)": 194,
      "(C)C)": 195,
      "CCn1": 196,
      "ccn": 197,
      "c2nn": 198,
      "Br)": 199,
      "n1)": 200,
      "OCC1": 201,
      "c3ccccc3)": 202,
      "C(N)": 203,
      "O=S(=O)": 204,
      "c3)": 205,
      "C(C)C)": 206,
      "c1cs": 207,
      "CN(C)": 208,
      "c3n": 209,
      "c2ccccc21": 210,
      "Cc1cc(": 211,
      "F)cc1": 212,
      "CNC(=O)": 213,
      "C(=O)N2CC": 214,
      "NC1CC": 215,
      "CCNC(=O)": 216,
      "c1ccccc1)N1CC": 217,
      "c1ncc": 218,
      "2)C1": 219,
      "c12": 220,
      "CN(C(=O)": 221,
      "c2ccc(F)": 222,
      "O=S(=O)(": 223,
      "C(=O)N1CC": 224,
      "C1CC1": 225,
      "C2CC": 226,
      "c(C)c1": 227,
      "O=C(Nc1ccccc1)": 228,
      "N1CC": 229,
      "[nH]c1": 230,
      "n3": 231,
      "CN1CC": 232,
      "4)": 233,
      "c2cc(": 234,
      "c1ccc(-n2": 235,
      "Cl)": 236,
      "c1ccco": 237,
      "c3c(": 238,
      "n(C)": 239,
      "c1ccncc1": 240,
      "c1cc2": 241,
      "C(F)(F)F)": 242,
      "nc(": 243,
      "O=C(NCC": 244,
      "nc1": 245,
      "c(-c2cc": 246,
      "CN2CC": 247,
      "Cl": 248,
      "c1cccnc1": 249,
      "cccc": 250,
      "c2ncc": 251,
      "(CC": 252,
      "N#": 253,
      "C(N)=O)": 254,
      "O=C1": 255,
      "Cc1ccccc1": 256,
      "O=C(CC": 257,
      "CCOC(=O)": 258,
      "Cc1": 259,
      "NCC": 260,
      "c2[nH]": 261,
      "CN(C": 262,
      "c(C)n": 263,
      "O=C(Cn1": 264,
      "c1cccs1": 265,
      "CN1": 266,
      "c2)cc1": 267,
      "O=c1": 268,
      ")Nc1ccccc1": 269,
      "CS": 270,
      "C=": 271,
      "Cc1cccc(": 272,
      "c1ccc(F)cc1": 273,
      "cc2)": 274,
      "sc1": 275,
      "O=C1CC": 276,
      "CC2)": 277,
      "c(C(=O)N": 278,
      "NC(=O)c2cc": 279,
      "CC)": 280,
      "(C)C": 281,
      "OCCO": 282,
      "CC(=O)N1CC": 283,
      "c1cccc2": 284,
      "OCO": 285,
      "c(-c3cc": 286,
      "cnc2": 287,
      "c(S": 288,
      "c2cccc(": 289,
      "CCC2": 290,
      "O=C(CO": 291,
      "c1ccccn1": 292,
      "c1=O": 293,
      "c(N": 294,
      "(=O)=O)": 295,
      "CC1)": 296,
      "n(-": 297,
      "c1cc(-": 298,
      "CC(C)(C)": 299,
      "c1ccc(Cl)": 300,
      "C(C)(C)C)": 301,
      "O=C(CS": 302,
      "N1": 303,
      "COc1ccccc1": 304,
      "CCN1": 305,
      "C)cc1": 306,
      "c1ccco1": 307,
      "c2)c1": 308,
      "n2)cc1": 309,
      "oc1": 310,
      "CCN(": 311,
      "C2)": 312,
      "c(N)": 313,
      "O=C(NC1CC": 314,
      "N(C": 315,
      "C(C": 316,
      "c2ncn": 317,
      "c2s": 318,
      "C(O)": 319,
      "2)nc1": 320,
      "c(=O)[nH]": 321,
      "s1)": 322,
      "c(NC(=O)": 323,
      "c3c(c2)": 324,
      "c(C2CC": 325,
      "COc1cccc(": 326,
      "Cc1cc(C)": 327,
      "C(C)=O)": 328,
      "3)cc1": 329,
      "C(=O)NCC": 330,
      "CC(O)": 331,
      "O=C(NCc1ccccc1)": 332,
      "cs1)": 333,
      "CCN1CC": 334,
      "(C#N)": 335,
      "n2)": 336,
      "CN(C)C(=O)": 337,
      "S(C)": 338,
      "c2cccn": 339,
      "c1cn[nH]c1": 340,
      "c(-c2ccccc2)": 341,
      "n2cn": 342,
      "c1c[nH]": 343,
      "ccccc2": 344,
      "O=c1[nH]": 345,
      "c2ccccc12": 346,
      "c(F)cc": 347,
      "c2ccccc2)cc1": 348,
      "c(C#N)": 349,
      "c1ccc(-c2n": 350,
      "Cc1no": 351,
      "CCC(=O)N": 352,
      "C(C)C": 353,
      "CCc1n": 354,
      "nc2": 355,
      "C#": 356,
      "n(": 357,
      "NCc1ccccc1": 358,
      "ccn1": 359,
      "c(C)cc": 360,
      "cc(-": 361,
      "c2=O)": 362,
      "NC1": 363,
      "c(Cl)cc": 364,
      "c2cs": 365,
      "CCOCC": 366,
      "NCC1": 367,
      "c2ccc3c(c2)": 368,
      "c1nc2ccccc2": 369,
      "c2ccccc2)CC1": 370,
      "nn1": 371,
      "NS(=O)(=O)": 372,
      "c1cccn": 373,
      "c(OC)": 374,
      "c1ccc(Cl)cc1": 375,
      "n3)": 376,
      "c3cn": 377,
      "on1": 378,
      "CC2)cc1": 379,
      "c1cccc(-": 380,
      "CCCn1": 381,
      "c1ccccc1)Nc1ccccc1": 382,
      "OCC(=O)N": 383,
      "c2ccco": 384,
      "1)c1ccccc1": 385,
      "c1ncn": 386,
      "OC(=O)": 387,
      "c[nH]1": 388,
      "NC(=O)NC": 389,
      "3CCCC": 390,
      "c2cccs": 391,
      "CCCC1": 392,
      "COc1cc": 393,
      "NC(=O)C2CC": 394,
      "CO1": 395,
      "c1ccccn1)": 396,
      "cc2c1": 397,
      "c(N2CC": 398,
      "CCC(C)": 399,
      "COc1cc(": 400,
      "no": 401,
      "(C2CC": 402,
      "C1)": 403,
      "[nH]n1": 404,
      "S(C)(=O)=O)": 405,
      "NC2": 406,
      "3CC3)": 407,
      "c1ccc2[nH]": 408,
      "c1s": 409,
      "c12)": 410,
      "c2C)": 411,
      "NC(=O)CC": 412,
      "c1C": 413,
      "c2ccc(F)cc": 414,
      "-c1ccccc1": 415,
      "c2)CC1": 416,
      "c1cccc(F)": 417,
      "CC(C": 418,
      "c1ccc(F)": 419,
      "CCC(": 420,
      "CCC1)": 421,
      "CCC2)": 422,
      "c1ccc2c(c1)OCO": 423,
      "Cc1cn": 424,
      "c4cccc": 425,
      "c1ccc(N2CC": 426,
      "CCC3)": 427,
      "CCCNC(=O)": 428,
      "2)no1": 429,
      "c1ccsc1": 430,
      "c2ccncc": 431,
      "c1=O)": 432,
      "c2n1": 433,
      "CC2)c1": 434,
      ")N1CCCCC1": 435,
      "n2cccn": 436,
      "cn2)cc1": 437,
      "o2)cc1": 438,
      "c1cccnc1)": 439,
      "CC(=O)NC": 440,
      "ccc21": 441,
      "-n1": 442,
      "cc21": 443,
      "NC(=O)CS": 444,
      "on": 445,
      "O=C(c1ccccc1)N1CC": 446,
      "C(=O)O": 447,
      "CCOc1ccc(": 448,
      "c2ccn": 449,
      "CCN(C": 450,
      "c2)n1": 451,
      "c1ccccc1)c1ccccc1": 452,
      "c2cccc(F)": 453,
      "c1cccs1)": 454,
      "C3": 455,
      "c(F)c1": 456,
      "S(=O)(=O)N1CC": 457,
      "c1cc(F)": 458,
      "CN1C(=O)": 459,
      "c1cccc(C": 460,
      "cc(C(=O)N": 461,
      "c1n[nH]": 462,
      "(F)(F)F)": 463,
      "c2ccccc2)C1": 464,
      "c1no": 465,
      ")N1CCCC1": 466,
      "CC2CC": 467,
      "c2ccc(Cl)": 468,
      "c2ccccc2)c1": 469,
      "c3nn": 470,
      "cn2": 471,
      "c4ccccc4": 472,
      "CC(NC(=O)": 473,
      "3CCOCC": 474,
      "=O)cc1": 475,
      "c2ccccc2F)": 476,
      "O1": 477,
      "c1ccc(O": 478,
      "NC(=O)N1CC": 479,
      "c(CN": 480,
      "n2n": 481,
      "(C)C(=O)": 482,
      "ccc3": 483,
      "2)s1": 484,
      "no1": 485,
      "C(=O)NC2CC": 486,
      "c1cccc(Cl)": 487,
      "c1ccco1)": 488,
      "CN2": 489,
      "c(-c3ccccc3)": 490,
      "c2ccccn": 491,
      "c1cc2c(": 492,
      "Cc1cs": 493,
      "OC(": 494,
      "O=S(=O)(N": 495,
      "CC(C)C)": 496,
      "O=C(CNC(=O)": 497,
      "c2cc(C)": 498,
      "c2nc3ccccc3": 499,
      "Cc2ccccc2": 500,
      "(N)": 501,
      "c1cc2ccccc2": 502,
      "n1C": 503,
      "CCCC2": 504,
      "cc3": 505,
      "(O)": 506,
      "c3ncc": 507,
      "c23)": 508,
      "O=C(CN1CC": 509,
      "CCO)": 510,
      "[nH]1)": 511,
      "C2)cc1": 512,
      "c1cccc(F)c1": 513,
      "c2ncccn": 514,
      "O=C(CN": 515,
      "O=C(O": 516,
      "C1CCCC1": 517,
      "O=C(NCC1CC": 518,
      "cnc3)": 519,
      "c2cc(F)": 520,
      "c1cnn(-": 521,
      "c2ccccc12)": 522,
      "C#N)": 523,
      "nn2)cc1": 524,
      "c(NC": 525,
      "OCCO2": 526,
      "c3s": 527,
      "OCC1)": 528,
      "c(=O)[nH]1": 529,
      "C1CCCCC1": 530,
      "C(C)(C)": 531,
      "C2)c1": 532,
      "c2ccc(C)": 533,
      "c1ccc(-n2cn": 534,
      "c1ccc(CN": 535,
      "C(=O)N(C)": 536,
      "C3)": 537,
      "n12": 538,
      "cccn1": 539,
      ")N1CCOCC1": 540,
      "CC(=O)N2CC": 541,
      "c2nccs": 542,
      "ccccc1": 543,
      "c1cc(Cl)": 544,
      "CCN1C(=O)": 545,
      "c1co": 546,
      "c4cc": 547,
      "(F)F": 548,
      "Nc1ccccc1": 549,
      "c1nccs1": 550,
      "c3[nH]": 551,
      "o1)": 552,
      "NC(=O)N2CC": 553,
      "c3ccc(F)cc": 554,
      "ccc1F": 555,
      "c1ccncc1)": 556,
      "CCN(CC)": 557,
      "ncc2": 558,
      "c1ccc[nH]1": 559,
      "Br)cc1": 560,
      "S(=O)(=O)N2CC": 561,
      "COc2ccccc2": 562,
      "CC(N)": 563,
      "n(C": 564,
      "c(C)nn": 565,
      "c1ccc(N": 566,
      "c2o": 567,
      "c2cn[nH]": 568,
      "OC2CC": 569,
      "c1)c1ccccc1": 570,
      "c2ccccc2)n1": 571,
      "c2ccc(F)cc2": 572,
      "O)cc1": 573,
      "C1CCN(C(=O)": 574,
      ")N1CCC(": 575,
      "c1cccc(Cl)c1": 576,
      "C2(": 577,
      "CNS(=O)(=O)": 578,
      "n1-": 579,
      "c1cc(C)": 580,
      "c2ccs": 581,
      "NC(=O)C(C)": 582,
      "c1ccoc1": 583,
      "c2cccc(Cl)": 584,
      "cccc1": 585,
      "c1ccc(NC": 586,
      "c2cccc3": 587,
      "n(CC": 588,
      "CCO1": 589,
      "C1(": 590,
      "CCOc1ccccc1": 591,
      "Cn1cc(": 592,
      "c2cc3": 593,
      "OC)c1": 594,
      "c(-n3": 595,
      "O=C(Nc1ccccc1)c1ccccc1": 596,
      "C1CC(=O)N": 597,
      "c1ccccc1)NC": 598,
      "COCC": 599,
      "c(Cl)c1": 600,
      "C1CCN(": 601,
      "c2no": 602,
      "c1ccc2ccccc2": 603,
      "(C)c1": 604,
      "CNC(=O)N": 605,
      "ccnc1": 606,
      "Cc1nc(": 607,
      "c2cccnc2)": 608,
      "[nH]2)cc1": 609,
      "Cc1noc(C)c1": 610,
      "c1ncccc1": 611,
      "OCC2)": 612,
      "c1nc(-c2cc": 613,
      "cn1)": 614,
      "Cl)cc1": 615,
      "cnc2c1": 616,
      "C(=O)NC1CC": 617,
      "CC1(": 618,
      "CC2)n1": 619,
      "c2n1CC": 620,
      "c1ccc(C(=O)N": 621,
      "3)cc": 622,
      "o2)": 623,
      "NC(=O)Cn1": 624,
      "c2nc(-c3cc": 625,
      "cc12": 626,
      "c2ccc(F)cc2)": 627,
      "CCS": 628,
      "O=C(c1cn": 629,
      "c1nnn": 630,
      "O=C(CCn1": 631,
      "c2ccccc21)": 632,
      "NC1CC1": 633,
      "Cc1nn(C)": 634,
      "c2c[nH]": 635,
      "c1ccc(-c2nn": 636,
      "O=C1CC(": 637,
      "OC1": 638,
      "C)c1": 639,
      "C(C#N)": 640,
      "S(=O)(=O)NC": 641,
      ")N1CCN(": 642,
      "c1ccc2c(c1)OCO2": 643,
      "NC1CCCCC1": 644,
      "ccc2c1": 645,
      "3)n2)cc1": 646,
      "O=C(CSc1nn": 647,
      "CCN2": 648,
      "c(=O)o": 649,
      "c(OC)c1": 650,
      "c(C3CC": 651,
      "c(=O)n(C)": 652,
      "(=O)=O": 653,
      "c1cc(=O)": 654,
      "co3)": 655,
      "c2cc(Cl)": 656,
      "c1cscn1": 657,
      "3)c1": 658,
      "c1ccc(=O)": 659,
      "c1nccs1)": 660,
      "N#Cc1ccc(": 661,
      "c1ccc(CN2CC": 662,
      "cs3)": 663,
      "c2cc(-": 664,
      "ncn": 665,
      "nc(C)": 666,
      "O=S(=O)(NC": 667,
      "c1cn[nH]": 668,
      "C(C)(C)C": 669,
      "c1nc(": 670,
      "c1ccc2n": 671,
      "n1CC": 672,
      "n2)c1": 673,
      "C(N)=O": 674,
      "c1ccc(OC": 675,
      "O=C1N": 676,
      "C(F)F)": 677,
      "(N)(=O)=O)": 678,
      "c3ncn": 679,
      "C1=": 680,
      "c1ccc(NC(=O)": 681,
      "CCC#N)": 682,
      "C(NC(=O)": 683,
      "CC(N)=O)": 684,
      "n2ccn": 685,
      "3CCOCC3)": 686,
      "OCC2)cc1": 687,
      "c1ccc(-n2cccn": 688,
      "cccn3)": 689,
      "n2cc": 690,
      "O=C(COC(=O)": 691,
      "(CO)": 692,
      "c2)C1": 693,
      "c1[nH]": 694,
      "c1ccn[nH]1": 695,
      "c1ccccc1)N1CCCCC1": 696,
      "C(C)C(=O)N": 697,
      "c(CC": 698,
      "Oc1ccccc1": 699,
      "O=C(Nc1nn": 700,
      "CCc1ccccc1": 701,
      "s2)": 702,
      "c2ccc(OC)": 703,
      "CC3)": 704,
      "c3cccnc3)": 705,
      "[nH]c(=O)": 706,
      "c2ccccc2Cl)": 707,
      "n2c1": 708,
      "Cc1nnc(": 709,
      "c(SC": 710,
      "O=C(Cn1cn": 711,
      "cc(F)": 712,
      "C(C(=O)N": 713,
      "N)cc1": 714,
      "c2ccccn2)": 715,
      "c1cn2": 716,
      "N(C)": 717,
      "c2ccccc2C1": 718,
      "O)c1": 719,
      "CCCO": 720,
      "CCC3": 721,
      "c21": 722,
      "c2nnn": 723,
      "c1ccc(C)": 724,
      "OC2": 725,
      "CCN2CC": 726,
      "c1cc(-c2ccccc2)": 727,
      "3CCCC3)": 728,
      "CCc1": 729,
      "c1ccc(-c2cc": 730,
      "c3ccccc32)cc1": 731,
      "CCNC2": 732,
      "n2C": 733,
      "c2ccco2)": 734,
      "Cn1n": 735,
      "CCc1nn": 736,
      "cc(Br)": 737,
      "CCN(C(=O)": 738,
      "cccn1)": 739,
      "Cn1cc": 740,
      "c(C(=O)N2CC": 741,
      "O=C(Cc1ccccc1)N": 742,
      "CN(CC": 743,
      "2)N1CC": 744,
      "c1cccc(C)c1": 745,
      "c1ccc(OCC": 746,
      "c1cnoc1": 747,
      "Cc1cc(C(=O)N": 748,
      "C(=O)OC": 749,
      "Cn1cn": 750,
      "Cc1n[nH]": 751,
      "c4c(": 752,
      "C#N": 753,
      "Cc1ccc(C)": 754,
      "NC(=O)CO": 755,
      "c(F)cccc1": 756,
      "C(N": 757,
      "Cc1o": 758,
      "cc2)c1": 759,
      "n2C)": 760,
      "C1CC1)": 761,
      "c(C(F)(F)F)": 762,
      "n2nn": 763,
      "c2c(F)": 764,
      "S(N)(=O)=O)": 765,
      "c1ccc(OC)": 766,
      "nnc1": 767,
      "cccc2": 768,
      "c1ccc(F)cc1)": 769,
      "[nH]c1=O": 770,
      "o2)c1": 771,
      "CO1)": 772,
      "c1cccc2c1": 773,
      "C2)n1": 774,
      "c1ccc(-c2cn": 775,
      "CCN(CC)C(=O)": 776,
      "4CC": 777,
      "c2ccc(Cl)cc": 778,
      "CN2C(=O)": 779,
      "c1ccc2c(c1)OCCO2": 780,
      "cs2)": 781,
      "cc2)cc1": 782,
      "c(NC(=O)C": 783,
      "O=C(COc1ccccc1)N": 784,
      "c(CS": 785,
      "c(C)c(C)": 786,
      "ccc12": 787,
      "=O)c1": 788,
      "C(=O)OCC": 789,
      "c1ccc(-c2cs": 790,
      "cc(Cl)": 791,
      "c2cccnc2": 792,
      "Cc1ccc(C(=O)N": 793,
      "c1ccc[nH]": 794,
      "c2cnccn": 795,
      "C(=O)OC)": 796,
      "CCc1ccc(": 797,
      "c3ccccn3)": 798,
      "c2ccc(N": 799,
      "c2cccs2)": 800,
      "c3ccccc23)": 801,
      "(-c2ccccc2)": 802,
      "c(NC(=O)c2cc": 803,
      "c(C(C)C)": 804,
      "c1nc2c(": 805,
      "CC1CCCO1": 806,
      "cn2)": 807,
      "c1nc(-": 808,
      "c2ccc3c(c2)OCO": 809,
      "CS(=O)(=O)": 810,
      "c1ccccc1F)": 811,
      ")N(C": 812,
      "Cc2ccccc21": 813,
      "Cc1nn": 814,
      "C(F)(F)F": 815,
      "O=C(C1CC": 816,
      "CC(=O)Nc1ccc(": 817,
      "CC(N": 818,
      "c1cc[nH]n1": 819,
      "C(C)NC(=O)": 820,
      "ccc1=O": 821,
      "NC(=O)NCC": 822,
      "c2ccccn2)cc1": 823,
      "c(C(=O)NC": 824,
      "ccc1Cl": 825,
      "CCNS(=O)(=O)": 826,
      "c1cco": 827,
      "c1ccon1": 828,
      "CC(C)(C)O": 829,
      "2)nn1": 830,
      "CC(C)NC(=O)": 831,
      "c2c(C)n": 832,
      "c2cnn(C)": 833,
      "N(C(=O)C": 834,
      "CC1CC1": 835,
      "c(CN2CC": 836,
      "c1ccc(Br)cc1": 837,
      "n2-": 838,
      "Cc1cc2": 839,
      "c1ccc(F)c(F)c1": 840,
      "c1cnccn1": 841,
      "c(CO": 842,
      "COc1ccc(OC)": 843,
      "(C(=O)N": 844,
      "ncc3": 845,
      "n3cn": 846,
      "c1ccc(-n2cccn2)cc1": 847,
      "c2cc(F)ccc2": 848,
      "CC(=O)N(C)": 849,
      "OCCCO": 850,
      "cn3)": 851,
      "c1)N": 852,
      "C(CO)": 853,
      "c2cccc(C)": 854,
      "c2cco": 855,
      "c1nc(-c2ccccc2)": 856,
      "c1ccc(C#N)": 857,
      "C(=O)N1CCC(": 858,
      "CC(C)O": 859,
      "c1c(C)": 860,
      "c1cn[nH]c1)": 861,
      "ccc1O": 862,
      "nc3": 863,
      "c3ccc(F)cc3)": 864,
      "C(C)C)cc1": 865,
      "OC(C)(C)C)": 866,
      "ccc1C": 867,
      "s3)": 868,
      "2)c1C": 869,
      "NC(=O)C2": 870,
      "c2ccc(-n3": 871,
      "S(C)(=O)=O": 872,
      "CC1(C)": 873,
      "[nH]c1=O)": 874,
      "c3ccco3)": 875,
      "nc2c1": 876,
      "CC2=O)cc1": 877,
      "NC2CC": 878,
      "ncc3)": 879,
      "cc1)": 880,
      "c2ccc(C#N)": 881,
      "n[nH]": 882,
      "c2ccc(Br)": 883,
      "c1ccc(C2": 884,
      "c1ccc(-n2cc": 885,
      "c1c(F)cccc1": 886,
      "c2C1": 887,
      "=C(": 888,
      "c(O)": 889,
      "c(C)n1": 890,
      "c(CO)": 891,
      "NC1CCCC1": 892,
      "COc1cc(C)": 893,
      "O=C(OC": 894,
      "O=S(=O)(C": 895,
      "ccc2N1": 896,
      "c2ncccc2": 897,
      "c2n[nH]": 898,
      "NC(=O)NC(C)": 899,
      "n[nH]1": 900,
      "c1cc(C2CC": 901,
      "c2nc(C)": 902,
      "c2sccc2": 903,
      "O=C(NCCc1ccccc1)": 904,
      "c3ccccc32)": 905,
      "c2C)cc1": 906,
      "c(C)cc(C)": 907,
      "c2ccc(F)c(F)": 908,
      "CCC2)cc1": 909,
      "c(Br)": 910,
      "cs2)cc1": 911,
      "c1ccs": 912,
      "c1nncs1": 913,
      "CC3": 914,
      "CN(C(=O)N": 915,
      "c1cccc(N2CC": 916,
      "(CNC(=O)": 917,
      "NC(=O)N(C)": 918,
      "c1ccc(-c2no": 919,
      "3CCCCC3)": 920,
      "O=C(NCCO": 921,
      "CCC(=O)N1CC": 922,
      "NC(=O)CNC(=O)": 923,
      "c2cccc(-": 924,
      "CCCCC1": 925,
      "cnc3": 926,
      "c1ccc2c(c1)OCO2)": 927,
      "2CCCO": 928,
      "OCC2": 929,
      "CCc1no": 930,
      "COc1ccc(C(=O)N": 931,
      "3)CC1": 932,
      "c2=O)cc1": 933,
      "c1ccc(-n2ccn": 934,
      "C1CCCO1": 935,
      "n1cn": 936,
      "nn3": 937,
      "c1ccccc1)NCc1ccccc1": 938,
      "c1cc2c(cc1": 939,
      "4CC4)": 940,
      "N(C(=O)N": 941,
      "c1cnn(C)": 942,
      "c1ccc(C)cc1": 943,
      "N1CCOCC1": 944,
      ")N1CCNCC1": 945,
      "O=C(Nc1ccccc1": 946,
      ")N1CCN(C": 947,
      "c2ccc(C(=O)N": 948,
      "O=C(CC1": 949,
      "ccc1NC(=O)": 950,
      "O=C(CCC": 951,
      "n2)CC1": 952,
      "SC": 953,
      "2)n[nH]1": 954,
      "CCn1cc(": 955,
      "c2cccc(F)c2)": 956,
      "-n1cn": 957,
      "C2CC2)": 958,
      "N1CCCC1": 959,
      "OCC1CC": 960,
      "c4)": 961,
      "c1cccc2cccn": 962,
      "c(SCC(=O)N": 963,
      "cc(C)": 964,
      "c3ccccc3F)": 965,
      "c2ccccc2c1=O": 966,
      "c2ccc(O)": 967,
      "c1ccc2o": 968,
      "C(C(N)=O)": 969,
      "C1CCCN(C(=O)": 970,
      "c2cc[nH]": 971,
      "c1cccc(NC(=O)": 972,
      "n4": 973,
      "co1": 974,
      "c1ccc(CC": 975,
      "c1ccccc1F": 976,
      "c1ccnc(": 977,
      "c1cccc2ccccc1": 978,
      "c(=O)n(": 979,
      "CCCO)": 980,
      "3)nc2c1": 981,
      "c1cc(Br)": 982,
      "c2ccccn12": 983,
      "c1cc(C(=O)N": 984,
      ")N1": 985,
      "c(C2": 986,
      "c(-c2ccco": 987,
      "c3cccs3)": 988,
      "CCn1cn": 989,
      "C2CC2)cc1": 990,
      "SCC(=O)N": 991,
      "Sc1nn": 992,
      "CCCC2)": 993,
      "c2cc(C(=O)N": 994,
      "O=C(Nc1nccs1)": 995,
      "c1csc(-": 996,
      "o3)": 997,
      "O=C(Nc1ccn": 998,
      "CCN(C)": 999,
      "n2cnnn": 1000,
      "c1cc(N2CC": 1001,
      "nc1-": 1002,
      "C(C)N": 1003,
      "cc(OC)c1": 1004,
      "CC(C(=O)N": 1005,
      "c2c(F)cccc2": 1006,
      "cnc2s": 1007,
      "cc3)": 1008,
      "O=C(Cn1cc": 1009,
      "c(-c4cc": 1010,
      "COc1ccc(F)cc1": 1011,
      "c1nc[nH]": 1012,
      "cnc2)": 1013,
      "c1ccccc1Cl": 1014,
      "OCC(=O)": 1015,
      "c3cccc(F)": 1016,
      "cc2)n1": 1017,
      "Cc1ccc(NC(=O)": 1018,
      "c3c2": 1019,
      "O=C(Nc1ccccn1)": 1020,
      "O=C(NC1CC1)": 1021,
      "Cc1nn(C)c(C)c1": 1022,
      "cccc3": 1023,
      "c2ccccc2N1": 1024,
      "[nH]2)": 1025,
      "c1ccsc1)": 1026,
      "COc1ccc(Cl)cc1": 1027,
      "c1ccccc1NC(=O)": 1028,
      "c1cccc(C(=O)N": 1029,
      "C(F)(F)F)cc1": 1030,
      "O=C(CC1CC": 1031,
      "c2ccc(N)": 1032,
      "c2[nH]n": 1033,
      "c2cc1": 1034,
      "c2ccccc21)N": 1035,
      "C(N)=O)cc1": 1036,
      "n1-c1ccccc1": 1037,
      "c4c(c3)": 1038,
      "c2ccc(Cl)cc2": 1039,
      "COC2": 1040,
      "3CCCC3": 1041,
      "Cc1nc(C)": 1042,
      "OC(C)": 1043,
      "CN1CCN(C(=O)": 1044,
      "c2ccc(F)cc2F)": 1045,
      "oc1C": 1046,
      "CC(F)(F)F)": 1047,
      "S1": 1048,
      "NC(C)=O)": 1049,
      ")N1CCCC(": 1050,
      "CO3)": 1051,
      "CN(C)S(=O)(=O)": 1052,
      "c1c[nH]c2ccccc12)": 1053,
      "s2)cc1": 1054,
      "c3C)": 1055,
      "c(C3CC3)": 1056,
      "CC2)n": 1057,
      "Cc1cc(=O)": 1058,
      "Sc2nn": 1059,
      "c2)s1": 1060,
      "c1nnc2n1CC": 1061,
      "c4ccccc4)": 1062,
      "O=C(NCc1ccccc1)c1ccccc1": 1063,
      "c2cnn(-": 1064,
      "CC(C)n1": 1065,
      "OC(F)F)": 1066,
      "=O)N": 1067,
      "C2(CC1)": 1068,
      "Cc1ccn": 1069,
      "3cccc": 1070,
      "c2n(": 1071,
      "C1CC(=O)N(": 1072,
      "c(C3CC3)n": 1073,
      "Cc1nc(-": 1074,
      "c3ccc(Cl)cc": 1075,
      "=C": 1076,
      "S(=O)(=O)N(C)": 1077,
      "C1CCNCC1": 1078,
      "c23)cc1": 1079,
      "O=c1cc": 1080,
      "C(C)C)c1": 1081,
      "c1nc(C2CC": 1082,
      "O=C(NCCN1CC": 1083,
      "Cc1cccnc1": 1084,
      "c1ccc2[nH]cnc2c1": 1085,
      "O=S(=O)(c1ccccc1)N1CC": 1086,
      "c2cccnc2)cc1": 1087,
      "O=C(Nc1cn": 1088,
      "CC2(": 1089,
      "COC": 1090,
      "ccc1OC": 1091,
      "O2": 1092,
      "c2ccncc2)": 1093,
      "O=C(NC1CCCCC1)": 1094,
      "OCCO2)": 1095,
      "c1ccc2c(c1)N": 1096,
      "O=C1CCCN1": 1097,
      "c3ccccc32)c1": 1098,
      "N)c1": 1099,
      "C(=O)N1CCN(": 1100,
      "CC2)CC1": 1101,
      "c3ncccn3)": 1102,
      "nn2": 1103,
      "co2)cc1": 1104,
      "CCN(C)C(=O)": 1105,
      "c1ccc2ccccc2c1": 1106,
      "Cc1s": 1107,
      "2CCC1": 1108,
      "#N": 1109,
      "c2c1)": 1110,
      "nc(-": 1111,
      "c1ccc(O)cc1": 1112,
      "CCC1CC": 1113,
      "c1ccc(C2CC": 1114,
      "COCCNC(=O)": 1115,
      "c3cc(C)": 1116,
      "Cc1ccc(F)cc1": 1117,
      "N(C)C(=O)": 1118,
      "cn2)c1": 1119,
      "O=C(Nc1ccccc1)N1CC": 1120,
      "CC(C)O1": 1121,
      "n2n1": 1122,
      "c2ccccc2c1=O)": 1123,
      "NC1=O": 1124,
      "n1)c1ccccc1": 1125,
      "O=C(NCCC": 1126,
      "C1CCC1": 1127,
      "c2c(c1)": 1128,
      "C1=O": 1129,
      "(Cc2ccccc2)": 1130,
      "c2nccs2)cc1": 1131,
      "cc(C": 1132,
      "c(C(=O)": 1133,
      "c3ccncc3)": 1134,
      "CCNC(=O)N": 1135,
      "O=C(CCNC(=O)": 1136,
      "c(C)nn(C)": 1137,
      "c(CNC(=O)": 1138,
      "c2ncccc2c1": 1139,
      "COc1cc(OC)": 1140,
      "C(c1ccccc1)": 1141,
      "cc2)CC1": 1142,
      "NCc1ccco1": 1143,
      "c(-c2ccccc2)n1": 1144,
      "Cc1cc(NC(=O)": 1145,
      "c3cs": 1146,
      "c(CC)": 1147,
      "c2-": 1148,
      ")c1ccccc1": 1149,
      "c1ncc(": 1150,
      "nc(C(=O)N": 1151,
      "c1cccc(F)c1)": 1152,
      "n3)n": 1153,
      "cc(=O)": 1154,
      "n12)": 1155,
      "cc2C)": 1156,
      "OCCO3)": 1157,
      "c2)cn1": 1158,
      "CSc1nn": 1159,
      "Cc1nc2ccccc2": 1160,
      "(CC)": 1161,
      "sc1C": 1162,
      "c1ccc(-n2ccnn2)cc1": 1163,
      "c(C(C)(C)C)": 1164,
      "c1nc2ccccc2[nH]1": 1165,
      "c2ncccn2)CC1": 1166,
      "c1ccccc1)C(=O)": 1167,
      "COCCO": 1168,
      "C1CCCN1C(=O)": 1169,
      "C(C)=O": 1170,
      "ccs": 1171,
      "c1cccc(C#N)": 1172,
      "C=CCNC(=O)": 1173,
      "c1nc2ccccc2s1": 1174,
      "c2ccc(Cl)cc2)": 1175,
      "c3cnccn": 1176,
      "nc(N": 1177,
      "c1cnn(-c2ccccc2)c1": 1178,
      "c1scnc1": 1179,
      "(C)C)cc1": 1180,
      "c1nc2c(s1)": 1181,
      "c1cnc(N2CC": 1182,
      "C(=O)N2CCN(": 1183,
      "(F)(F)F": 1184,
      "cnc12": 1185,
      "CC1CN(C(=O)": 1186,
      "c2cc(Cl)ccc2": 1187,
      "c1ccno1": 1188,
      "c1cc2ccccc2o1": 1189,
      "Cc1cc(C)cc(": 1190,
      "c2ccc(NC(=O)": 1191,
      "oc2C)": 1192,
      "C(=O)Nc1ccccc1": 1193,
      "c1cccs1)N": 1194,
      "O=C(COc1ccccc1)Nc1ccccc1": 1195,
      "OCC2)c1": 1196,
      "O=C(NCC1": 1197,
      "nnnc1": 1198,
      "c1ccc(-n2cnnn2)cc1": 1199,
      "c(C)o1": 1200,
      "O=C(Nc1ccc2c(c1)": 1201,
      "c2)nc1": 1202,
      "CS(=O)(=O)N1CC": 1203,
      "2)cn1": 1204,
      "c(NCC": 1205,
      "C1CCCN(": 1206,
      "CCCC(=O)N": 1207,
      "c1ccc2c(c1)CCNC2": 1208,
      "C(O": 1209,
      "c1ccc(-n2nn": 1210,
      "N#Cc1cccc(": 1211,
      "CCC2)c1": 1212,
      "cc1Cl": 1213,
      "3C)": 1214,
      "c1ccc(NC(=O)c2cc": 1215,
      "O=C1CO": 1216,
      "c2ccc(C)cc": 1217,
      "2)o1": 1218,
      "c2cc3c(": 1219,
      "CCC(CC)": 1220,
      "c(C3": 1221,
      "Cc1cc(-": 1222,
      "C(=O)NC(C)": 1223,
      "c1ccn(-": 1224,
      "COc1": 1225,
      "N1CCCCC1": 1226,
      "c1ccc(Cl)cc1)": 1227,
      "c3cn[nH]": 1228,
      "c3cc(F)": 1229,
      "N(S(=O)(=O)": 1230,
      "c(=O)[nH]c(=O)": 1231,
      "Cc1cccc(C)c1": 1232,
      "C1CO": 1233,
      "Oc2ccccc21": 1234,
      "c1cncs1": 1235,
      "c1cc(=O)[nH]": 1236,
      "COc1ccc(C)cc1": 1237,
      "c1cncc(": 1238,
      "c3n2)cc1": 1239,
      "CC2=O)": 1240,
      "c(-c2cccs": 1241,
      "=c1[nH]": 1242,
      "c(-c3cccc": 1243,
      "O=C(NCC(=O)N1CC": 1244,
      "=N": 1245,
      "sc2c1": 1246,
      "c(N)c1": 1247,
      "CC1)c1ccccc1": 1248,
      "c2ccco2)cc1": 1249,
      "cnc21": 1250,
      "COc1ccc(NC(=O)": 1251,
      "CCOCC1": 1252,
      "CCO2": 1253,
      "C=CCn1": 1254,
      "n2c(": 1255,
      "c1ccc(C(=O)N2CC": 1256,
      "C2(CC": 1257,
      "sc3)": 1258,
      "Cc1ccsc1": 1259,
      "CC(O": 1260,
      "c1cc(F)ccc1": 1261,
      "CC1CC1)": 1262,
      "COc1cccc(-": 1263,
      "O=c1[nH]c(=O)": 1264,
      "c2nc[nH]": 1265,
      "CCC4)": 1266,
      "c(C)s1": 1267,
      "(C)n1": 1268,
      "c2nncn2": 1269,
      "CC1CCN(C(=O)": 1270,
      "CC1CN(": 1271,
      "c1ccc(CO": 1272,
      "Cc1ccc2n": 1273,
      "O=C(NCc1cccnc1)": 1274,
      "O=C(NCc1ccco1)": 1275,
      "c3cccc(F)c3)": 1276,
      "CC(=O)NCC": 1277,
      "c(-c2ccncc": 1278,
      "c2ccc3c(c2)OCO3)": 1279,
      "c1ccc(F)cc1F": 1280,
      "c2ccncc2)cc1": 1281,
      "Nc1n": 1282,
      "c1cc2c(s1)": 1283,
      "c1ccc2c(c1)CCC2": 1284,
      "N#CC": 1285,
      "CCn1n": 1286,
      "C)C(=O)": 1287,
      "c1cn(-c2ccccc2)": 1288,
      "Cc1c(C(=O)N": 1289,
      "CC(=O)Nc1cccc(": 1290,
      "CC(=O)NC2CC": 1291,
      "n2CC": 1292,
      "O=C(c1cccnc1": 1293,
      "c1c(C)n": 1294,
      "no3)": 1295,
      "2C": 1296,
      "c1ncccn1": 1297,
      "c2=O)c1": 1298,
      "CCn1nc(C)": 1299,
      "O=C1CN(C(=O)": 1300,
      "c2c(C)": 1301,
      "C1CCCN1": 1302,
      "CC2)nc1": 1303,
      "CS(=O)(=O)N": 1304,
      "C(=O)N1CCCC1": 1305,
      "Cc1[nH]": 1306,
      "c2ccc(F)cc2)CC1": 1307,
      "CC=": 1308,
      "2)c1)": 1309,
      "CC2CCCO": 1310,
      "CC#N)": 1311,
      "cc2N1": 1312,
      "C(F)(F)F)c1": 1313,
      "O=c1ccn": 1314,
      "c2cccc(C#N)": 1315,
      "NCC2)cc1": 1316,
      "CC2)C1": 1317,
      "s2)c1": 1318,
      "c3ccc4c(c3)": 1319,
      "O=C(Nc1cccnc1)": 1320,
      "Cc1occc1": 1321,
      "c2ccccc2n1": 1322,
      "=O)Nc1ccccc1": 1323,
      "NC(=O)C1": 1324,
      "c3ccc(F)cc3": 1325,
      "O=C(Nc1ccccc1)N": 1326,
      "c1cccc(Br)": 1327,
      "C(F)F": 1328,
      "O=C(NCCCn1": 1329,
      "CC(CC(C": 1330,
      "c2s1": 1331,
      "c1)C(=O)": 1332,
      "c1cc[nH]c1": 1333,
      "CC(=O)O": 1334,
      "cc2C1": 1335,
      "CCn1cc": 1336,
      "3CCCC3)n": 1337,
      "c1c[nH]c2ccccc12": 1338,
      "O=C(Nc1cccc(-": 1339,
      "cc1C": 1340,
      "c2nnc(-c3cc": 1341,
      "c2cc(NC(=O)": 1342,
      "c2)o1": 1343,
      "CC(=O)c1ccc(": 1344,
      "cc(N)": 1345,
      "CCC(=O)": 1346,
      "CSc1n": 1347,
      "O=C(Nc1nncs1)": 1348,
      "O=S(=O)(NCC": 1349,
      "c1ccc2s": 1350,
      "COc1cccc(C": 1351,
      ")NCC": 1352,
      "c2cc(OC)": 1353,
      "o2)CC1": 1354,
      "CCC(C)NC(=O)": 1355,
      "CC2)cn1": 1356,
      "c3n2CC": 1357,
      "Cn1c(=O)": 1358,
      "O=S(=O)(Nc1ccccc1)c1ccccc1": 1359,
      "n2cccc": 1360,
      "O=C(Cc1ccccc1)N1CC": 1361,
      "O=C(NCc1ccccc1)N": 1362,
      "c2cc(Br)": 1363,
      "2CC3": 1364,
      "CN1CCOCC1": 1365,
      "CC(C)CNC(=O)": 1366,
      "c(=O)[nH]1)": 1367,
      "ncc3)n": 1368,
      "c2ccc(O": 1369,
      "C(F)(F)": 1370,
      "c2cc(N)": 1371,
      "Cc1cc(C(=O)N2CC": 1372,
      "COC(=O)N": 1373,
      "onc(C)c1": 1374,
      "cn2)CC1": 1375,
      "c2)no1": 1376,
      "c1ccc(C#N)cc1": 1377,
      "c[nH]2)cc1": 1378,
      "c34)": 1379,
      "CCCCn1": 1380,
      "c1cccc(O": 1381,
      "CC(C)C": 1382,
      "n3C)": 1383,
      "c(C2CCCO": 1384,
      "2)ncn1": 1385,
      "c(C(C)": 1386,
      "c2cccs2)cc1": 1387,
      "Nc1": 1388,
      "c1ccc(=O)[nH]c1": 1389,
      "c1sccc1": 1390,
      "OC3": 1391,
      "CN1CCN(": 1392,
      "CCC3)n": 1393,
      "COc1ccc(CNC(=O)": 1394,
      "c2nc3c(": 1395,
      "COc1cccc(C(=O)N": 1396,
      "CC(S": 1397,
      "COCC(C)": 1398,
      "(C)C)c1": 1399,
      "CC(CO)": 1400,
      "c1ccnc(OC2CC": 1401,
      "c1cscn1)": 1402,
      "c(NC(=O)N": 1403,
      "2)n1)": 1404,
      "CNC": 1405,
      "Cc1ccc(N2CC": 1406,
      "O=C(NCCNC(=O)": 1407,
      "CCc1onc(C)c1": 1408,
      "Cc1cc(F)": 1409,
      "CCN2C(=O)": 1410,
      "C2)C1": 1411,
      "Cc1cccc(C": 1412,
      "c2nco": 1413,
      "oc3)": 1414,
      "c3nccs3)": 1415,
      "3CCCO3)": 1416,
      "c2ccc(-": 1417,
      "c2ccc(F)cc2)c1": 1418,
      "c2ccccn2)c1": 1419,
      "CC(=O)NC(C)": 1420,
      "c2cccc(N)": 1421,
      "3CCOCC3)n": 1422,
      "(-c3ccccc3)": 1423,
      "CNC1": 1424,
      "c1ccc[nH]c1=O": 1425,
      "nc(N)": 1426,
      "c2nc3cc": 1427,
      "c2ccccn12)": 1428,
      "c2cc(=O)": 1429,
      "c1cncc(-": 1430,
      "cs3)n": 1431,
      "cc2Cl)": 1432,
      "c1cnn": 1433,
      "CC(=O)NC1CC": 1434,
      "O=C(NC1": 1435,
      "CC1CCCCC1": 1436,
      "c(C(N)=O)": 1437,
      "c3ccccn2": 1438,
      "CC2=O)c1": 1439,
      "C1CCOCC1": 1440,
      "CN(C(=O)C": 1441,
      "COc1ccc(-c2n": 1442,
      "C1CC=": 1443,
      "CC(NC(=O)N": 1444,
      "NC(=O)NC2CC": 1445,
      "[nH]n2)cc1": 1446,
      "n2nc(C)": 1447,
      "c1cncnc1": 1448,
      "c(C4CC4)": 1449,
      "COc1ccc(C": 1450,
      "nn3)": 1451,
      "c2nc(-c3ccccc3)": 1452,
      "S(C)(=O)=O)cc1": 1453,
      "cn[nH]": 1454,
      "c(S(=O)(=O)N": 1455,
      "O=C(Cn1nn": 1456,
      "c2ccccc2c1": 1457,
      "(CCO)": 1458,
      "O=C(CCO": 1459,
      "N(CCO)": 1460,
      "COC(=O)c1ccc(": 1461,
      "n2cccn2)cc1": 1462,
      "CCCC3": 1463,
      "OCCCO2": 1464,
      "O=C(c1ccccc1)N1CCCCC1": 1465,
      "c2C)c1": 1466,
      "c1cc2ccccc2[nH]1": 1467,
      "Cc1ccc(-": 1468,
      "c1scnc1C1CC1": 1469,
      "c2ccccc2C)": 1470,
      "(=O)N(": 1471,
      "c1ccc2": 1472,
      "C2CC2)c1": 1473,
      "n3cccn3)": 1474,
      "Cc1ccc(CNC(=O)": 1475,
      "3CCO": 1476,
      "c1cccc2ccccc12": 1477,
      "#C": 1478,
      "c3ncccc3": 1479,
      "CC(=O)c1cccc(": 1480,
      "CC(OC(=O)": 1481,
      "O=C(Cn1n": 1482,
      "c1ccc(-n2cncn2)cc1": 1483,
      "C3(CC": 1484,
      "C1COc2ccccc2": 1485,
      "ccnc3)": 1486,
      "nc2-": 1487,
      "C2CC2)CC1": 1488,
      "Cc1n[nH]c(C)c1": 1489,
      "O=S1": 1490,
      "c3o": 1491,
      "O=C(NCc1nn": 1492,
      "C#CCN1CC": 1493,
      "c1nc[nH]n1": 1494,
      "O=C(NCc1ccncc1)": 1495,
      "(CC(=O)N": 1496,
      "c2cccc(OC)": 1497,
      "c1cc(N)": 1498,
      "C(c2ccccc2)": 1499,
      "OCO4)": 1500,
      "c1cccc2ncc": 1501,
      "c2cc(N": 1502,
      "co3)n": 1503,
      "c1nc(C)": 1504,
      "C(=O)N(C)C": 1505,
      "c2)cs1": 1506,
      "Cc1ccco1": 1507,
      "Cc1cc(C)n(": 1508,
      "COc1ccc(C(=O)": 1509,
      ")NCC2": 1510,
      "[nH]2)c1": 1511,
      "OCC(=O)N2CC": 1512,
      "COc1ccc(-": 1513,
      "O=S(=O)(NC1CC": 1514,
      "O=C(C1CC1": 1515,
      "c(F)c(F)": 1516,
      "c2ccccn2": 1517,
      "nc1C": 1518,
      "nn12": 1519,
      "ccc2n1": 1520,
      "c2cn(C)": 1521,
      "c1ccc(NC(=O)C2CC": 1522,
      "OCC)": 1523,
      "O=C(Nc1cccc(": 1524,
      "CCCN": 1525,
      "c2ccc(C(F)(F)F)": 1526,
      "c1ccc(CNc2ccccc2)cc1": 1527,
      "Cc1cccc(-": 1528,
      "c1nc2ccccc2s1)": 1529,
      "c1cc(C": 1530,
      "2)cs1": 1531,
      "O=C(NCc1ccccn1)": 1532,
      "c2ccccc2)n": 1533,
      "O=C(CCC(=O)": 1534,
      "CC(=O)N1CCCC1": 1535,
      "CCCC3)": 1536,
      "no2)cc1": 1537,
      "c1cc(Cl)ccc1": 1538,
      "CC(=O)N1CCC(": 1539,
      "O=C(c1ccco1": 1540,
      "c1c(C)[nH]": 1541,
      "c2cc3cccc": 1542,
      "c2ccc(F)cc2)cc1": 1543,
      "c3no": 1544,
      "c2ccccn2)CC1": 1545,
      "N#Cc1ccccc1": 1546,
      "c1o": 1547,
      "c2cccs2)CC1": 1548,
      "(C)O": 1549,
      "COc1ccc2c(c1)": 1550,
      "S(=O)(=O)c1ccccc1": 1551,
      "3CCCC3=O)": 1552,
      "C#N)cc1": 1553,
      "O=C(COc1ccccc1)N1CC": 1554,
      "c2ccncc2)c1": 1555,
      "c(Cl)cccc1": 1556,
      "N1CCN(": 1557,
      "c1cc(OC)": 1558,
      "Cc1ccc(C": 1559,
      "c(O": 1560,
      "C2C1": 1561,
      "Cc1ccc(S(=O)(=O)N": 1562,
      "c(N3CC": 1563,
      "-c1nn": 1564,
      "CC(C)C(=O)N": 1565,
      "N1C(=O)": 1566,
      "c1nc2ccccc2[nH]1)": 1567,
      "CCOc1cccc(": 1568,
      "COCCN1CC": 1569,
      "c2c1C": 1570,
      "C=CC": 1571,
      "3)C1)": 1572,
      "[nH]1)c1ccccc1": 1573,
      "cc(OC)c1OC": 1574,
      "O=C(CCS": 1575,
      "Cc1ccc(-c2n": 1576,
      "Cc1ccc(C(=O)N2CC": 1577,
      "n(-c2ccccc2)": 1578,
      "Cn1ccnc1": 1579,
      "Cc1cccc(NC(=O)": 1580,
      "c2c(C)cc": 1581,
      "c3ccccc3Cl)": 1582,
      "CCCCNC(=O)": 1583,
      "n2cccn2)c1": 1584,
      "c1ccoc1)": 1585,
      "csc1": 1586,
      "c(=O)c1": 1587,
      "O=C(NCc1cccs1)": 1588,
      "o2)C1": 1589,
      "c1ccc2[nH]ccc2c1": 1590,
      "c1cc(F)ccc1F": 1591,
      "c1nco": 1592,
      "NC(=O)Cn2": 1593,
      "CC(=O)Nc1ccccc1": 1594,
      "CC2)s1": 1595,
      "c3cnccn3)": 1596,
      "O=C(Cc1ccccc1)Nc1ccccc1": 1597,
      "c1ccc2ncccc2c1": 1598,
      "c(N(C)C)": 1599,
      "COC(=O)C(C)": 1600,
      "Cc1csc(": 1601,
      "O=C(c1ccccc1)": 1602,
      "n2)C1": 1603,
      "CC3)n": 1604,
      "c2cn3": 1605,
      "c1cnn(C)c1": 1606,
      "c1ccc(-c2ccccc2)": 1607,
      "c1cccc2cccnc12": 1608,
      "c1cnn2": 1609,
      "c(=O)n(C)c(=O)": 1610,
      "NCc1cccs1": 1611,
      "COC1": 1612,
      "OCC(F)F)": 1613,
      "c1nnc(-": 1614,
      "c2ccc(C(N)=O)": 1615,
      "c1cccc(Br)c1": 1616,
      "c3cn[nH]c3)": 1617,
      "COc1ncccc1": 1618,
      ")N1CCCCCC1": 1619,
      "Cc1nn(": 1620,
      "CN(C)C(=O)N": 1621,
      "c2ccc3ccccc3": 1622,
      "CCC21": 1623,
      "c(-c2ccs": 1624,
      "c(CC(=O)N": 1625,
      "nc12": 1626,
      "N(C(=O)c3cc": 1627,
      "CCCC1)": 1628,
      "c1ncc(-": 1629,
      "c2c(n": 1630,
      "c2cccc(Cl)c2)": 1631,
      "c1ccc(OC)cc1": 1632,
      "c(N)n1": 1633,
      "c1ccccn1)N": 1634,
      "Cc1ccc(Cl)cc1": 1635,
      "cn12": 1636,
      "3CC3)n": 1637,
      "CC1=O": 1638,
      "C2)nc1": 1639,
      "c1cccc2[nH]": 1640,
      "Cn1nn": 1641,
      "c1ccc2c(c1)OCCO2)": 1642,
      "c1cccc(N": 1643,
      ")N1CCc2ccccc2C1": 1644,
      "CCCC4)": 1645,
      "C(C)(C)C)cc1": 1646,
      "C3CC3)": 1647,
      "c1ccccc1)C1CC1": 1648,
      "-n1cnnn1": 1649,
      "N(CC": 1650,
      "O=c1cc(": 1651,
      "Cc1nc(C": 1652,
      "c2ccccc2-": 1653,
      "O=C(NC1CCCC1)": 1654,
      "n2cnnn2)c1": 1655,
      "c2cccc(C(F)(F)F)": 1656,
      "CCN1CCOCC1": 1657,
      "c1n[nH]c(=O)": 1658,
      "O=c1c2ccccc2": 1659,
      "C(C)=O)cc1": 1660,
      "CC(C)(O)": 1661,
      "c1ccco1)N": 1662,
      "c3=O)": 1663,
      "c1cccc(C#N)c1": 1664,
      "CO)": 1665,
      "cn1C": 1666,
      "O=C1CCC(": 1667,
      "o1)c1ccccc1": 1668,
      "CN(S(=O)(=O)": 1669,
      "c2c(N)": 1670,
      "[nH]3)": 1671,
      "c1ccc(-n2ccnc2)cc1": 1672,
      "c2nc(C)n": 1673,
      "CC1CCCN(C(=O)": 1674,
      "cs2)c1": 1675,
      "cc2F)": 1676,
      "c1ccc(S": 1677,
      "C3)n": 1678,
      "c1ncc2": 1679,
      ")N1CCN(C(=O)": 1680,
      "CCC2)CC1": 1681,
      "CN(CC)": 1682,
      "O=C(CCc1ccccc1)N": 1683,
      "c2cccc(Br)": 1684,
      "c2F)": 1685,
      "3CCCCC3": 1686,
      "c3cc(F)ccc3": 1687,
      "c2c(F)cccc2F)": 1688,
      "NC=": 1689,
      "cn3": 1690,
      "Cc1ncc": 1691,
      "C=C(C)": 1692,
      "C(N)=O)c1": 1693,
      "(C(C)C)": 1694,
      "COc1ccn": 1695,
      "c2ccc(F)cc2)n1": 1696,
      "O=C(COc1ccccc1)": 1697,
      "cc(C(=O)NC": 1698,
      "N2": 1699,
      "c1cc(F)cc(F)": 1700,
      "C(C)O": 1701,
      "c1cccc2cccnc12)": 1702,
      "2(": 1703,
      "c2ccccc2)s1": 1704,
      "CCCNC(=O)N": 1705,
      "ccn3": 1706,
      "nc1-c1ccccc1": 1707,
      "Cc1ncn": 1708,
      "c3nnnn3": 1709,
      "CC(C#N)": 1710,
      "2(=O)=O)": 1711,
      "c2ccco2)CC1": 1712,
      "CC(=O)N1CCN(": 1713,
      "c(=O)[nH]c2c1": 1714,
      "O=C(NCCN": 1715,
      "[nH]c2c1": 1716,
      "COC)": 1717,
      "n1n": 1718,
      "c1ccc(-c2ccn": 1719,
      "O=C(c1cccs1": 1720,
      "CC(CC(C3)C1)": 1721,
      "Cc1nnn": 1722,
      "2CC3CC(CC(C3)C1)": 1723,
      "c2ccc3[nH]": 1724,
      "c(n1)": 1725,
      "(Cl)c3)": 1726,
      "C2=O)": 1727,
      "Cc1cccc(C(=O)N": 1728,
      "FC(F)(F)": 1729,
      "O=C(Nc1cc": 1730,
      "OC1)": 1731,
      "1CC1": 1732,
      "c1nnnn1": 1733,
      "3)n1": 1734,
      "c3nc4ccccc4": 1735,
      "Cc1cc(C)n(-": 1736,
      "c2cc3c(cc2": 1737,
      "c2)n": 1738,
      "c(-c4": 1739,
      "c1ccc(N2CCCC2=O)cc1": 1740,
      "CCn1cnnc1": 1741,
      "c1ccccc1)N1CCOCC1": 1742,
      "oc1)": 1743,
      "C(=O)CS": 1744,
      "c2cnn(-c3ccccc3)": 1745,
      "C2)CC1": 1746,
      "c1nnc(C2CC": 1747,
      "c1ccccc1O": 1748,
      "c2cccc(N": 1749,
      "c1cn2ccccc2": 1750,
      "cc12)": 1751,
      "c1ccc2c(c1)CCN2": 1752,
      "C(CC)": 1753,
      "Cc3ccccc3": 1754,
      "CC21": 1755,
      "NC(=O)N(C)C": 1756,
      "O=c1[nH]n": 1757,
      "c1ncccn1)": 1758,
      "CCC2CC": 1759,
      "c1ccnc(-": 1760,
      "CC(=O)Nc1cc(": 1761,
      "ccn2": 1762,
      "CCCN(": 1763,
      "n1Cc1ccccc1": 1764,
      "c2c(C)nn(C)": 1765,
      "C1CCCCC1)": 1766,
      "S(=O)(=O)NC2CC": 1767,
      "C1Cc2ccccc2": 1768,
      "CC1CCCO1)": 1769,
      "CC(C)(": 1770,
      "c2nnc3n2CC": 1771,
      "NC(=O)c1cn": 1772,
      "C(F)F)cc1": 1773,
      "n2)n1": 1774,
      "CCCC(=O)": 1775,
      "c(C(=O)NCC": 1776,
      "NC3": 1777,
      "c2cc(C)ccc2": 1778,
      "s2)CC1": 1779,
      "O=C(Oc1ccccc1)": 1780,
      "N1CCN(C(=O)": 1781,
      "cc1-": 1782,
      "c3ccc(Cl)cc3)": 1783,
      "c2cccc3ccccc2": 1784,
      "Cc1ccc(F)": 1785,
      "c2ccccc2F)CC1": 1786,
      "Cc1ncsc1": 1787,
      "c2)c1C": 1788,
      "O=C(Cn1cccn1": 1789,
      "c1ccc(CS": 1790,
      "c(=O)n1CC": 1791,
      "c1ccc(S(=O)(=O)N": 1792,
      "C(=O)N1CCCCC1": 1793,
      "c(-c2cccnc2)": 1794,
      "c(NC(=O)C2CC": 1795,
      "c2nnnn2": 1796,
      "NCc1cccnc1": 1797,
      "OCc1ccccc1": 1798,
      "oc2c1": 1799,
      "c1cnn(C": 1800,
      "c2ccccc2F)c1": 1801,
      "C2)cn1": 1802,
      "Cn1cccn1": 1803,
      "n2ncnc2": 1804,
      "c2ccccc2OC)": 1805,
      "cc1C(=O)N": 1806,
      "c2co": 1807,
      "cnn1C": 1808,
      "c2ccccc2)N1": 1809,
      "cc(CN": 1810,
      "ccc1N": 1811,
      "CCCS": 1812,
      "COc1ccccc1-": 1813,
      "c1cn(-c2ccccc2)nn1": 1814,
      "no1)": 1815,
      "CC(=O)NC(": 1816,
      "O=C(CCn1cn": 1817,
      "c2cccs2)c1": 1818,
      "c1ccc(CNC": 1819,
      "O=C(CS(=O)(=O)": 1820,
      "c2ncnc3[nH]": 1821,
      "c2ccc(-n3cn": 1822,
      "O=C(NCCN1CCOCC1)": 1823,
      "NCC1)": 1824,
      "CCC(=O)N2CC": 1825,
      "CCc1cc(": 1826,
      "c1ccc(-c2cscn2)cc1": 1827,
      "oc1=O": 1828,
      "CC1O": 1829,
      "c2c(Cl)cc": 1830,
      ")Nc1nccs1": 1831,
      "C(=O)C": 1832,
      "c2nc(N)": 1833,
      "c2cccnc2)CC1": 1834,
      "CCS(=O)(=O)N1CC": 1835,
      "2)nc2ccccc21": 1836,
      "CN2CCN(": 1837,
      "c3cnn(C)": 1838,
      "c2N)cc1": 1839,
      "c2ccccc2)o1": 1840,
      "NC2=O)": 1841,
      "CCCc1nn": 1842,
      "cc2s1": 1843,
      "c2nccs2)CC1": 1844,
      "n2cnn": 1845,
      "NC(": 1846,
      "[nH]n1)": 1847,
      "N#Cc1": 1848,
      "c2c(C)noc2C)": 1849,
      "OCC(F)(F)F)": 1850,
      "c2c[nH]c3ccccc23)": 1851,
      "Cc1ccncc1": 1852,
      "COC(=O)c1cccc(": 1853,
      "NC1CCN(": 1854,
      "c1cccc(Cl)c1)": 1855,
      "C1CCCC1)": 1856,
      "c1ccc2ccccc2n1": 1857,
      "c2n(n1)": 1858,
      ")N(": 1859,
      "CC2)no1": 1860,
      "Cc1cc(Cl)": 1861,
      "N=": 1862,
      "c2sc3c(": 1863,
      "c1nnnn1-": 1864,
      "c2ccccc2)c1)": 1865,
      "CC(CC": 1866,
      "NC1(": 1867,
      "C2)s1": 1868,
      "C(=O)N1": 1869,
      "c(-c3cccnc3)": 1870,
      "cnn1-": 1871,
      "CN1CCOCC1)": 1872,
      "OCO2": 1873,
      "c1ncc[nH]1": 1874,
      "CCC3)cc1": 1875,
      "no2)": 1876,
      "c(C2CCCO2)s1": 1877,
      "O=C(Cc1ccccc1)NC": 1878,
      "c2nn3": 1879,
      "c(F)c1)": 1880,
      "c3sccc3": 1881,
      "c(=O)[nH]c1=O)": 1882,
      "COc1cc(C": 1883,
      "nnc1-": 1884,
      "COCCN(C": 1885,
      "O=c1o": 1886,
      "c1ccc2c(c1)CC": 1887,
      "Cc1cccc2": 1888,
      "OCCO4)": 1889,
      "nnc2c1": 1890,
      "CN2CCCCC2": 1891,
      "c1ccc2c(c1)OCCCO2": 1892,
      "c2ccccc21)Nc1ccccc1": 1893,
      "O=C(Cn1ccccc1": 1894,
      "COCCCNC(=O)": 1895,
      "Cc1ccc(C)c(": 1896,
      "c(=O)n2": 1897,
      "n2cccn2)": 1898,
      "C(O)(": 1899,
      "c1ccc2c(c1)COC2": 1900,
      "c2ccc(S(=O)(=O)N": 1901,
      "O=C1C": 1902,
      "[nH]2)C1": 1903,
      "CNC(=O)c1cccc(": 1904,
      "on2)cc1": 1905,
      "c3cccc(": 1906,
      "c1ccccc1Cl)": 1907,
      "c(C(C)=O)": 1908,
      "c(CCC(=O)N": 1909,
      "O=C(Cc1ccccc1)": 1910,
      "O=C(NCc1ccccc1)Nc1ccccc1": 1911,
      "C1NCC": 1912,
      "O=C(NCc1cccnc1": 1913,
      "c2ccccc2)[nH]1": 1914,
      "nc21": 1915,
      "CCC2)n1": 1916,
      "cn2)C1": 1917,
      "Cc1cc(C": 1918,
      "c1ccc(Cn2cn": 1919,
      "c2cccnc21": 1920,
      "c4ccccc43)": 1921,
      "c1ncno1": 1922,
      "c(Br)c1": 1923,
      "cc2)s1": 1924,
      ")N(C)C(=O)": 1925,
      "c1ccc(F)cc1F)": 1926,
      "ncc2ccccc2": 1927,
      "c2[nH]ncc2c1": 1928,
      "c(NC(=O)CC": 1929,
      "O=C1CC(C(=O)N": 1930,
      "c(=O)n(C": 1931,
      "n(C)n1": 1932,
      "CCc1noc(CC)": 1933,
      "Cc2ccccc2C1": 1934,
      "c1cn(C)": 1935,
      "c1ccnc(OC2CCC2)c1": 1936,
      "O=C1COc2ccccc2": 1937,
      "c2ccc3c(c2)OCCO3)": 1938,
      "2n1": 1939,
      "NC(=O)c1ccc(": 1940,
      "c1nc(C": 1941,
      "c3cc(": 1942,
      "c2cn[nH]c2)": 1943,
      ")N1CCc2ccccc21": 1944,
      "CCC(C)(C)": 1945,
      "nc3)": 1946,
      "ccc2[nH]1": 1947,
      "c2cccc3cccn": 1948,
      "cc(Cl)c1": 1949,
      "NC(=O)CSc1nn": 1950,
      ")N(C)": 1951,
      "NC(=O)c1cccc(": 1952,
      "N#CC(": 1953,
      "c2ccccn2)n1": 1954,
      "COc3ccccc3": 1955,
      "c2N)": 1956,
      "CCC(=O)NC": 1957,
      "OCC2CC": 1958,
      "C1CC2CCC1": 1959,
      "Cn1nc(": 1960,
      "c1cnc(-": 1961,
      "c2nnc3ccccn2": 1962,
      "c2cccc(O)": 1963,
      "c2sccc2C1": 1964,
      "CCOc1ncccc1": 1965,
      "c1cn[nH]c1)c1ccccc1": 1966,
      "c2cnccn2)CC1": 1967,
      "O=C(c1ccoc1": 1968,
      "c2on": 1969,
      "cccc21": 1970,
      "O=c1cc[nH]": 1971,
      "Cc1cccs1": 1972,
      "ccn4)": 1973,
      "C#CCNC(=O)": 1974,
      "CCS(=O)(=O)N": 1975,
      "on3)": 1976,
      "O=C(NCc1cn": 1977,
      "c2scnc2": 1978,
      "c2ccc3c(c2)OCCO": 1979,
      "c2ccc[nH]": 1980,
      "O=C(CN1C(=O)": 1981,
      "c3cc[nH]": 1982,
      "c1cccc(-n2cnnn2)c1": 1983,
      "CC(C)(C)OC(=O)N1CC": 1984,
      "cc2)cn1": 1985,
      "c1ccc(OC2CC": 1986,
      "c[nH]1)": 1987,
      "cc2)C1": 1988,
      "c3ccc(C)cc": 1989,
      "c1ccc(=O)[nH]n1": 1990,
      "c1ccon1)": 1991,
      "c1nc(N2CC": 1992,
      "cc2[nH]1": 1993,
      "2NCC": 1994,
      ")N1CC(": 1995,
      "c2ccc(CN": 1996,
      "c2cc(C": 1997,
      "O=C(NCC1CCCO1)": 1998,
      "O=C(Nc1cn[nH]c1)": 1999,
      "COc1ccc(S(=O)(=O)N": 2000,
      "CC(C)C1": 2001,
      ")N1CCN(c2ccccc2)CC1": 2002,
      "=CC": 2003,
      "c3cccc(Cl)c3)": 2004,
      "COCc1ccccc1": 2005,
      "c(NC2CC": 2006,
      "c2ccccc2)CCN1": 2007,
      "CN(CCC#N)": 2008,
      "Cn1cccc1": 2009,
      "CC1CCN(": 2010,
      "O=C(NCCCO": 2011,
      "c2ccco2)c1": 2012,
      "c32)cc1": 2013,
      "c1coc(-": 2014,
      "ccc1=O)": 2015,
      "O=C1NCC": 2016,
      "c3ccccc3C)": 2017,
      "c1N": 2018,
      "c2nccn": 2019,
      "c1ccc(C2NCC": 2020,
      "O=C(NCCn1": 2021,
      "c1cccc(C(F)(F)F)c1": 2022,
      "c1ccc(C(F)(F)F)cc1": 2023,
      "c2cccc(C(=O)N": 2024,
      "c3ccc(C)": 2025,
      "O=C1O": 2026,
      "CCS(=O)(=O)": 2027,
      "O=C(Nc1ccc2[nH]": 2028,
      "c(=O)n1": 2029,
      "c1c(F)cccc1F": 2030,
      "CCc1cccc(": 2031,
      "O=C(CNc1ccccc1)Nc1ccccc1": 2032,
      "(-c2ccccc2)n1": 2033,
      "nn1)": 2034,
      "c2cc(F)ccc2F)": 2035,
      "CC1CO": 2036,
      "c1cc(C2CC2)": 2037,
      "O=C1CCCN1c1ccccc1": 2038,
      "cc2)o1": 2039,
      "O=C(CSc1ncn": 2040,
      "c1ccc(-c2ccccc2)cc1": 2041,
      "O=C(Cc1ccc[nH]1": 2042,
      "O=C(c1ccncc1": 2043,
      "C1CC(=O)N(c2ccccc2)C1": 2044,
      "C(C)NC(=O)N": 2045,
      "c(-c2cccs2)": 2046,
      "c4n": 2047,
      "O=C(CN1CCN(": 2048,
      "(C)c1=O": 2049,
      "Cc1nccn1": 2050,
      "CC1=O)": 2051,
      "CN(CC(=O)N": 2052,
      "c3ccccc23)cc1": 2053,
      "Cc1cc(C)nc(": 2054,
      "c2ccc(F)cc2)C1": 2055,
      "c(O)c1": 2056,
      "c1cc(C#N)": 2057,
      "c2[nH]1": 2058,
      "CN2CCOCC2)": 2059,
      "3)cc2)cc1": 2060,
      "c2ccccc2)C1=O": 2061,
      "c2cccnc2)c1": 2062,
      "-2": 2063,
      "c2C#N)": 2064,
      "n1cccn1": 2065,
      "c2ccccc2)CC1)": 2066,
      "C(=O)N1CCOCC1": 2067,
      "c1nc2ncccn": 2068,
      "c1ccc(-n2ncc3": 2069,
      "c2nc(-": 2070,
      "c2cnn3": 2071,
      "O=C(NCC1(": 2072,
      "c2cn[nH]c2)cc1": 2073,
      "c2ncc(": 2074,
      "OCC2)n": 2075,
      "c1ccc(-c2cc[nH]n2)cc1": 2076,
      "c4[nH]": 2077,
      "CO2": 2078,
      "3)C1": 2079,
      "O=C(N1CC": 2080,
      "C(CNC(=O)": 2081,
      "O=c1[nH]c2ccccc2": 2082,
      "OCC2)C1": 2083,
      "C(=O)OCC(=O)": 2084,
      "(CCC#N)": 2085,
      "n3cncn3)": 2086,
      "CCOc1ccc(C(=O)N": 2087,
      "c3ccccc3)CC2)": 2088,
      "cc(-c3ccccc3)": 2089,
      "O=C(COc1ccccc1)NC": 2090,
      "c(-c2cccs2)n1": 2091,
      "c2nnc(C3CC3)": 2092,
      "C(=O)NC1": 2093,
      "3CC4": 2094,
