{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 60,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 60
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": "(\\[[^\\]]+]|<|Br?|Cl?|N|O|S|P|F|I|b|c|n|o|s|p|\\(|\\)|\\.|=|#|-|\\+|\\\\\\\\|\\/|:|~|@|\\?|>|\\*|\\$|\\%[0-9]{2}|[0-9])"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          0
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          1
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<bos>": 0,
      "<eos>": 1,
      "<pad>": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "(": 6,
      ")": 7,
      "*": 8,
      "+": 9,
      "-": 10,
      ".": 11,
      "/": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "6": 19,
      "7": 20,
      "8": 21,
      "9": 22,
      ":": 23,
      "<": 24,
      "=": 25,
      ">": 26,
      "?": 27,
      "@": 28,
      "B": 29,
      "C": 30,
      "F": 31,
      "H": 32,
      "I": 33,
      "N": 34,
      "O": 35,
      "P": 36,
      "S": 37,
      "[": 38,
      "\\": 39,
      "]": 40,
      "b": 41,
      "c": 42,
      "l": 43,
      "n": 44,
      "o": 45,
      "p": 46,
      "r": 47,
      "s": 48,
      "~": 49,
      "cc": 50,
      "c1": 51,
      "CC": 52,
      "C(": 53,
      "c1cc": 54,
      "c2": 55,
      "O)": 56,
      "=O)": 57,
      "c(": 58,
      "O=": 59,
      "C(=O)": 60,
      "c1cccc": 61,
      "C)": 62,
      "c2cc": 63,
      "O=C(": 64,
      "2)": 65,
      "cn": 66,
      "c1ccccc1": 67,
      "1CC": 68,
      "c3": 69,
      "c1ccc(": 70,
      "1)": 71,
      "(=O)": 72,
      "c2cccc": 73,
      "CN": 74,
      "H]": 75,
      "[n": 76,
      "[nH]": 77,
      "cc1": 78,
      "CO": 79,
      "NC": 80,
      "n1": 81,
      "(C)": 82,
      "c1n": 83,
      "c2ccccc2": 84,
      "F)": 85,
      "C(=O)N": 86,
      "2CC": 87,
      "c1ccccc1)": 88,
      "C1": 89,
      "CC1": 90,
      "O=C(N": 91,
      "N1CC": 92,
      "3)": 93,
      "NC(=O)": 94,
      "c2n": 95,
      "c3cc": 96,
      "c1)": 97,
      "cs": 98,
      "2)cc1": 99,
      "(C": 100,
      "C1CC": 101,
      "c1cn": 102,
      "n2": 103,
      "C(C)": 104,
      "OCC": 105,
      "S(=O)": 106,
      "c2ccccc2)": 107,
      "CCC": 108,
      "c(-": 109,
      "N)": 110,
      "c2)": 111,
      "N(": 112,
      "O=C(NC": 113,
      "c(C)": 114,
      "CC(=O)": 115,
      "O=C(C": 116,
      "c3cccc": 117,
      "l)": 118,
      "(-": 119,
      "nn": 120,
      "c(C": 121,
      "c1ccc(-": 122,
      "S(=O)(=O)": 123,
      "CCO": 124,
      "c2c(": 125,
      "co": 126,
      "(F)": 127,
      "ncc": 128,
      "2)c1": 129,
      "CC(C)": 130,
      "c(=O)": 131,
      "c3ccccc3": 132,
      "NCC": 133,
      "Cc1cc": 134,
      "c1nn": 135,
      "c1cccc(": 136,
      "CNC(=O)": 137,
      "c[nH]": 138,
      "1)N1CC": 139,
      "cccc": 140,
      "CC(": 141,
      "1)N": 142,
      "OC": 143,
      "c2ccc(": 144,
      "cccn": 145,
      "N2CC": 146,
      "CCC1": 147,
      "2)n": 148,
      "3CC": 149,
      "CN(": 150,
      "c2c(c1)": 151,
      "=O": 152,
      "O=C(NCC": 153,
      "c1ccn": 154,
      "CCN": 155,
      "O=C(Nc1ccccc1)": 156,
      "c1ccc2c(c1)": 157,
      "c2c1": 158,
      "Cc1ccc(": 159,
      "O=C(CC": 160,
      "Cc1n": 161,
      "c2cn": 162,
      "CC(=O)N": 163,
      "C2": 164,
      "cc2": 165,
      "c4": 166,
      "c1cccn": 167,
      "ccc1": 168,
      "COc1ccc(": 169,
      "O=S(=O)": 170,
      "#N)": 171,
      "o1": 172,
      "cc(": 173,
      "OC)": 174,
      "s1": 175,
      "COC(=O)": 176,
      "3)n": 177,
      "1)c1ccccc1": 178,
      "c1ccccc1)N": 179,
      "2)CC1": 180,
      "NC1CC": 181,
      "c1cc(": 182,
      "[nH]1": 183,
      "C2CC": 184,
      "O=S(=O)(": 185,
      "cs1": 186,
      "CC2": 187,
      "c1ccccc1)N1CC": 188,
      "cn1": 189,
      "N(C(=O)": 190,
      "Cn1": 191,
      "Cl)": 192,
      "ccn": 193,
      "c12": 194,
      "c2nn": 195,
      "c1cs": 196,
      "ccc2": 197,
      "NC(=O)N": 198,
      "C(=O)NC": 199,
      "c1ncc": 200,
      "O=C1": 201,
      "F)cc": 202,
      "2)n1": 203,
      "c3ccccc3)": 204,
      "c1ccc(-n2": 205,
      "Br": 206,
      "C(F)": 207,
      "(Cl)": 208,
      "c1ccco": 209,
      "[nH]c1": 210,
      "O=c1": 211,
      "c3)": 212,
      "c(Cl)": 213,
      "CS": 214,
      "CCCC": 215,
      "n1)": 216,
      "O=C(Cn1": 217,
      "c2[nH]": 218,
      "c3n": 219,
      "c1cc2": 220,
      "CN1CC": 221,
      "(C)C)": 222,
      "O=C1CC": 223,
      "C1CC1": 224,
      "2)C1": 225,
      "4)": 226,
      "(F)F)": 227,
      "C(=O)N1CC": 228,
      "c2ccccc21": 229,
      "N1": 230,
      "C(=O)N2CC": 231,
      "O=C(CO": 232,
      "1)Nc1ccccc1": 233,
      "n3": 234,
      "Br)": 235,
      "CN2CC": 236,
      "OCC1": 237,
      "c(-c2cc": 238,
      "(CC": 239,
      "C(N)": 240,
      "c3c(": 241,
      "C(C)C)": 242,
      "CN(C(=O)": 243,
      "CN(C)": 244,
      "O=C(CS": 245,
      "CN1": 246,
      "N(C": 247,
      "O=C(NCc1ccccc1)": 248,
      "(-c2ccccc2)": 249,
      "c1)N1CC": 250,
      "Cc1cc(": 251,
      "c2cc(": 252,
      "Cc1ccccc1": 253,
      "c(NC(=O)": 254,
      "c1cccnc1": 255,
      "CC1CC": 256,
      "O=C(NC1CC": 257,
      "c(C)c1": 258,
      "nc1": 259,
      "c1cnn": 260,
      "c2ncc": 261,
      "CCNC(=O)": 262,
      "OCCO": 263,
      "c2s": 264,
      "c2cccn": 265,
      "OCO": 266,
      "c1cccc2": 267,
      "CCn1": 268,
      "c2)cc1": 269,
      "O=c1[nH]": 270,
      "c(S": 271,
      "n2)cc1": 272,
      "F)cc1": 273,
      "CN(C": 274,
      "1)c1cc": 275,
      "N#": 276,
      "Cc1": 277,
      "CC2)": 278,
      "C(N)=O)": 279,
      "c1cccs": 280,
      "c2ncn": 281,
      "c(-c3cc": 282,
      "c(N": 283,
      "Cn2": 284,
      "c(C(=O)N": 285,
      "NCc1ccccc1": 286,
      "2)nc1": 287,
      "CCOC(=O)": 288,
      "C=": 289,
      "NCC1": 290,
      "C(F)(F)F)": 291,
      "Cl": 292,
      "CCC2": 293,
      "c(F)": 294,
      "sc1": 295,
      "c1ccccc1)Nc1ccccc1": 296,
      "c(C)n": 297,
      "C2)": 298,
      "c1=O": 299,
      "c1c[nH]": 300,
      "CCN1": 301,
      "c(-c2ccccc2)": 302,
      "c1ccccn1": 303,
      "N(CC": 304,
      "OCC(=O)": 305,
      "c1ccncc1": 306,
      "c2ccccc12": 307,
      "c1cco": 308,
      "c1ncn": 309,
      "3)cc1": 310,
      "Cc1cccc(": 311,
      "c2ccn": 312,
      "s1)": 313,
      "c1cccc(-": 314,
      "c12)": 315,
      "c(=O)[nH]": 316,
      "Nc1ccccc1": 317,
      "n2)": 318,
      "c(C2CC": 319,
      "cncn": 320,
      "c1nc2ccccc2": 321,
      "(C)C": 322,
      "c1cn[nH]c1": 323,
      "c1ccc(-c2n": 324,
      "c2ccccc2)cc1": 325,
      "cccc2": 326,
      "c2cccc(": 327,
      "CC(=O)N1CC": 328,
      "c1ccco1": 329,
      "(=O)=O)": 330,
      "c1=O)": 331,
      "c(N)": 332,
      "c2ccccc2)CC1": 333,
      "c3c(c2)": 334,
      "C(=O)NCC": 335,
      "S(=O)(=O)N": 336,
      "c2)c1": 337,
      "c1cn[nH]": 338,
      "COc1ccccc1": 339,
      "Cc1nn": 340,
      "CC(C)(C)": 341,
      "c1ccc(Cl)": 342,
      "O=C(c1ccccc1)N1CC": 343,
      "c1cccnc1)": 344,
      "C(C)(C)C)": 345,
      "C#N)": 346,
      "ncc2": 347,
      "c1cccs1": 348,
      "c1ccc2[nH]": 349,
      "c1ccc(CN": 350,
      "c2ccco": 351,
      "O=C(CN": 352,
      "cnn": 353,
      "cc1)": 354,
      "c2cs": 355,
      "C)cc1": 356,
      "c1ccccc1)c1ccccc1": 357,
      "c1ccc(NC(=O)": 358,
      "c1cc(-": 359,
      "c(N2CC": 360,
      "ccccc2": 361,
      "C(O)": 362,
      "c2ccc3c(c2)": 363,
      "(C)n": 364,
      "c2ccc(F)cc": 365,
      "c2cccs": 366,
      "c(CN": 367,
      "C(C)=O)": 368,
      "o2)cc1": 369,
      "ccn1": 370,
      "cc2)": 371,
      "c1ccncc": 372,
      "(C#N)": 373,
      "ncn": 374,
      "1)C1CC": 375,
      "c1ccc[nH]": 376,
      "c1ccccn1)": 377,
      "CN(C)C(=O)": 378,
      "c1ccc(F)cc1": 379,
      "c1ccc(N2CC": 380,
      "COc1cccc(": 381,
      "S(C)": 382,
      "NS(=O)(=O)": 383,
      "3)CC": 384,
      "on": 385,
      "c2n1": 386,
      "c1no": 387,
      "c3ncc": 388,
      "CCCC1": 389,
      "O=C(CNC(=O)": 390,
      "c1C": 391,
      "CCC2)": 392,
      "c(=O)n": 393,
      "NC2": 394,
      "NC1": 395,
      "c2=O)": 396,
      "c(C#N)": 397,
      "CCCn1": 398,
      "-c1ccccc1": 399,
      "c(F)cc": 400,
      "Cc1no": 401,
      "c1n[nH]": 402,
      "c1cno": 403,
      "3)C": 404,
      "c2ccc(Cl)": 405,
      "c1ccc2c(c1)OCO": 406,
      "CC1)": 407,
      "c2ccc(F)": 408,
      "O=C(CN1CC": 409,
      "c1cn[nH]c1)": 410,
      "c2ccccc2)C1": 411,
      "c4cccc": 412,
      "[nH]n1": 413,
      "C#": 414,
      "c2ccncc": 415,
      "C(C)C": 416,
      "O=C(NCC1CC": 417,
      "CC)": 418,
      "cnnn": 419,
      "CCC(=O)N": 420,
      "1)N1CCCCC1": 421,
      "NC2CC": 422,
      "c3cn": 423,
      "c(C3CC": 424,
      "c(OC)": 425,
      "(C2CC": 426,
      "CC(O)": 427,
      "COCC": 428,
      "c2C)": 429,
      "Cc2ccccc2": 430,
      "c2cnn": 431,
      "COc1cc(": 432,
      "OC(=O)": 433,
      "[nH]n": 434,
      "O=C(Nc1ccccc1)c1ccccc1": 435,
      "OC(": 436,
      "N(C)": 437,
      "c2ccccc12)": 438,
      "c1s": 439,
      "n12": 440,
      "c(C)cc": 441,
      "NCC1CC": 442,
      "c1co": 443,
      "-n1": 444,
      "CNC(=O)N": 445,
      "CO1": 446,
      "c1ccc2n": 447,
      "c3nn": 448,
      "3CCCC": 449,
      "C3": 450,
      "no": 451,
      "c1ccccc1)NC": 452,
      "c2ncccn": 453,
      "cnc1": 454,
      "O=S(=O)(N": 455,
      "c2)CC1": 456,
      "cc(-": 457,
      "CCC(": 458,
      "1)NC": 459,
      "COc2ccccc2": 460,
      "c1ccccn": 461,
      "c2nccs": 462,
      "1)NC1CC": 463,
      "CC(NC(=O)": 464,
      "CCC(C)": 465,
      "O=C(C1CC": 466,
      "c1ccc(OC": 467,
      "(O)": 468,
      "3CCOCC": 469,
      "c(-c3ccccc3)": 470,
      "CCC3)": 471,
      "c1cc2c(": 472,
      "S(C)(=O)=O)": 473,
      "CN1C(=O)": 474,
      "c2cn[nH]": 475,
      "cn2)cc1": 476,
      "1)N1CCCC1": 477,
      "cnc2": 478,
      "c1cccc(F)": 479,
      "c4ccccc4": 480,
      "c2ccccn": 481,
      "OCCO2": 482,
      "COc1cc": 483,
      "O=C1CC(": 484,
      "c1cc2ccccc2": 485,
      "CCCC2": 486,
      "c1ccc(F)": 487,
      "n2cccn": 488,
      "O1": 489,
      "CC2)cc1": 490,
      "cc3": 491,
      "[nH]2)cc1": 492,
      "c2nc3ccccc3": 493,
      "2)no1": 494,
      "c1cccc(NC(=O)": 495,
      "CCN(CC": 496,
      "Cc1cc(C)": 497,
      "c2)n": 498,
      "O=S(=O)(NC": 499,
      "ccc2c1": 500,
      "2)s1": 501,
      "O=C(CSc1nn": 502,
      "c1ccc(O": 503,
      "c2o": 504,
      "O=C(CCn1": 505,
      "(N)": 506,
      "c2cc3": 507,
      "c1ccc(NC": 508,
      "n1C": 509,
      "[nH]1)": 510,
      "c3s": 511,
      "on1": 512,
      "CCC1)": 513,
      "cnc2c1": 514,
      "ccc21": 515,
      "CC2=O)": 516,
      "c1nccs1": 517,
      "nc2": 518,
      "c1ccs": 519,
      "c1ccc(CN2CC": 520,
      "N2CCOCC": 521,
      "c1nc(": 522,
      "O=c1cc": 523,
      "c1ccco1)": 524,
      "c1ccc(Cn2": 525,
      "c1ccc(Cl)cc1": 526,
      "CN2": 527,
      "n3)": 528,
      "CC(C": 529,
      "c2)n1": 530,
      "c2cccc(F)": 531,
      "Cc1cs": 532,
      "O=C(O": 533,
      "CS(=O)(=O)": 534,
      "c2ccs": 535,
      "c1ccc(-c2nn": 536,
      "CCN(C": 537,
      "c1ccc(N": 538,
      "ccc3": 539,
      "c23)": 540,
      "c1ccc(OCC": 541,
      "c1)c1ccccc1": 542,
      "C(F)(F)": 543,
      "cn2": 544,
      "c1cccs1)": 545,
      "OCC(=O)N": 546,
      "cc12": 547,
      "C1(": 548,
      "c1cn2": 549,
      "C(NC(=O)": 550,
      "O=C(COC(=O)": 551,
      "c1ccc(-n2cccn": 552,
      "(F)(F)F)": 553,
      "c1ccc(=O)": 554,
      "C(C": 555,
      "cnc3)": 556,
      "N1CCOCC1": 557,
      "c1nc(-c2cc": 558,
      "c1ccsc1": 559,
      "C2(CC": 560,
      "O=C(Nc1nn": 561,
      "C1=": 562,
      "N1CCCC1": 563,
      "c1nnn": 564,
      "C(=O)NC2CC": 565,
      "o2)": 566,
      "c1cc(F)": 567,
      "(C)c1": 568,
      "c2cc(F)": 569,
      "CCOCC": 570,
      "1)N1CCOCC1": 571,
      "c(F)c1": 572,
      "c1cccc(Cl)": 573,
      "C(=O)N(C)": 574,
      "cccc1": 575,
      "c(NC": 576,
      "3)n2)cc1": 577,
      "Cc1ccc(NC(=O)": 578,
      "c1ccccc1)N1CCCCC1": 579,
      "c[nH]1": 580,
      "C3)": 581,
      "Cn1cc(": 582,
      "c1ccc(CC": 583,
      "c2ccc(C)": 584,
      "c3[nH]": 585,
      "c3ncn": 586,
      "c1ccc2c(c1)CC": 587,
      "n1-": 588,
      "NC1CC1": 589,
      "c2n1CC": 590,
      "c2ccc(-": 591,
      "O=C(c1cn": 592,
      "cccn1": 593,
      "C(C)(C)": 594,
      "o1)": 595,
      "c2cc(-": 596,
      "C(C)NC(=O)": 597,
      "c1cscn": 598,
      "1)N1CCC(": 599,
      "CCN1C(=O)": 600,
      "c2ccccc2F)": 601,
      "c21": 602,
      "CC(=O)NC": 603,
      "c(=O)[nH]1": 604,
      "c1ccn[nH]1": 605,
      "3CC3)": 606,
      "c(SC": 607,
      "c1ccc2c(c1)OCO2": 608,
      "c2ccc(F)cc2": 609,
      "N1CCCCC1": 610,
      "Oc1ccccc1": 611,
      "CCCNC(=O)": 612,
      "c2cccc3": 613,
      "CCOc1ccc(": 614,
      "c2ccccc2C1": 615,
      "c2cccnc2)": 616,
      "CC2)c1": 617,
      "C2)cc1": 618,
      "O=C(OC": 619,
      "nc(C)": 620,
      "OC2CC": 621,
      "ccnn": 622,
      "NC1CCCCC1": 623,
      "CC(C)C)": 624,
      "C1CCCCC1": 625,
      "c2no": 626,
      "CC1(": 627,
      "c2ccco2)": 628,
      "O=C(NCCc1ccccc1)": 629,
      "OCC1)": 630,
      "c2ccccc2)n": 631,
      "C1CCN(C(=O)": 632,
      "CC2CC": 633,
      "c(=O)o": 634,
      "nc(": 635,
      "c2c[nH]": 636,
      "c1ccc2ccccc2": 637,
      "C(=O)O": 638,
      "c1cnn(-c2ccccc2)": 639,
      "c1nccs1)": 640,
      "c3ccc(F)cc": 641,
      "ccc1F": 642,
      "c4cc": 643,
      "c3ccccc32)cc1": 644,
      "CCOc1ccccc1": 645,
      "Cc1nc(": 646,
      "CC(=O)N2CC": 647,
      "CCN(CC)": 648,
      "c2cco": 649,
      "c2ccccn2)": 650,
      "CNS(=O)(=O)": 651,
      "CCN1CC": 652,
      "c1cc(Cl)": 653,
      "C1)": 654,
      "c1ccc(C": 655,
      "C1CCCC1": 656,
      "c1ccncc1)": 657,
      "Cc1cn": 658,
      "c(C)nn": 659,
      "OC1": 660,
      "c2nc(-c3cc": 661,
      "c2ccccc21)": 662,
      "CC(=O)NCC": 663,
      "CCN2": 664,
      "c1cccc(-n2": 665,
      "cc2)c1": 666,
      "c1ccccc1)NCc1ccccc1": 667,
      "c2cc(C)": 668,
      "CCO1": 669,
      "O=C1N": 670,
      "c2cc[nH]": 671,
      "C1CC(=O)": 672,
      "c1cccc(F)c1": 673,
      "c1ccsc1)": 674,
      "cc(C(=O)N": 675,
      "c2cccc(Cl)": 676,
      "O=C(Cc1ccccc1)N": 677,
      "Cc1cc(NC(=O)": 678,
      "CCN(": 679,
      "O=C(COc1ccccc1)N": 680,
      "cc2)cc1": 681,
      "ccnc1": 682,
      "c1ccc(-c2cs": 683,
      "CCS": 684,
      "3)c1": 685,
      "c1cscn1": 686,
      "C2)c1": 687,
      "OC)c1": 688,
      "cs1)": 689,
      "3CCOCC3)": 690,
      "c2nnn": 691,
      "2)cc": 692,
      "Cc2ccccc21": 693,
      "co3)": 694,
      "c2cc(Cl)": 695,
      "c1nc(-c2ccccc2)": 696,
      "c2ccccn2)cc1": 697,
      "c1ccc(F)cc": 698,
      "Cc1cc(C)n": 699,
      "Cc1noc(C)c1": 700,
      "cc21": 701,
      "c1ccc(C(=O)N": 702,
      "c1ncccc1": 703,
      "S(=O)(=O)N2CC": 704,
      "c2ccccc2)c1": 705,
      "c1ccccc1)NCC": 706,
      "4CC": 707,
      "CN(CC": 708,
      "nn1": 709,
      "c1cccnc1)N1CC": 710,
      "c1ccc2c(c1)OCCO2": 711,
      "CO2": 712,
      "(=O)[nH]": 713,
      "c2cccs2)": 714,
      "c1nncs1": 715,
      "CN2CCOCC": 716,
      "c1nc2c(": 717,
      "COc1ccc(NC(=O)": 718,
      "c1cccc(Cl)c1": 719,
      "C2CC2)cc1": 720,
      "O=S(=O)(C": 721,
      "c1ccc(-c2cn": 722,
      "c1ccc2c(c1)OCO2)": 723,
      "OC2": 724,
      "c(CS": 725,
      "c(Cl)c1": 726,
      "Cc1nn(C)": 727,
      "c3cccnc3)": 728,
      "O=C(Nc1ccn": 729,
      "(=O)=O": 730,
      "c(CC": 731,
      "c2ccc(F)cc2)": 732,
      "c2ncccc2": 733,
      "n2c1": 734,
      "ccc2N1": 735,
      "OCC1CC": 736,
      "[nH]c(=O)": 737,
      "C(=O)NC(C)": 738,
      "Br)cc1": 739,
      "1)N1CCN(": 740,
      "C(C#N)": 741,
      "s2)": 742,
      "c1cnoc1": 743,
      "(-c3ccccc3)": 744,
      "c(OC)c1": 745,
      "O=C(NCc1ccccc1)c1ccccc1": 746,
      "(CO)": 747,
      "O=C(Cn1cn": 748,
      "c2cnccn": 749,
      "ncc3": 750,
      "c4c(": 751,
      "n2C)": 752,
      "n3cccn": 753,
      "O=C(Cn1cc": 754,
      "Cl)cc1": 755,
      "[nH]c1=O)": 756,
      "c1ccc(C2": 757,
      "cs3)": 758,
      "c1cnccn1": 759,
      "O=C(CCC": 760,
      "o2)c1": 761,
      "[nH]c1=O": 762,
      "O=C(NCCO": 763,
      "cccn1)": 764,
      "CC(N)": 765,
      "O=C(CC1CC": 766,
      "CC(C)NC(=O)": 767,
      "C2CC2)": 768,
      "1)c1cccs1": 769,
      "c2)C1": 770,
      "C1CCN(": 771,
      "O=S(=O)(c1ccccc1)N1CC": 772,
      "CCCC2)": 773,
      "c1cccc2c1": 774,
      "c2C1": 775,
      "=C(": 776,
      "c1nc[nH]": 777,
      "C(N)=O": 778,
      "c2ccc3c(c2)OCO": 779,
      "O=C(Nc1ccccc1": 780,
      "no1": 781,
      "(N)(=O)=O)": 782,
      "CCC#N)": 783,
      "cc2c1": 784,
      "O=C(CC1": 785,
      "c1ccc(S": 786,
      "ccc12": 787,
      "c1ccc(C)": 788,
      "[nH]2)": 789,
      "c1ccc2o": 790,
      "c1cnoc1)": 791,
      "CCC3": 792,
      "O)cc1": 793,
      "CCc1n": 794,
      "S(=O)(=O)N1CC": 795,
      "3)nc2c1": 796,
      "Cn1cn": 797,
      "cs2)": 798,
      "CCc1": 799,
      "c1ccc[nH]1": 800,
      "3CCCC3)": 801,
      "NC(=O)N2CC": 802,
      "(C(=O)N": 803,
      "c2ccccc2N1": 804,
      "n2C": 805,
      "c(C)no": 806,
      "O=C(c1cc": 807,
      "O=C(NCCC": 808,
      "c1ccc(-n2cccn2)cc1": 809,
      "c1ccoc1": 810,
      "cc(Cl)": 811,
      "NCC2": 812,
      "c1ccc(-n2ccn": 813,
      "c2ccc(OC)": 814,
      "c2c(=O)": 815,
      "n2-": 816,
      "O=C1CCCN1": 817,
      "c1cccc2cccn": 818,
      "C(=O)OC": 819,
      "n2)c1": 820,
      "OC(C)": 821,
      "CCN(C(=O)": 822,
      "2CCCO": 823,
      "O=C(NCc1cccnc1)": 824,
      "(Cc2ccccc2)": 825,
      "N(C)C(=O)": 826,
      "c2-": 827,
      "c2ccccc2Cl)": 828,
      "c1nccs": 829,
      "c1nc(-": 830,
      "c1cnn(-": 831,
      "O=C(COc1ccccc1)Nc1ccccc1": 832,
      "c(=O)n(C)": 833,
      "CCN(C)": 834,
      "CO1)": 835,
      "Cc1ccn": 836,
      "c(O)": 837,
      "c2ccccn12": 838,
      "N#Cc1ccc(": 839,
      "c1c[nH]c2ccccc12)": 840,
      "c1cccc(C": 841,
      "c2c1)": 842,
      "c1ccc(-c2no": 843,
      "ncc2c1": 844,
      "c1cccc(N2CC": 845,
      "OCCO2)": 846,
      "CC(N)=O)": 847,
      "C3CC": 848,
      "O=S(=O)(NCC": 849,
      "C(=O)N1CCC(": 850,
      "c1csc(-": 851,
      "cn2)": 852,
      "1)N1CCNCC1": 853,
      "n2ccn": 854,
      "n12)": 855,
      "c1ccon1": 856,
      "N)cc1": 857,
      "C1CCNCC1": 858,
      "Cc1cccc(NC(=O)": 859,
      "cc(F)": 860,
      "c(C(=O)N2CC": 861,
      "c1ccccc1NC(=O)": 862,
      "NC(=O)N1CC": 863,
      "O=C(c1ccn": 864,
      "c3ccccc23)": 865,
      "NC1CCCC1": 866,
      "n1-c1ccccc1": 867,
      "c1ccc2c(c1)CCNC2": 868,
      "Cc1ccc(C)": 869,
      "c2ccc(NC(=O)": 870,
      "O=C(NCCN1CC": 871,
      "cs2)cc1": 872,
      "c1cccc(C)c1": 873,
      "Cc1n[nH]": 874,
      "CCc1nn": 875,
      "c(F)cccc1": 876,
      "C(F)F)": 877,
      "c1cncc(": 878,
      "c2nccs2)cc1": 879,
      "cc2)n1": 880,
      "c1cc(C)": 881,
      "NC(C)=O)": 882,
      "c3ncccn": 883,
      "nnc1": 884,
      "Cc1o": 885,
      "O=C(NCc1nn": 886,
      "c1ccc(OC)": 887,
      "c1cccc2cccc": 888,
      "c(CO": 889,
      "3)CC2)cc1": 890,
      "cccc2c1": 891,
      "O=C(Nc1ccccn1)": 892,
      "C2(": 893,
      "O=c1ccn": 894,
      "1)N(C": 895,
      "S(=O)(=O)NC": 896,
      "CCN(CC)C(=O)": 897,
      "=O)cc1": 898,
      "c2n[nH]": 899,
      "ccs": 900,
      "ccc1=O": 901,
      "c(CN2CC": 902,
      "CN2C(=O)": 903,
      "CNC": 904,
      "S1": 905,
      "n1cn": 906,
      "O=C1CO": 907,
      "C(C(=O)N": 908,
      "C(c2ccccc2)": 909,
      "c(C(C)C)": 910,
      "C)c1": 911,
      "Br)c1": 912,
      "n[nH]": 913,
      "Cc1cc(C(=O)N": 914,
      "c(C(F)(F)F)": 915,
      "CCNC(=O)N": 916,
      "c(NCC": 917,
      "c1ccc(-c2ccn": 918,
      "c(-c2ccco": 919,
      "C(=O)OC)": 920,
      "C1CC1)": 921,
      "Cn1cc": 922,
      "c1ccc(CS": 923,
      "Cc1cc2": 924,
      "CC2)n1": 925,
      "c2ccccc2c1=O)": 926,
      "4CC4)": 927,
      "2)cc1)": 928,
      "CCC2)cc1": 929,
      "c1cnc(N2CC": 930,
      "2)c1)": 931,
      "CSc1nn": 932,
      "c(C(=O)NC": 933,
      "cc3)": 934,
      "c2sccc2": 935,
      "(=O)N": 936,
      "c4)": 937,
      "c3ccccn3)": 938,
      "O=C(CCNC(=O)": 939,
      "S(=O)(=O)NCC": 940,
      "CC3)": 941,
      "C(F)(F)F": 942,
      "NCC2)cc1": 943,
      "CC2)n": 944,
      "c2ccccc2c1=O": 945,
      "c(CNC(=O)": 946,
      "O=S(=O)(Nc1ccccc1)c1ccccc1": 947,
      "N(c2ccccc2)C1": 948,
      "O=C1NCC": 949,
      "cnc3": 950,
      "n(C)": 951,
      "(CC(=O)N": 952,
      "c1ccc(-n2cncn": 953,
      "c3ccncc": 954,
      "c2ccc(-n3": 955,
      "c1ccc2[nH]cnc2c1": 956,
      "2CCC1": 957,
      "O=C(Nc1cccnc1)": 958,
      "c1ccc(CO": 959,
      "O=C(Nc1ccc2c(c1)": 960,
      "c(CO)": 961,
      "c2cc(F)ccc2": 962,
      "c2ccc(C#N)": 963,
      "c2cnn(C)": 964,
      "c23)cc1": 965,
      "c3ccccc32)": 966,
      "c1)N1CCCCC1": 967,
      "c1ccc(-n2ccnn": 968,
      "OCC2)cc1": 969,
      "3)CC1": 970,
      "O=c1[nH]c(=O)": 971,
      "Cc1ccc(C(=O)N": 972,
      "2)c1C": 973,
      "c1[nH]": 974,
      "C(=O)OCC": 975,
      "O=C(NCC(=O)N1CC": 976,
      "N1CCN(": 977,
      "O=C(Cc1ccccc1)N1CC": 978,
      "c2nc(C)": 979,
      "C#N)cc1": 980,
      "c1ccc(-n2cnnn": 981,
      "c3cn[nH]": 982,
      "oc1": 983,
      "co1": 984,
      "CC(C)(C)O": 985,
      "C(c1ccccc1)": 986,
      "CC3": 987,
      "nn3": 988,
      "c1ccoc1)": 989,
      "COc1ccc(OC)": 990,
      "n1CC": 991,
      "c(C3CC3)n": 992,
      "O=C(Nc1nccs1)": 993,
      "CCc1ccc(": 994,
      "1)N1CCN(C": 995,
      "c(SCC(=O)N": 996,
      "CCNS(=O)(=O)": 997,
      "ccc1Cl": 998,
      "C(C)C(=O)N": 999,
      "c2cccnc2)cc1": 1000,
      "C(N": 1001,
      "OC(C)(C)C)": 1002,
      "CO3)": 1003,
      "c1cc(-c2ccccc2)": 1004,
      "c3c2": 1005,
      "c1cc2cccc": 1006,
      "C(=O)N1CCN(": 1007,
      "c2ccco2)cc1": 1008,
      "c1nc(C2CC": 1009,
      "c2cc(NC(=O)": 1010,
      "C2(CC1)": 1011,
      "c(N3CC": 1012,
      "c2ccc(Br)": 1013,
      "O=c1cc(": 1014,
      "c1cc2c(cc1": 1015,
      "c1cc[nH]n1": 1016,
      "O=C(NCC1": 1017,
      "c1cncs1": 1018,
      "nc1-": 1019,
      "c1ccccc1F)": 1020,
      "ccccc1=O)": 1021,
      "c(C2": 1022,
      "C(=O)NC1CC": 1023,
      "c1ccc(C2CC": 1024,
      "c2cccc(-": 1025,
      "O=C(c1ccccc1)N1CCCCC1": 1026,
      "CNC1": 1027,
      "NC(=O)NCC": 1028,
      "c2c(F)": 1029,
      "O2": 1030,
      "c1ccc2s": 1031,
      "N2": 1032,
      "c2ccc(N": 1033,
      "CC1(C)": 1034,
      "C(C)(C)C": 1035,
      "C(C)C)cc1": 1036,
      "c2ccncc2)": 1037,
      "CO)": 1038,
      "S(C)(=O)=O": 1039,
      "c3ccccn": 1040,
      "2)n[nH]1": 1041,
      "c1nc2c(s1)": 1042,
      "c(C3CC3)": 1043,
      "O=C(Nc1cn[nH]c1)": 1044,
      "c3n2)cc1": 1045,
      "O=C(Nc1ccccc1)N": 1046,
      "cc2)CC1": 1047,
      "c1cc2c(s1)": 1048,
      "ccc1C": 1049,
      "c(C)n1": 1050,
      "CC(N": 1051,
      "nccc1": 1052,
      "c2cccc(C)": 1053,
      "O=C1CN(C(=O)": 1054,
      "Sc1nn": 1055,
      "NCCc1ccccc1": 1056,
      "c2C)cc1": 1057,
      "C1CO": 1058,
      "c4c(c3)": 1059,
      "CCn1cc(": 1060,
      "CN(C(=O)N": 1061,
      "c3ccco3)": 1062,
      "c1ccc(F)cc1)": 1063,
      "c1ncc(": 1064,
      "c1ccc2c(c1)OCC": 1065,
      "(-c2ccccc2)n1": 1066,
      "S(N)(=O)=O)": 1067,
      "n4": 1068,
      "COC": 1069,
      "O=C(Cn1cccn": 1070,
      "nc(-": 1071,
      "c2ccc(C(=O)N": 1072,
      "O=C(NCCCn1": 1073,
      "cc2N1": 1074,
      "c3ccccc32)c1": 1075,
      "c2ccc(F)c(F)": 1076,
      "c2nc[nH]": 1077,
      "c2)nc1": 1078,
      "O=C(COc1ccccc1)": 1079,
      "c1c(F)cccc1": 1080,
      "c1ccc(CNc2ccccc2)cc1": 1081,
      "=C": 1082,
      "1)N1CCCC(": 1083,
      "ccc1NC(=O)": 1084,
      "c1ccccn1)c1ccccc1": 1085,
      "O=C(NC1CC1)": 1086,
      "c2nncn2": 1087,
      "n2)CC1": 1088,
      "c2nco": 1089,
      "c2c(C)": 1090,
      "c3cs": 1091,
      "c2cc1": 1092,
      "O=C(NCc1ccccc1)N": 1093,
      "c2=O)cc1": 1094,
      "=CC": 1095,
      "COc1cc(C)": 1096,
      "c4ccccc4)": 1097,
      "n2cncn": 1098,
      "CC(=O)N(C)": 1099,
      "c1cc(C2CC": 1100,
      "3)CC2)": 1101,
      "c2cc3c(": 1102,
      "c1cncnc1": 1103,
      "c[nH]2)cc1": 1104,
      "O=C(OCC": 1105,
      "c1ccnc(": 1106,
      "O=c1[nH]cn": 1107,
      "c1cn(-c2ccccc2)": 1108,
      "O=S(=O)(NC1CC": 1109,
      "CCO2": 1110,
      "c1ccc(-n2ccnn2)cc1": 1111,
      "n2cccc": 1112,
      "c1c(C)": 1113,
      "[nH]1)c1ccccc1": 1114,
      "CCC1CC": 1115,
      "c2ccccn12)": 1116,
      "cc(C)": 1117,
      "C#N": 1118,
      "c1ccno1": 1119,
      "n23)cc1": 1120,
      "O=C(Cc1ccccc1)Nc1ccccc1": 1121,
      "co2)cc1": 1122,
      "3cccc": 1123,
      "s2)cc1": 1124,
      "c(N)n": 1125,
      "C(=O)Nc1ccccc1": 1126,
      "c1ccc(F)c(F)c1": 1127,
      "CO2)": 1128,
      "O=C(NCc1cn[nH]c1)": 1129,
      "O=C(COc1ccccc1)N1CC": 1130,
      "c1scnc1": 1131,
      "c2c(F)cccc2": 1132,
      "CN1CCN(C(=O)": 1133,
      "CC1)c1ccccc1": 1134,
      "Cc1cccnc1": 1135,
      "O=C(c1ccccc1)": 1136,
      "=O)Nc1ccccc1": 1137,
      "c2)s1": 1138,
      "c1ccc(Br)cc1": 1139,
      "c2ccc(O)": 1140,
      "Oc2ccccc21": 1141,
      "c3C)": 1142,
      "O=C(CSc1n": 1143,
      "c2ccc3c(c2)OCCO": 1144,
      "NC(=O)NC": 1145,
      "O=C(NCc1ccco": 1146,
      "O=C(c1cccnc1)N1CC": 1147,
      "n2cnn": 1148,
      "O=C(NCCn1": 1149,
      "COc1ccc(C(=O)N": 1150,
      "c2ccc(Cl)cc2": 1151,
      "c1ccc2c(c1)CCC2": 1152,
      "c3ccc(Cl)": 1153,
      "c1ccc(-n2nn": 1154,
      "c1c[nH]c2ccccc12": 1155,
      "c1)N1CCCC1": 1156,
      "c1cncc(-": 1157,
      "OCC2)": 1158,
      "COCCNC(=O)": 1159,
      "O=C(Nc1ccccc1)N1CC": 1160,
      "CCC1)c1ccccc1": 1161,
      "C(O": 1162,
      "(CC)": 1163,
      "c1cc(N2CC": 1164,
      "c1cc2ccccc2o1": 1165,
      "CCCCC1": 1166,
      "CC2=O)cc1": 1167,
      "c3ccccc3F)": 1168,
      "c(-c4cc": 1169,
      "c1cnc2[nH]": 1170,
      "O=C(Nc1ccccc1)C1CC": 1171,
      "c1cnn(-c2ccccc2)c1": 1172,
      "CC(=O)Nc1ccc(": 1173,
      "n(": 1174,
      "c1cccc(F)c1)": 1175,
      "2)nn1": 1176,
      "1)C2": 1177,
      "3CCCC3": 1178,
      "N(C2CC": 1179,
      "c1cc(Br)": 1180,
      "C(C(N)=O)": 1181,
      "O=C(Cn1nn": 1182,
      "c2cc(C(=O)N": 1183,
      "c2ccccc2n1": 1184,
      "c2n(": 1185,
      "3)C2)cc1": 1186,
      "n3cccn3)": 1187,
      "c2cc3cccc": 1188,
      "O=S1": 1189,
      "CCc1no": 1190,
      "2)ncn1": 1191,
      "c3cnccn": 1192,
      "O=C(NC1": 1193,
      "n2cn": 1194,
      "cc(OC)c1": 1195,
      "cccc3": 1196,
      "Cn1nn": 1197,
      "O=C(CSc1nnc[nH]": 1198,
      "C1COc2ccccc2": 1199,
      "(F)F": 1200,
      "c1nc2ccccc2[nH]1": 1201,
      "c2ccncc2)cc1": 1202,
      "CC(C)O": 1203,
      "OCC2": 1204,
      "O=C(NCCNC(=O)": 1205,
      "N(CCO)": 1206,
      "c3cccc(F)": 1207,
      "c1nco": 1208,
      "CN(C)S(=O)(=O)": 1209,
      "c2cc(C)n": 1210,
      "c2ccccc21)N": 1211,
      "3CCCCC3)": 1212,
      "Cc1nn(C)c(C)c1": 1213,
      "NC1=O": 1214,
      "O=C(CCO": 1215,
      "cc(C": 1216,
      "ccc1O": 1217,
      "CCC(=O)": 1218,
      "cc12)": 1219,
      "CCC(C)NC(=O)": 1220,
      "c3cccs3)": 1221,
      "c2ccc(N)": 1222,
      "c3nccs": 1223,
      "Nc1n": 1224,
      "c1ccc2ccccc2c1": 1225,
      "c3)n": 1226,
      "NCC1CCCO1": 1227,
      "c2cccnc2": 1228,
      "c1ccc2ncccc2c1": 1229,
      "c1cccs1)N": 1230,
      "(NC(=O)": 1231,
      "c1nc2ccccc2s1": 1232,
      "c2nnc(-c3cc": 1233,
      "C2)n1": 1234,
      "O=C(CCC(=O)": 1235,
      "c1cc(C(=O)N": 1236,
      "C(N)=O)cc1": 1237,
      "c1cccc(C(=O)N": 1238,
      "CCCO)": 1239,
      "c2cccs2)cc1": 1240,
      "c(-c2cccs": 1241,
      "C=CCNC(=O)": 1242,
      "c2ncccn2)CC1": 1243,
      "ccc1OC": 1244,
      "4)n": 1245,
      "1)NC1CCCCC1": 1246,
      "=O)N": 1247,
      "o3)": 1248,
      "O=C(CCC1CC": 1249,
      "Cc1nc(C)": 1250,
      "O=C(Cc1ccccc1)": 1251,
      "O=C(Oc1ccccc1)": 1252,
      "S(=O)(=O)N(C)": 1253,
      "c2ccc(F)cc2F)": 1254,
      "c1ccc(-c2cc": 1255,
      "CCC(CC)": 1256,
      "c2ccccc2o1": 1257,
      "o2)CC1": 1258,
      "n2n1": 1259,
      "c1ccc(C(=O)N2CC": 1260,
      "C(F)(F)F)cc": 1261,
      "c1cnn(CC": 1262,
      "c(-c2ccccc2)n": 1263,
      "Cc1cc(=O)": 1264,
      "cc(Br)": 1265,
      "O=C(Nc1cc": 1266,
      "O=C(NCc1ccncc": 1267,
      "c(C(=O)": 1268,
      "O=C(c1ccco": 1269,
      "c1ccc(C)cc1": 1270,
      "cn[nH]": 1271,
      "CC(CC(C": 1272,
      "COC2": 1273,
      "c1cc2ccccc2o": 1274,
      "(C)n1": 1275,
      "c2[nH]n": 1276,
      "N(C(=O)N": 1277,
      "CC(C)n1": 1278,
      "2)cn1": 1279,
      "Cc1ccc2c(c1)": 1280,
      "CSc1n": 1281,
      "c1cc(=O)": 1282,
      "nn2)cc1": 1283,
      "nc1S": 1284,
      "C(C)N": 1285,
      "O=C(c1cco": 1286,
      "1)NCc1ccccc1": 1287,
      "c(C)c(C)": 1288,
      "c1ccc2c(c1)CCN2": 1289,
      "c1ccc2c(c1)OCCO2)": 1290,
      "c2s1": 1291,
      "NC(=O)N(C)": 1292,
      "c2C)c1": 1293,
      "CCCO": 1294,
      "c1cn[nH]c1)N1CC": 1295,
      "CCC(=O)N1CC": 1296,
      "c2ccc3c(c2)OCO3)": 1297,
      "C(CO)": 1298,
      "C(C)S": 1299,
      "C2CC2)c1": 1300,
      "c2ccccc2)n1": 1301,
      "C(F)(F)F)cc1": 1302,
      "Cc1s": 1303,
      "CC(C(=O)N": 1304,
      "C(C)C)c1": 1305,
      "c1cccc(-n2cnnn": 1306,
      "c2ccc(Cl)cc2)": 1307,
      "O=C(CCS": 1308,
      "Cn1n": 1309,
      "O=C(c1cccs": 1310,
      "O=c1c2ccccc2": 1311,
      "c2)cn1": 1312,
      "c1ccc(CNC": 1313,
      "O=c1[nH]n": 1314,
      "O=C(Nc1cccc(": 1315,
      "CCCC3)": 1316,
      "N1CCN(C(=O)": 1317,
      "CCOCC1": 1318,
      "c1ccc2[nH]ccc2c1": 1319,
      "c(-c2ccncc": 1320,
      "o1)c1ccccc1": 1321,
      "c(=O)[nH]c(=O)": 1322,
      "c1[nH]n": 1323,
      "C1=O": 1324,
      "c1nnc2n1CC": 1325,
      "n2n": 1326,
      "c1ccccc1)C1CC1": 1327,
      "Cc1nc(-": 1328,
      "c3cnn": 1329,
      "3CCO": 1330,
      "COc1ccc(Cl)cc1": 1331,
      "C1CCCO1": 1332,
      "O=C(c1ccc[nH]": 1333,
      "c2ccccc2c1": 1334,
      "c(C)cc(C)": 1335,
      "O=C(NCc1ccccc1)NC": 1336,
      "CC(C)O1": 1337,
      "CC#N)": 1338,
      "c1cccc2ncc": 1339,
      "O=C(NC1CCCCC1)": 1340,
      "Cc1cc(-": 1341,
      "C2=O)": 1342,
      "c1ccc2c(": 1343,
      "c1)N": 1344,
      "cn3": 1345,
      "CCC2)c1": 1346,
      "=c1[nH]": 1347,
      "N(c2ccccc2)": 1348,
      "c3cn[nH]c3)": 1349,
      "c3ccc(F)cc3)": 1350,
      "c1cc(NC(=O)": 1351,
      "c1ccccc1)N1CCOCC1": 1352,
      "O=C(Cc1ccccc1)NC": 1353,
      "CCC4)": 1354,
      "n2ncc": 1355,
      "c2ccccn2": 1356,
      "c1ccccc1)C(=O)": 1357,
      "n2nn": 1358,
      "N(S(=O)(=O)": 1359,
      "c(-c2cccn": 1360,
      "OCC(=O)N1CC": 1361,
      "c(C)nn(C)": 1362,
      "N2CCOCC2)": 1363,
      "NC(=O)NC(C)": 1364,
      "c2sc3c(": 1365,
      "COc1cc(OC)": 1366,
      "O=C(NCc1ccccc1)Nc1ccccc1": 1367,
      "3)n2)c1": 1368,
      "3)CC2)c1": 1369,
      "C1CCCN(C(=O)": 1370,
      "c1cc[nH]c1": 1371,
      "1)c1ccc[nH]1": 1372,
      "c2cc(Cl)ccc2": 1373,
      "c1cnc(C2CC": 1374,
      "2CC3": 1375,
      "c3n2CC": 1376,
      "CNC(=O)NC": 1377,
      "CN(S(=O)(=O)": 1378,
      "c(C(C)(C)C)": 1379,
      "#N": 1380,
      "c(CC)": 1381,
      "(C)C)cc1": 1382,
      "N)c1": 1383,
      "c3ccc4c(c3)": 1384,
      "O=C(NCc1ccco1)": 1385,
      "C(C)O": 1386,
      "c1ccc(-n2cnnn2)cc1": 1387,
      "c2cccc(F)c2)": 1388,
      "O=C(NCc1ccccn1)": 1389,
      "c2ccccc21)Nc1ccccc1": 1390,
      "COc1ccc(F)cc1": 1391,
      "=N": 1392,
      "c1ccc[nH]c1=O": 1393,
      "[nH]1)Nc1ccccc1": 1394,
      "c2)no1": 1395,
      "n2c(": 1396,
      "c1ccc(-c2ncc": 1397,
      "c(N(C)C)": 1398,
      "cnnn1": 1399,
      "CCNC2": 1400,
      "O=C1COc2ccccc2": 1401,
      "c(C4CC4)": 1402,
      "C3CC3)": 1403,
      "#C": 1404,
      "c2[nH]ncc2": 1405,
      "O=C(Nc1cccc(-": 1406,
      "C(=O)N1CCCC1": 1407,
      "c1cccc(C#N)": 1408,
      "c1ccnc(OC2CC": 1409,
      "c2ccc(C)cc": 1410,
      "O=C(Nc1nncs": 1411,
      "3)no2)cc1": 1412,
      "C1Cc2ccccc2": 1413,
      "O=C(Cc1ccc[nH]": 1414,
      "O=C(CS(=O)(=O)": 1415,
      "CCn1cn": 1416,
      "c1ncc2": 1417,
      "O=C(NCc1cscn": 1418,
      "c2ccccn2)n": 1419,
      "O=c1cc[nH]": 1420,
      "C(C)=O": 1421,
      "(F)(F)F": 1422,
      "c2nc3c(": 1423,
      "CC2(": 1424,
      "Cc1cc(C)cc(": 1425,
      "COc1": 1426,
      "c2nc(-c3ccccc3)": 1427,
      "c(C)o1": 1428,
      "OCC1)c1ccccc1": 1429,
      "c1cccc2cccnc12)": 1430,
      "Cc1ccsc1": 1431,
      "cccn2)cc1": 1432,
      "CC2)CC1": 1433,
      "sc3)": 1434,
      "c3ccncc3)": 1435,
      "c1cccc2cccnc12": 1436,
      "COc1ccc(CNC(=O)": 1437,
      "c32)cc1": 1438,
      "c2nc3cc": 1439,
      "CCC3)n": 1440,
      "C1CCC1": 1441,
      "COCCO": 1442,
      "sc1C": 1443,
      "cn2)c1": 1444,
      "c1cccc2ccccc12": 1445,
      "[nH]n1)": 1446,
      "c1cc(=O)[nH]": 1447,
      "c2ccccn2)CC1": 1448,
      "CC1CCN(C(=O)": 1449,
      "c2ncc(": 1450,
      "oc3)": 1451,
      "c2nc(-": 1452,
      "CC1CN(C(=O)": 1453,
      "sc2c1": 1454,
      "c2c(C)no": 1455,
      "Cc1ccc(CNC(=O)": 1456,
      "O=C(CNc1ccccc1)Nc1ccccc1": 1457,
      "c2ccccc2[nH]1": 1458,
      "c34)": 1459,
      "[nH]2)c1": 1460,
      "c(-c2ccccc2)n1": 1461,
      "C2C1": 1462,
      "CCCC3": 1463,
      "c2cc(N": 1464,
      "Cc1cccc(C)c1": 1465,
      "c3o": 1466,
      "c1ccc(Cl)cc1)": 1467,
      "c2ccc(O": 1468,
      "O=C1CCCN1c1ccccc1": 1469,
      "NC=": 1470,
      "2)o1": 1471,
      "ncn2": 1472,
      "s2)c1": 1473,
      "Cc1cc(C(=O)N2CC": 1474,
      "c1ccc(=O)[nH]c1": 1475,
      "O=C(Cn1n": 1476,
      "O=C1CC(C(=O)N": 1477,
      "CCCN": 1478,
      "c1cc2ccccc2[nH]1": 1479,
      "c2ccncc2)c1": 1480,
      "c2cc[nH]n2)cc1": 1481,
      "N(C(=O)c3cc": 1482,
      "O=C(CSc1ncn": 1483,
      "c1)N1CCOCC1": 1484,
      "COc1ccc(C)cc1": 1485,
      "O=C(Cn1ccccc1=O)": 1486,
      "CC(=O)NC2CC": 1487,
      "O=C1CCC(": 1488,
      "C3(CC": 1489,
      "CC1)N": 1490,
      "OCc1ccccc1": 1491,
      "1)C(=O)": 1492,
      "N#CC": 1493,
      "CC(C)(": 1494,
      "O=C(Cc1cscn": 1495,
      "C=CCn1": 1496,
      "c1ccc(O)": 1497,
      "CCN(C)C(=O)": 1498,
      "c(Cl)cccc1": 1499,
      "CC(C)CNC(=O)": 1500,
      "c1n[nH]c(=O)": 1501,
      "CCCCNC(=O)": 1502,
      "c2ccccc2)CCN1": 1503,
      "nc1-c1ccccc1": 1504,
      "O=C(NCCCN1CC": 1505,
      "2)cs1": 1506,
      "OC3": 1507,
      "c(C)s1": 1508,
      "O=C(CCc1ccccc1)N": 1509,
      "Cc3ccccc3": 1510,
      "c1ccccc1F": 1511,
      "cn1)": 1512,
      "c2ncccn2": 1513,
      "c1scnc1C1CC1": 1514,
      "C)C(=O)": 1515,
      "c1sccc1": 1516,
      "c(N)c1": 1517,
      "C1CCCN1C(=O)": 1518,
      "O=C(COc1ccccc1)NC": 1519,
      "O=C(NCc1nc2ccccc2": 1520,
      "Cc1ccco1": 1521,
      "cc(=O)": 1522,
      "O=C(Nc1nccs": 1523,
      "CCO)": 1524,
      "Cc1ccc(F)cc1": 1525,
      "O=c1o": 1526,
      "O=C(CSc1nnn": 1527,
      "cncn3)": 1528,
      "CC(O": 1529,
      "c2ncnc3[nH]": 1530,
      "o2)C1": 1531,
      "c1ccc(F)cc1F": 1532,
      "CC2=O)c1": 1533,
      "C1CN": 1534,
      "c1cccc(O": 1535,
      "c1ccon1)": 1536,
      "CC(=O)Nc1ccccc1": 1537,
      "CN1CCOCC1": 1538,
      "c1cccs1)c1ccccc1": 1539,
      "c(Br)": 1540,
      "O=C1COc2ccccc2N1": 1541,
      "O=C(NCCOc1ccccc1)": 1542,
      "c1ccc(-c2cscn2)cc1": 1543,
      "Cc1c(C(=O)N": 1544,
      "c(=O)[nH]c1=O)": 1545,
      "(C(C)C)": 1546,
      "N2CCOCC2)cc1": 1547,
      "c2=O)c1": 1548,
      "c3cc(F)": 1549,
      "c2cn[nH]c2)": 1550,
      "c2cc3c(cc2": 1551,
      "c1ccc(CCNC": 1552,
      "NCc1ccco1": 1553,
      "n1Cc1ccccc1": 1554,
      "Oc2ccccc2": 1555,
      "c1nnc(C2CC": 1556,
      "c(C(N)=O)": 1557,
      "c2c(n": 1558,
      "O=C1C": 1559,
      "c2ccc3ccccc3": 1560,
      "c1cc(F)ccc1": 1561,
      "c(NC(=O)N": 1562,
      "CCn1nc(C)": 1563,
      "c1ccc(C2NCC": 1564,
      "O=C(Nc1ccc2[nH]": 1565,
      "c3ccc(F)cc3": 1566,
      "3)C2)c1": 1567,
      "NC2=O)": 1568,
      "O=C(Cc1ccccc1)NCC": 1569,
      "c2cccc(C#N)": 1570,
      "O=C(NCc1cn": 1571,
      "c1coc(-": 1572,
      "O=C(CSc1ncc": 1573,
      "Cc2cn": 1574,
      "c1cccc2[nH]": 1575,
      "Cc1occc1": 1576,
      "c2)o1": 1577,
      "OCO2": 1578,
      "cn3)": 1579,
      "1)N1CCc2ccccc2C1": 1580,
      "n23)": 1581,
      "Cn1c(=O)": 1582,
      "C(F)F": 1583,
      "c1cn(-c2ccccc2)nn1": 1584,
      "c3ncccc3": 1585,
      "c1ccc(-c2ccccc2)": 1586,
      "CC(CC(C3)C": 1587,
      "3CCOCC3)n": 1588,
      "c1ccccn1)N": 1589,
      "2CC3CC(CC(C3)C": 1590,
      "ncc(": 1591,
      "CCc1nc(": 1592,
      "c1ccc(NCC": 1593,
      "c2ccccn2)c1": 1594,
      "C1CCCN1": 1595,
      "c(-c4": 1596,
      "O=C(Nc1ccccc1)c1cccnc1": 1597,
      "c1ccc(OC2CC": 1598,
      "c(-c2ccs": 1599,
      "c1ccccc1Cl)": 1600,
      "CCCC(=O)N": 1601,
      "[nH]1)N": 1602,
      "1)NC1CC1": 1603,
      "O=C(NCCN": 1604,
      "O=C1OCC": 1605,
      "O=S(=O)(c1ccccc1)N1CCCCC1": 1606,
      "O=C(CN1C(=O)": 1607,
      "c1ncno": 1608,
      "CC1CC1": 1609,
      "cc2C)": 1610,
      "c3cccc(F)c3)": 1611,
      "c2)cs1": 1612,
      "C2CC2)CC1": 1613,
      "CCc1ccccc1": 1614,
      "OCO4)": 1615,
      "3)CC2)n1": 1616,
      "N(c3cc": 1617,
      "N(c2ccccc2)CC1": 1618,
      "c3no": 1619,
      "NCC1CC1": 1620,
      "CC(=O)NC1CC": 1621,
      "c1cccc(N": 1622,
      "c1ccc(-c2n[nH]": 1623,
      "O)c1": 1624,
      "c1cnc(-": 1625,
      "c2c3c(": 1626,
      "c2cn[nH]c2)cc1": 1627,
      "c1)C(=O)": 1628,
      "C(=O)N(C)C": 1629,
      "Cc1cc(F)": 1630,
      "Nc1": 1631,
      "Cn1cccn1": 1632,
      "C(F)(F)F)c1": 1633,
      "onc(C)c1": 1634,
      "COC(=O)N": 1635,
      "O=C(Nc1nc2ccccc2": 1636,
      "c1ccccc1)N1CCCC1": 1637,
      "c2scc": 1638,
      "O=C(NCC1CCCO": 1639,
      "cc2C1": 1640,
      "O=C(NCCCO": 1641,
      "cnc12": 1642,
      "O=C(NCc1ccn": 1643,
      "CC1CN(": 1644,
      "1)N1CCCCCC1": 1645,
      "n3C)": 1646,
      "c(Cn3": 1647,
      "cc1-": 1648,
      "3CCCC3)n": 1649,
      "c2cccs2)CC1": 1650,
      "CC(S": 1651,
      "c(C3": 1652,
      "Cc1ccc(N2CC": 1653,
      "O=C(CNS(=O)(=O)": 1654,
      "c1cccnc1-n1": 1655,
      "O=C1CCC": 1656,
      "no3)": 1657,
      "c(-c3ccncc": 1658,
      "c1nc(N2CC": 1659,
      "Cc1ccc(C(=O)N2CC": 1660,
      "O=C1CN": 1661,
      "NC(=O)CS": 1662,
      "c(=O)[nH]c2c1": 1663,
      "Cc1ncc(": 1664,
      "c2ccc(F)cc2)CC1": 1665,
      "cc2)C1": 1666,
      "N(c3ccccc3)": 1667,
      "O=S(=O)(O": 1668,
      "c2nnc[nH]": 1669,
      "c2cc(OC)": 1670,
      "S(C)(=O)=O)cc1": 1671,
      "CCC21": 1672,
      "(c2ccccc2)": 1673,
      "C2CC(=O)": 1674,
      "c1ccc(-n2ncc3": 1675,
      "O=S(=O)(Nc1ccccc1)": 1676,
      "O=C(Cc1c[nH]c2ccccc12)": 1677,
      "c2cc(Br)": 1678,
      "CC(CO)": 1679,
      "c(NC(=O)C": 1680,
      "CCC1)N": 1681,
      "CCc1onc(C)c1": 1682,
      "c2ncccn2)": 1683,
      "CC21": 1684,
      "N(C(=O)C": 1685,
      "c2nccs2)": 1686,
      "CC1CCCO1": 1687,
      "c1nc2ncccn2": 1688,
      "c2cc(N)": 1689,
      "c1ccc(C#N)cc1": 1690,
      "CC(=O)O": 1691,
      "c(Cc2ccccc2)": 1692,
      "O=C(CN1CCNCC": 1693,
      "c2cccc(N)": 1694,
      "c2c1cn": 1695,
      "N1CCC(": 1696,
      "c2on": 1697,
      "3)nc1": 1698,
      "c2ccc(F)cc2)c1": 1699,
      "-n1cnnn1": 1700,
      "CCCCn1": 1701,
      "cn2)CC1": 1702,
      "c3nnnn3": 1703,
      "c1cccc2ccccc12)": 1704,
      "c2c1CCCC2": 1705,
      "c2[nH]1": 1706,
      "c(n1)": 1707,
      "c2cnn(-c3ccccc3)": 1708,
      "O=C(NC1CCCC1)": 1709,
      "c1ccc(-n2cncn2)cc1": 1710,
      "=CCC1": 1711,
      "CNCC": 1712,
      "c4ncc": 1713,
      "n2cccn2)c1": 1714,
      "NC(=O)CC": 1715,
      "C1CCCN(": 1716,
      "n1cccn1": 1717,
      "N#Cc1cccc(": 1718,
      "c1cnccn": 1719,
      "cs3)n": 1720,
      "c2ccccc2)CN1": 1721,
      "ccc1=O)": 1722,
      "C1(c2ccccc2)": 1723,
      "c(CN3CC": 1724,
      "c1cnn(C": 1725,
      "S(=O)(=O)c1ccccc1": 1726,
      "O=C(Nc1nncs1)": 1727,
      "nc3": 1728,
      "nnc2c1": 1729,
      "Cc1ccncc1": 1730,
      "c(C(=O)NCC": 1731,
      "N1C(=O)": 1732,
      "C2CCCO": 1733,
      "O=C(NC1CCCCC": 1734,
      "COc1ccc(C(=O)": 1735,
      "c1ccccn1)Nc1ccccc1": 1736,
      "COc1cccc(-": 1737,
      "COc1ccc(-": 1738,
      "COc1cccc(C(=O)N": 1739,
      "Nc2ccccc21": 1740,
      "c(C)cc3": 1741,
      "O=C(c1ccccn": 1742,
      "cc1C": 1743,
      "O=C(OCc1ccccc1)": 1744,
      "c2ccc3[nH]": 1745,
      "c2cccs2)c1": 1746,
      "CC(NC(=O)N": 1747,
      "O=C(NCC1(": 1748,
      "c2nnco": 1749,
      "c1ccc(=O)[nH]n1": 1750,
      "[nH]2)C1": 1751,
      "co3)n": 1752,
      "c(N)n1": 1753,
      "c1ccc2c(c1)COC2": 1754,
      "ccc12)": 1755,
      "c1cc(C)n": 1756,
      "CNCC1": 1757,
      "c1ccc2c(c1)OCCCO2": 1758,
      "=CC1": 1759,
      "C1)c1ccccc1": 1760,
      "c2ccccc2-": 1761,
      "c2cccnc2)CC1": 1762,
      "c3cc(C)": 1763,
      "CCCC1)": 1764,
      "CC(OC(=O)": 1765,
      "c2nnc3n2CC": 1766,
      "c2N1": 1767,
      "O=C(N1CC": 1768,
      "c(=O)n(": 1769,
      "-2": 1770,
      "O=c1cccc": 1771,
      "Cn1ccnc1": 1772,
      "Cc1nc2ccccc2": 1773,
      "O=c1cc(-c2ccccc2)": 1774,
      "Cc1n[nH]c(C)c1": 1775,
      "c1ccc(-c2cc[nH]n2)cc1": 1776,
      "CC(=O)NC(C)": 1777,
      "(C)C)c1": 1778,
      "NC(": 1779,
      "c1cccc(OCC": 1780,
      "C#CCNC(=O)": 1781,
      "c3nc4ccccc4": 1782,
      "c1cccs1)Nc1ccccc1": 1783,
      "c2cccc(OC)": 1784,
      "c2c[nH]nc2": 1785,
      "c4[nH]": 1786,
      "c1nc[nH]n1": 1787,
      "ccnc3)": 1788,
      "O=C(Cc1cs": 1789,
      "O=C(c1ccncc": 1790,
      "(C2CC2)": 1791,
      "c1cc(N)": 1792,
      "c2ccccc2)N1": 1793,
      "c2ncccn2)cc1": 1794,
      "CC(C)C(=O)N": 1795,
      "c2c(Cl)": 1796,
      "c2ccccc2C)": 1797,
      "C#CCN1CC": 1798,
      "O=C(c1cnccn": 1799,
      "c2nn3": 1800,
      "c1ccc(-n2cn": 1801,
      "c1o": 1802,
      "CO2)s1": 1803,
      "2NCC": 1804,
      "c(F)c(F)": 1805,
      "O=C(Nc1ccccc1)c1cn": 1806,
      "c1cnn(C)c1": 1807,
      "c2ccc[nH]": 1808,
      "1)c1ccoc1": 1809,
      "O=C(CCn1cccn": 1810,
      "SC": 1811,
      "oc1C": 1812,
      "c2n1)": 1813,
      "c2c(C)n": 1814,
      "CN2CCCCC2": 1815,
      "n2cccn2)": 1816,
      "C1CCOCC1": 1817,
      "c1nnc(NC(=O)": 1818,
      "O=C(c1ccoc1)N1CC": 1819,
      "Cc1ccccc1NC(=O)": 1820,
      "c1nnc(-": 1821,
      "c2ccco2)CC1": 1822,
      "N1CCNCC1": 1823,
      "CC2)nc1": 1824,
      "c2sccc2C1": 1825,
      "csc1": 1826,
      "O=C(NCc1ccncc1)": 1827,
      "O=c1ccc(-": 1828,
      "CCCC4)": 1829,
      "c2nnc(C3CC3)": 1830,
      "c1ccc(-n2cnn": 1831,
      "CCOc1ccc(NC(=O)": 1832,
      "O=C(CN1CCOCC": 1833,
      "c2co": 1834,
      "c1cc(Cl)ccc1": 1835,
      "3CCCC3=O)": 1836,
      "cc(N)": 1837,
      "1)NC1CCCC1": 1838,
      "c1ccc(CCN": 1839,
      "c1ccc(C#N)": 1840,
      "O=C(NCc1ccccc1": 1841,
      "c1ccc(CNC(=O)": 1842,
      "O=C(Cc1no": 1843,
      "CC(C#N)": 1844,
      "CC2)cn1": 1845,
      "c3ccccc3)n": 1846,
      "Cc1ccc(C)c(": 1847,
      "1)c1ccsc1": 1848,
      "2(=O)=O)": 1849,
      "c2c1C": 1850,
      "CCC2)CC1": 1851,
      "c1ccccc1)N1CCNCC1": 1852,
      "c1ccc(-n2ccnc2)cc1": 1853,
      "c3ccccc3)ccc2N1": 1854,
      "c1cnns1": 1855,
      "c2ccco2)c1": 1856,
      "O=S(=O)(NCC1CC": 1857,
      "c2cscn2)": 1858,
      "CC(C)(O)": 1859,
      "(CCO)": 1860,
      "c1c(C)[nH]": 1861,
      "O=C(Cn1cnnn": 1862,
      "O=C(Nc1ccccc1)N1CCCCC1": 1863,
      "c2ccccc21)c1ccccc1": 1864,
      "c3=O)": 1865,
      "(C)O": 1866,
      "c1nc[nH]n": 1867,
      "c2nccn": 1868,
      "c1ccc(S(=O)(=O)": 1869,
      "nc1C": 1870,
      "n2ncn": 1871,
      "c1ccsc1)N1CC": 1872,
      "c1ccc(Br)": 1873,
      "c2ccc(F)cc2)cc1": 1874,
      "c1ccc(-n2nnnc2": 1875,
      "c1ccc(=O)[nH]": 1876,
      "CCC2CC": 1877,
      "n[nH]1": 1878,
      "CCn1cc": 1879,
      "c(-c3cccnc3)": 1880,
      "cc(OC)c1OC": 1881,
      "c1cnn(C)": 1882,
      "OC(F)F)": 1883,
      "CCO2)cc1": 1884,
      "c1ccc(COc2ccccc2)cc1": 1885,
      "c1cn2ccs": 1886,
      "CC2)C1": 1887,
      "Cc2ccccc2C1": 1888,
      "O=C(NCc1cccs1)": 1889,
      "Cc1cccs1": 1890,
      "c1cc(OC)": 1891,
      "OCC(=O)N2CC": 1892,
      "C1CN(C(=O)": 1893,
      "CCC3)cc1": 1894,
      "3CCCO3)": 1895,
      "c1nc(C)": 1896,
      "Cn2cn": 1897,
      "c1cnc2[nH]ncc2c1": 1898,
      "c2c(c1": 1899,
      "O=C(CCc1cn[nH]c1)": 1900,
      "c3cccc(Cl)": 1901,
      "Cc1ccc2n": 1902,
      "ccnc1)": 1903,
      "CN1CCN(": 1904,
      "1)NCc1ccco1": 1905,
      "Cc1csc(NC(=O)": 1906,
      "c1n[nH]c2ccccc12": 1907,
      "c3ncnn3": 1908,
      "O=S1(=O)": 1909,
      "c2ccncn2)cc1": 1910,
      "c2ncnn2": 1911,
      "O=C1CC(c2ccccc2)": 1912,
      "O=C(Cc1cnoc1)": 1913,
      "O=C(NCCc1ccccc1)c1ccccc1": 1914,
      "c2cccc3ccccc2": 1915,
      "CCOc1cccc(": 1916,
      "c1nc[nH]n1)": 1917,
      "CCC2)n": 1918,
      "c3ccccc3Cl)": 1919,
      "c1cccc(-n2cnnn2)c1": 1920,
      "1)N1CCc2ccccc21": 1921,
      "NCC2)": 1922,
      "c2ccc(C(N)=O)": 1923,
      "O=S(=O)(c1ccccc1)": 1924,
      "1)C1CC1": 1925,
      "c2cn3": 1926,
      "COc1ncccc1": 1927,
      "1)C1CC(=O)": 1928,
      "1)N1CCN(c2ccccc2)CC1": 1929,
      "COC)": 1930,
      "c1nc(-c2cccn": 1931,
      "CN(CC1CC": 1932,
      "3)C2)n1": 1933,
      "c(CNC": 1934,
      "N=": 1935,
      "c(-c2ccccc2)n1)": 1936,
      "C(=O)N1CCN(C(=O)": 1937,
      "3)n1": 1938,
      "n2nc(C)": 1939,
      "CN(C)C(=O)N": 1940,
      "CC(=O)N1CCCC1": 1941,
      "[nH]3)": 1942,
      "c2nccs2)CC1": 1943,
      "c3cccc(": 1944,
      "c1ccc(OC)cc1": 1945,
      "N(c3ncccn": 1946,
      "OCC)": 1947,
      "1)Nc1nccs1": 1948,
      "O=C(c1ccccc1)N1CCNCC1": 1949,
      "c3ccccn3)n": 1950,
      "cn12": 1951,
      "C(C)NC(=O)N": 1952,
      "Cc1csc(": 1953,
      "c2c[nH]c3ccccc23)": 1954,
      "C2(CC1)OCCO2": 1955,
      "c2nnc3cccc": 1956,
      "COc1ccccc1NC(=O)": 1957,
      "Cc1ncc": 1958,
      "1)N1CCN(C(=O)": 1959,
      "c1ccc(Cn2cccn2)cc1": 1960,
      "O=C(NCCN1CCOCC": 1961,
      "Cc1ccc(-": 1962,
      "c2nnnn2": 1963,
      "c2cccc(C(F)(F)F)": 1964,
      "C(C)(C)C)cc1": 1965,
      "COCCN": 1966,
      "2(CC": 1967,
      "O=C(c1ccccc1)N1CCCC1": 1968,
      "c2cc(=O)": 1969,
      "O=C(Cn1cncn": 1970,
      "O=C(OC1CC": 1971,
      "c2cc(C": 1972,
      "c1ccc2c(c1)CCC2)": 1973,
      "c2ccc(CN": 1974,
      "COc1ccn": 1975,
      "C2)cn1": 1976,
      "COc1ccc(-c2n": 1977,
      "O=C1CS": 1978,
      "CC1CO": 1979,
      "c(F)c1)": 1980,
      "c1cnc(C2CCCO2)s1": 1981,
      "c(C)s": 1982,
      "c3cccnc3": 1983,
      "(C)c3)": 1984,
      "c1cnn(": 1985,
      "c2cnccn2)CC1": 1986,
      "C(C)=O)cc1": 1987,
      "Cc1[nH]": 1988,
      "c1ccc2c(c1)CCCC2": 1989,
      "CCNC": 1990,
      "c2c(N)": 1991,
      "c(=O)n2": 1992,
      "cs2)c1": 1993,
      "4cccc": 1994,
      "C(CC)": 1995,
      "OC2=O)": 1996,
      "CCS(=O)(=O)": 1997,
      "ccccc2n1": 1998,
      "c2cc(C)ccc2": 1999,
      "2(": 2000,
      "OCCO4)": 2001,
      "n2cnnn": 2002,
      "c2nc(C)n": 2003,
      "O=S(=O)(NCc1ccccc1)c1ccccc1": 2004,
      "c(-c2cccs2)": 2005,
      "O=C(CCCn1": 2006,
      "CN(CC)": 2007,
      "c1cccc(C#N)c1": 2008,
      "c2cccc(Br)": 2009,
      "CCN2C(=O)": 2010,
      "COc1ccccc1-": 2011,
      "c1ccc(CN2CCOCC2)cc1": 2012,
      "CC(=O)N1CCC(": 2013,
      "CCC2)n1": 2014,
      "N(CC)": 2015,
      "c3ccccc23)cc1": 2016,
      "c3ccn": 2017,
      "c3sccc3": 2018,
      "C=C(C)": 2019,
      "CC(=O)N2": 2020,
      "c2ncno2)cc1": 2021,
      "cn[nH]1": 2022,
      "C3)n": 2023,
      "COC(=O)c1ccc(": 2024,
      "cnc21": 2025,
      "c(O": 2026,
      "CCCS": 2027,
      "c2cccc3cccn": 2028,
      "c2F)": 2029,
      "[nH]c2c1": 2030,
      "O=C(Nc1cn": 2031,
