{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 60,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 60
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 58,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 17,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 35,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 58,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 103,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "(\\[[^\\]]+]|<|Br?|Cl?|N|O|S|P|F|I|b|c|n|o|s|p|\\(|\\)|\\.|=|#|-|\\+|\\\\\\\\|\\/|:|~|@|\\?|>|\\*|\\$|\\%[0-9]{2}|[0-9])"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          103
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          17
        ],
        "tokens": [
          "<eos>"
        ]
      },
      "<unk>": {
        "id": "<unk>",
        "ids": [
          35
        ],
        "tokens": [
          "<unk>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "F": 0,
      "%73": 1,
      "%86": 2,
      "%58": 3,
      "%98": 4,
      "3": 5,
      "%10": 6,
      "\\": 7,
      "b": 8,
      "%04": 9,
      "%87": 10,
      "8": 11,
      "%02": 12,
      "2": 13,
      "%56": 14,
      "%67": 15,
      "%43": 16,
      "<eos>": 17,
      "%99": 18,
      "*": 19,
      "%09": 20,
      "+": 21,
      "Br": 22,
      "%46": 23,
      "%95": 24,
      "5": 25,
      "S": 26,
      "%07": 27,
      "%75": 28,
      "P": 29,
      "B": 30,
      "%33": 31,
      "C": 32,
      "%14": 33,
      "%78": 34,
      "<unk>": 35,
      "4": 36,
      "7": 37,
      "%11": 38,
      "0": 39,
      "%34": 40,
      ".": 41,
      "%39": 42,
      "%24": 43,
      "%94": 44,
      "%90": 45,
      "%29": 46,
      "%12": 47,
      "%53": 48,
      "%91": 49,
      "%52": 50,
      ">": 51,
      "/": 52,
      "@": 53,
      "%38": 54,
      "%77": 55,
      "%18": 56,
      "%00": 57,
      "<pad>": 58,
      "%89": 59,
      "N": 60,
      "%19": 61,
      "%23": 62,
      "%79": 63,
      "%20": 64,
      "%97": 65,
      "%51": 66,
      "%57": 67,
      "%42": 68,
      "6": 69,
      "$": 70,
      "p": 71,
      "%64": 72,
      "9": 73,
      "%31": 74,
      "%32": 75,
      "%54": 76,
      "~": 77,
      "%76": 78,
      "%83": 79,
      "%06": 80,
      "%61": 81,
      "%17": 82,
      "%68": 83,
      "%48": 84,
      "%28": 85,
      "%22": 86,
      "%27": 87,
      "(": 88,
      "%37": 89,
      "%74": 90,
      "%84": 91,
      "Cl": 92,
      "%13": 93,
      ")": 94,
      "1": 95,
      "%47": 96,
      "%50": 97,
      "%92": 98,
      "%25": 99,
      "c": 100,
      "%49": 101,
      "%85": 102,
      "<bos>": 103,
      "%26": 104,
      "%35": 105,
      "%60": 106,
      "%63": 107,
      "%21": 108,
      "%01": 109,
      "[": 110,
      "%05": 111,
      "%65": 112,
      "]": 113,
      "%30": 114,
      "%45": 115,
      "?": 116,
      "%62": 117,
      "%93": 118,
      "o": 119,
      "%80": 120,
      "%44": 121,
      "s": 122,
      "=": 123,
      "%70": 124,
      "%81": 125,
      "-": 126,
      "%82": 127,
      "I": 128,
      "%88": 129,
      "%72": 130,
      "%66": 131,
      "%59": 132,
      ":": 133,
      "%08": 134,
      "%96": 135,
      "<": 136,
      "%40": 137,
      "%03": 138,
      "%55": 139,
      "%41": 140,
      "n": 141,
      "O": 142,
      "%15": 143,
      "%36": 144,
      "#": 145,
      "%71": 146,
      "%69": 147,
      "%16": 148
    },
    "unk_token": "<unk>"
  }
}