{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 102,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 102
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": "(\\[[^\\]]+]|<|Br?|Cl?|N|O|S|P|F|I|b|c|n|o|s|p|\\(|\\)|\\.|=|#|-|\\+|\\\\\\\\|\\/|:|~|@|\\?|>|\\*|\\$|\\%[0-9]{2}|[0-9])"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          0
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          1
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<bos>": 0,
      "<eos>": 1,
      "<pad>": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "(": 6,
      ")": 7,
      "*": 8,
      "+": 9,
      "-": 10,
      ".": 11,
      "/": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "6": 19,
      "7": 20,
      "8": 21,
      "9": 22,
      ":": 23,
      "<": 24,
      "=": 25,
      ">": 26,
      "?": 27,
      "@": 28,
      "B": 29,
      "C": 30,
      "F": 31,
      "H": 32,
      "I": 33,
      "N": 34,
      "O": 35,
      "P": 36,
      "S": 37,
      "[": 38,
      "\\": 39,
      "]": 40,
      "b": 41,
      "c": 42,
      "e": 43,
      "i": 44,
      "l": 45,
      "n": 46,
      "o": 47,
      "p": 48,
      "r": 49,
      "s": 50,
      "~": 51,
      "cc": 52,
      "CC": 53,
      "c1": 54,
      "c2": 55,
      "C(": 56,
      "O)": 57,
      "c(": 58,
      "cccc": 59,
      "=O)": 60,
      "c3": 61,
      "c1cc": 62,
      ")cc": 63,
      "C(=O)": 64,
      "C1": 65,
      "O=": 66,
      "C)": 67,
      "c1cccc": 68,
      "(=O)": 69,
      "c1ccccc1": 70,
      "c2cccc": 71,
      "c1ccc(": 72,
      "cn": 73,
      "CCCC": 74,
      "C2": 75,
      "O=C(": 76,
      "c2ccccc2": 77,
      ")cc1": 78,
      "c2cc": 79,
      "CN": 80,
      "2)": 81,
      "CO": 82,
      "CCN": 83,
      "[n": 84,
      "[nH": 85,
      "[nH]": 86,
      "(C)": 87,
      ")N": 88,
      "c4": 89,
      "CC1": 90,
      "3)": 91,
      "c3cccc": 92,
      "C(=O)N": 93,
      "n1": 94,
      "F)": 95,
      "(C": 96,
      "nc(": 97,
      "c3ccccc3": 98,
      "c3cc": 99,
      "c2ccccc2)": 100,
      "S(=O)": 101,
      "O=C(N": 102,
      "2)cc1": 103,
      "c2ccc(": 104,
      "CCO": 105,
      "Cl": 106,
      "C3": 107,
      "C(C)": 108,
      "C=": 109,
      "S(=O)(=O)": 110,
      "c1ccccc1)": 111,
      "ncc": 112,
      "(-": 113,
      "CC(": 114,
      "CC(=O)": 115,
      "c2c(": 116,
      "NC(=O)": 117,
      "O=C1": 118,
      "CCN(": 119,
      "n2": 120,
      "c1ccc(-": 121,
      "c2n": 122,
      "=N": 123,
      "c1n": 124,
      ")n": 125,
      "CC2": 126,
      "OC": 127,
      "c1)": 128,
      "CCC(": 129,
      "c(-": 130,
      ")N1": 131,
      "c(=O)": 132,
      "(N": 133,
      "CCCN": 134,
      "1)": 135,
      "(F)": 136,
      "c2)": 137,
      "cs": 138,
      "Cc1cc": 139,
      "c4cccc": 140,
      "CC(=O)N": 141,
      "CC(C)": 142,
      "c(N": 143,
      "=C(": 144,
      "Cc1ccccc1": 145,
      "+]": 146,
      "4)": 147,
      "CC2)": 148,
      "c1cn": 149,
      "c3ccccc3)": 150,
      "c3ccc(": 151,
      "nc(-": 152,
      "OC)": 153,
      "N)": 154,
      "CCC": 155,
      "F)(F)": 156,
      "Cl)": 157,
      "c2c1": 158,
      ")cc2)": 159,
      "=O": 160,
      "c[nH]": 161,
      "c1ccc(N": 162,
      "CC3": 163,
      "C(F)(F)": 164,
      "N1": 165,
      "c12": 166,
      ")cc2": 167,
      "c4ccccc4": 168,
      "CCC2": 169,
      "co": 170,
      "CS": 171,
      "c1ccc2c(": 172,
      "c5": 173,
      "=C": 174,
      "CN1": 175,
      "C(O)": 176,
      "c3n": 177,
      "O)cc": 178,
      "c4cc": 179,
      "c3c(": 180,
      "nc(N": 181,
      "3)n": 182,
      "C(C": 183,
      "CCCCC1": 184,
      "c2cn": 185,
      "[N": 186,
      "-]": 187,
      "S(=O)(=O)N": 188,
      "CCC1": 189,
      "[O": 190,
      "[O-]": 191,
      "[N+]": 192,
      "c1cccc(": 193,
      "n3": 194,
      "c2ccccc2)cc1": 195,
      "(Cl": 196,
      "C2)": 197,
      "Cc1ccc(": 198,
      "O=c1": 199,
      "Br": 200,
      "c1cc(": 201,
      "COc1ccc(": 202,
      "F)cc": 203,
      "c3)": 204,
      "C(=O)O": 205,
      "c1ccccc1)N": 206,
      "CCN1": 207,
      "c1cc2": 208,
      "O=S(=O)": 209,
      "C4": 210,
      "COC(=O)": 211,
      "c1ccc2c(c1)": 212,
      "3)cc1": 213,
      "c2cc(": 214,
      "CC1)": 215,
      "CN(": 216,
      "c2[nH]": 217,
      "Cc1": 218,
      "C(=O)N1": 219,
      "C(C)(C)": 220,
      "nn": 221,
      "Cn1": 222,
      "CC3)": 223,
      "(O)": 224,
      "(=O)[O-]": 225,
      "[N+](=O)[O-]": 226,
      "2)c1": 227,
      "c2)cc1": 228,
      "cn1": 229,
      "CNC(=O)": 230,
      "CN2": 231,
      "CCCC1": 232,
      "C(=N": 233,
      "c2ccccc21": 234,
      "CCC3": 235,
      "CC2)cc1": 236,
      "CC4": 237,
      "C(=": 238,
      "=O)cc": 239,
      "CCCO": 240,
      "C(=O)O)": 241,
      "c(C)": 242,
      "c1ccc(O": 243,
      "C(F)(F)F)": 244,
      "N=": 245,
      "C#": 246,
      "OCO": 247,
      "cnc3": 248,
      "nc1": 249,
      "CCN(C": 250,
      "c2ncc": 251,
      "o1": 252,
      "c1ncc": 253,
      "(Cl)": 254,
      "CCCCCCCC": 255,
      "C1=": 256,
      "s1": 257,
      "Cc1ccccc1)": 258,
      ")ccc2": 259,
      ")cc3": 260,
      "OC1": 261,
      "O=C1N": 262,
      "2CCCC": 263,
      "CC(O)": 264,
      "c2ccc(-": 265,
      "N=C(": 266,
      "[nH]1": 267,
      "n2)": 268,
      "n1)": 269,
      "c1cc(-": 270,
      "CC)": 271,
      "c23)": 272,
      "Cl)cc1": 273,
      "c2ccccc2)CC1": 274,
      "n2cc": 275,
      "3CCCC": 276,
      "c1cccc2": 277,
      "C3)": 278,
      ")ccc1": 279,
      "c2ccccc12": 280,
      "cnc1": 281,
      "CN(C)": 282,
      "C2CCCC": 283,
      "OC(": 284,
      "c3cn": 285,
      "Cc1ccccc1)N": 286,
      "c(Cl)": 287,
      "F)cc1": 288,
      "c2cc3": 289,
      "CCCN1": 290,
      "n(": 291,
      "C(N)": 292,
      "CCOC(=O)": 293,
      "c1ccccc1)c1ccccc1": 294,
      "c(O)": 295,
      "cnc2": 296,
      "c1c[nH]": 297,
      ")cc3)": 298,
      "(O": 299,
      "C2)cc1": 300,
      "c1ccccc1)N1": 301,
      "cs1": 302,
      "CC=": 303,
      "c12)": 304,
      "CCN(C(=O)": 305,
      ")cc2)cc1": 306,
      "c3ccccc3)n": 307,
      "c1ccc(-c2n": 308,
      "CC(C)(C)": 309,
      "n(-": 310,
      "c(OC)": 311,
      "C(C)C)": 312,
      "C(=S": 313,
      "O=S(=O)(N": 314,
      "c1ccc(C": 315,
      "nc2": 316,
      "O=c1[nH]": 317,
      "c2ccc(Cl": 318,
      "cccc2": 319,
      "CC(C": 320,
      "2)CC1": 321,
      "C1=O": 322,
      "C1)": 323,
      "cc(": 324,
      "c1=O": 325,
      "Br)": 326,
      "2CCO": 327,
      "Cc1n": 328,
      "c1cccc(-": 329,
      "n2)cc1": 330,
      "C1CCCCC1": 331,
      "O=C(CS": 332,
      "O=C(C=": 333,
      "C(=C": 334,
      "c2nc(": 335,
      ")cc(": 336,
      "O=C(O)": 337,
      "c(cc": 338,
      "c4ccccc4)": 339,
      "c2ccc3c(": 340,
      "OC(=O)": 341,
      ")Nc1ccccc1": 342,
      "O=C(Nc1ccccc1)": 343,
      "n1-": 344,
      "5)": 345,
      "ncn": 346,
      "CCC4": 347,
      "C12": 348,
      "c1ccc(C2": 349,
      "c4ccc(": 350,
      "O1": 351,
      "O=C(CC": 352,
      "c1ccc(-c2cc": 353,
      "c1c(": 354,
      "c2cccc(": 355,
      "C(=O)N2": 356,
      "O=c1cc": 357,
      "N2": 358,
      "c2n1": 359,
      "O=S(=O)(": 360,
      "1)c1ccccc1": 361,
      "CCS": 362,
      "C=C": 363,
      "c5cccc": 364,
      "c2nc(-": 365,
      "CCOCC1": 366,
      "c2ncn": 367,
      "CCCC2": 368,
      "c2ccc(N": 369,
      "c(=O)[nH]": 370,
      "[N+](=O)[O-])": 371,
      "[n+]": 372,
      "c1ccc(Cl)cc1": 373,
      "=O)cc1": 374,
      "c23)cc1": 375,
      "co1": 376,
      "N(": 377,
      "COc1cc": 378,
      "C(C)=O)": 379,
      "cc(-": 380,
      "OC2": 381,
      "ncc1": 382,
      "N#": 383,
      "c4c(": 384,
      "3CCO": 385,
      "CCNC(=O)": 386,
      "c1nc(": 387,
      "O)cc1": 388,
      "C3CCCC": 389,
      "cccc1": 390,
      "c2ccc3c(c2)": 391,
      "C=C1": 392,
      "c3[nH]": 393,
      "c2ccccc2)c1": 394,
      "C(=S)N": 395,
      "C(=O)N(": 396,
      "C=N": 397,
      "O=C(NC1": 398,
      "c1ccc(CN": 399,
      "CCn1": 400,
      "CCCN(": 401,
      "n(C": 402,
      "c2cccc3": 403,
      "O=C1C=": 404,
      "(C)C": 405,
      "c21": 406,
      "c(F)": 407,
      "n3)": 408,
      "COc1cc(": 409,
      "P(=O)": 410,
      "OCCO": 411,
      "c2ccc(F": 412,
      "c1ccc(N2": 413,
      "4)n": 414,
      "c3ncc": 415,
      "CC(=O)N1": 416,
      "N=C": 417,
      "c2cc(-": 418,
      "C1=N": 419,
      "c2cccn": 420,
      "c3cc(": 421,
      "C1O": 422,
      "C5": 423,
      "C(=O)NC(": 424,
      "C(C)C": 425,
      "CC3)n": 426,
      "c1cccnc1": 427,
      "CC4)": 428,
      "C(CO)": 429,
      "c2s": 430,
      "nc3": 431,
      "c1nc2ccccc2": 432,
      "c1-": 433,
      "ncc2": 434,
      "c2c[nH]": 435,
      "CCC(N": 436,
      "c2ccccc12)": 437,
      "COc1ccccc1": 438,
      "CCN2": 439,
      "(C)C)": 440,
      "C(N": 441,
      "C(F)(F)F)cc": 442,
      "=C1": 443,
      "c2ccc(O": 444,
      "c5ccccc5": 445,
      "c2nc3ccccc3": 446,
      "CCc1ccccc1": 447,
      "cn2": 448,
      "c4)": 449,
      "C(C)(C)C)": 450,
      "c1nc(-": 451,
      "c2ccc(Cl)cc2)": 452,
      "c2ccccc2c1": 453,
      "c2)c1": 454,
      "n(C)": 455,
      "CN(C": 456,
      "C1CC1": 457,
      "CC2)c1": 458,
      "c2nc(N": 459,
      "O=C(Cn1": 460,
      "Cc1cc(": 461,
      "C2(": 462,
      "O=C(CN1": 463,
      "cc2": 464,
      "c1cccc(N": 465,
      "c1ccccn1": 466,
      "Cc2ccccc2)": 467,
      "c1ccc2[nH]": 468,
      "n4": 469,
      "s1)": 470,
      "C(c2ccccc2)": 471,
      "Cc1cn": 472,
      "=O)N": 473,
      "c2o": 474,
      "2)C1": 475,
      "CCNCC1": 476,
      "(C)(=O)": 477,
      ")NC(=O)": 478,
      "c3ccc(Cl": 479,
      "c1ccc(F)cc1": 480,
      "O=C(NCc1ccccc1)": 481,
      "c(O": 482,
      "o2)cc1": 483,
      ")N1CCN(": 484,
      "c(-c2ccccc2)": 485,
      "C#N)": 486,
      "S(C)(=O)": 487,
      "O=C(NCC": 488,
      "c3ccc(F)cc": 489,
      "c3ccccc23)": 490,
      "c2ccco": 491,
      "c1ccc(-c2cn": 492,
      "4CCCC": 493,
      "c3ncn": 494,
      "#N)": 495,
      "c(C": 496,
      "=C(N": 497,
      "CC(=O)O)": 498,
      "c2ccc(F)cc2)": 499,
      "c1)c1ccccc1": 500,
      "c1cccs1": 501,
      "c2-": 502,
      "c34)": 503,
      "C1CCN(": 504,
      "C#N": 505,
      "Cc2ccccc2": 506,
      "c2cccs": 507,
      "CCC(C)": 508,
      "[O-])": 509,
      "C(F)(F)F": 510,
      "c1cs": 511,
      "S1": 512,
      "c1ccc(-n2": 513,
      "c1O": 514,
      "C(NC(=O)": 515,
      "O=C(CSc1n": 516,
      "c2ccccn2)": 517,
      "c3ccc(-": 518,
      "CCC(=O)N": 519,
      "cccc3": 520,
      ")ccc3": 521,
      "O=C(CO": 522,
      "n[nH]": 523,
      "O=C1c2ccccc2": 524,
      "3CCN": 525,
      ")c1ccccc1": 526,
      "C)cc1": 527,
      "CC(=O)O": 528,
      "(Cc2ccccc2)": 529,
      "nc(S": 530,
      "nn1": 531,
      "NS(=O)(=O)": 532,
      "c2cc(N": 533,
      "C(O": 534,
      "c1ccco1": 535,
      "c2c(c1)": 536,
      "c(C(=O)N": 537,
      "c6": 538,
      "c1ccc(-c2ccccc2)cc1": 539,
      "CCC2(": 540,
      "([O-])": 541,
      "ncc3": 542,
      "-2": 543,
      "c3ccccc23)cc1": 544,
      "C(N)=O)": 545,
      "c5cc": 546,
      "cn2)cc1": 547,
      "cc1": 548,
      "c2=O)": 549,
      "c1cc2cccc": 550,
      "=C(O)": 551,
      "CCN(CC)": 552,
      "2CCOCC2)": 553,
      "-c1ccccc1": 554,
      "CCCCN": 555,
      "c2cs": 556,
      "c(S": 557,
      "c3)n": 558,
      "O=C(COC(=O)": 559,
      "c1ccc(CN2": 560,
      "c2ccncc": 561,
      "(N)": 562,
      "P(=O)(O)": 563,
      "C(O)C(O)": 564,
      "N=C1": 565,
      "c1ccc(S(=O)(=O)N": 566,
      "CC(NC(=O)": 567,
      "CC1(C)": 568,
      "C2=O)": 569,
      "c3ccc(N": 570,
      "OC)c1": 571,
      "c(C)c1": 572,
      "c1ccncc1": 573,
      "c1ccc(OC": 574,
      "CN(C(=O)": 575,
      "CS(=O)(=O)": 576,
      "(C3": 577,
      "O=C(O": 578,
      "[S": 579,
      "C2C1": 580,
      "CCCN2": 581,
      "COc1cc2": 582,
      "S)": 583,
      "c2)CC1": 584,
      "C=C(": 585,
      "c2c(-": 586,
      "O=C(CNC(=O)": 587,
      "CC(C)C)": 588,
      "c4cn": 589,
      "CCCC(": 590,
      "C2CC2)": 591,
      "c3c2": 592,
      "CC(N": 593,
      "C1(": 594,
      "c3ccc4c(": 595,
      "c1nc(N": 596,
      "C(=O)NC": 597,
      "c2ccccc2)N1": 598,
      "3CCN(": 599,
      "c1[nH]": 600,
      "CC12": 601,
      "c2[nH]1": 602,
      "c1ccc(CO": 603,
      "CC5": 604,
      "c3cccc(": 605,
      "c3cc4": 606,
      "c1s": 607,
      "c1cccc2cccc": 608,
      "C(=N)N": 609,
      "n3cc": 610,
      "c2ccc(C": 611,
      "C4)": 612,
      "4CCO": 613,
      "c2cc1": 614,
      "C2=N": 615,
      "O=C(Nc1ccccc1)N": 616,
      ")N(": 617,
      "cn2)": 618,
      "c1cc(-c2ccccc2)": 619,
      "n2cn": 620,
      "c2ccccc2)C1": 621,
      "CCN(C)": 622,
      "Cc1cccc(": 623,
      ")cc21": 624,
      ")cc3)n": 625,
      "C(=O)O)cc": 626,
      "c1ccn": 627,
      "c3cccnc3": 628,
      "n1cc": 629,
      "c(cc1": 630,
      "c2ncccc2": 631,
      "c1cc(N": 632,
      "N=C(N": 633,
      "Cl)c(Cl)": 634,
      "=C2": 635,
      "C(Cc1ccccc1)": 636,
      "n1-c1ccccc1": 637,
      "c2ccc(OC": 638,
      "O=C(c1ccccc1)": 639,
      "s2)cc1": 640,
      "c1ccc(NC(=O)": 641,
      "n2-": 642,
      "c3ccccc32)cc1": 643,
      "C(=O)OC": 644,
      "s2)": 645,
      "c1ccc2c(c1": 646,
      "CCCC(=O)": 647,
      ")ccc21": 648,
      "O=C(CN": 649,
      "c2ccn": 650,
      "CC(CC(C": 651,
      "CCC(O)": 652,
      "c(N)": 653,
      "cn3)": 654,
      "COc1cccc(": 655,
      "c2ccccc2-": 656,
      "n12": 657,
      "OC)c(OC)": 658,
      "CCO)": 659,
      "CCCC3": 660,
      "C1=C(": 661,
      "3CCOCC3)": 662,
      "c3cccc4": 663,
      "C1CC": 664,
      "c3ccc4c(c3)": 665,
      "Cc1ccc2c(c1)": 666,
      "CC(N)": 667,
      "N1CCN(": 668,
      "nc2c1": 669,
      "Cl)cc": 670,
      "c1ccccn1)": 671,
      "OCO2": 672,
      "c(=O)[nH]1": 673,
      "C(=O)C2": 674,
      "c1ncn": 675,
      "c2cccc(-": 676,
      "O=C1CC(": 677,
      "c4ccccc4)n": 678,
      "C(=O)C(": 679,
      "c(OC": 680,
      "c2ccc3ccccc3": 681,
      "cn3": 682,
      "[nH+]": 683,
      "O=C1NC(=O)": 684,
      "[nH]2)cc1": 685,
      "cs1)": 686,
      "C1CCC2": 687,
      "C3)n": 688,
      "nc(C)": 689,
      "C2=O": 690,
      "O2)": 691,
      "CCCCC1)": 692,
      "c2ncnc3": 693,
      "Br)cc1": 694,
      "c[nH]1": 695,
      "Cc3ccccc3": 696,
      ")cc(-": 697,
      "c(NC(=O)": 698,
      "c4n": 699,
      "NC(": 700,
      "c1cncc": 701,
      "O=C(Cc1ccccc1)N": 702,
      "c3ccco": 703,
      "OC3": 704,
      "O=C(NCC1": 705,
      "O=c1c2ccccc2": 706,
      "CCOCC1)": 707,
      "c2cccnc2": 708,
      "C1CC2": 709,
      "c2ccco2)": 710,
      "o2)": 711,
      "C(O)=N": 712,
      "C2)c1": 713,
      "cc3": 714,
      "c1ncc2": 715,
      "c2ccccc2)n1": 716,
      "(Cl)cc": 717,
      "S1(=O)": 718,
      "O=C(Nc1cc": 719,
      "sc1": 720,
      "c2cccs2)": 721,
      "c2ccccc2C1": 722,
      "c1cccc(S(=O)(=O)N": 723,
      "on1": 724,
      "CCCC1)": 725,
      "c2cc3cccc": 726,
      "C(C)(C)C": 727,
      "CCCCO": 728,
      "c3ccccc3)CC2)": 729,
      "c3ccncc": 730,
      "Cc1ccc(-": 731,
      "C(=O)C1": 732,
      "O=C(c1ccccc1)N1": 733,
      "CC4)n": 734,
      "O2": 735,
      "c4[nH]": 736,
      "OCC1": 737,
      "c1ccc2ccccc2c1": 738,
      "OCC": 739,
      "n1cn": 740,
      "Cc1cc2": 741,
      "CCNCC2)": 742,
      "3)cc2)": 743,
      "c2ccc3c(c2)OCO": 744,
      "(C(=O)N": 745,
      "c3nc4ccccc4": 746,
      "Cl)n": 747,
      "[nH]c1": 748,
      "c3ccccc3)cc2)": 749,
      "C(F)(F)F)cc1": 750,
      "3)c1": 751,
      "CC(O": 752,
      "(CC": 753,
      "O=C(CC1": 754,
      "oc1": 755,
      "OCc1ccccc1": 756,
      "c2ccccc2n1": 757,
      "c3cccs": 758,
      "c(N)n": 759,
      "c2c1)": 760,
      "c1ccc(S": 761,
      ")cc(OC)c1": 762,
      "c1c[nH]c2ccccc12)": 763,
      "C1CCCC1": 764,
      "c2)n": 765,
      "C2)CC1": 766,
      ")ccc1O": 767,
      "C1CCC(": 768,
      "c2ccc(Cl)cc2": 769,
      "n2)c1": 770,
      "c3ccc(F)cc3)": 771,
      "cn1)": 772,
      "cnc1)": 773,
      "C(C(=O)N": 774,
      "c2cccc(Cl)": 775,
      "CCC12": 776,
      "c1cccc(Cl)": 777,
      "c1cccc(C": 778,
      "[N+](=O)[O-])cc1": 779,
      "CN1CCN(": 780,
      "c3ccc(O": 781,
      "C)cc": 782,
      "c1co": 783,
      ")N1CC": 784,
      "c2cccnc2)": 785,
      "Cc1ccc(N": 786,
      "CN3": 787,
      "NC(=O)N": 788,
      "Nc1ccccc1": 789,
      "O=C1O": 790,
      "c3ccccc32)": 791,
      "C2CC3": 792,
      "COc1ccc(-": 793,
      "c1ccccc1)Nc1ccccc1": 794,
      "(C(F)(F)F)": 795,
      "c3cccn": 796,
      "Cc1cc(C)": 797,
      "c1nn": 798,
      "CCCO1": 799,
      ")N2": 800,
      "c(cc2": 801,
      ")N1CCC(": 802,
      ")cc2c1": 803,
      "c2ccccc2)CC1)": 804,
      "C2CCN(": 805,
      ")N1CCCCC1": 806,
      "cnc4": 807,
      ")N1CCCC1": 808,
      "[N+]([O-])": 809,
      "C1CCCN1": 810,
      "=CC(=O)": 811,
      ")ccc12": 812,
      "CCC=": 813,
      "c2ccc3": 814,
      "c1cc2c(": 815,
      "c2c3c(": 816,
      "c3n2)cc1": 817,
      "CCCCN1": 818,
      "O=C(C=Cc1ccccc1)": 819,
      "Cc1ccco1": 820,
      "c(OC)c1": 821,
      "c4ccccc34)": 822,
      "CC(=O)N(": 823,
      "c2cccc3cccc": 824,
      "c2ccc(O)cc": 825,
      "oc(-": 826,
      "CN1C(=O)": 827,
      "c2ccc(S(=O)(=O)N": 828,
      "C2=O)cc1": 829,
      "CC2(": 830,
      "CCCCC2": 831,
      "c3ccccn3)": 832,
      "C(c1ccccc1)": 833,
      "3CCCCC3)": 834,
      "[n+]1": 835,
      "C4CCCC": 836,
      "c3ccc(Cl)cc3)": 837,
      "C=C2": 838,
      "c1ccc(C(=O)N": 839,
      "co1)": 840,
      "c2ccncc2)": 841,
      "C1CCCCC1)": 842,
      "c(CN": 843,
      "(N)(=O)": 844,
      "S(C)(=O)=O)": 845,
      "scc": 846,
      "c1ccccc1-": 847,
      "c1nnc(": 848,
      "CC(=O)N2": 849,
      "CO)": 850,
      "2CCOCC2)cc1": 851,
      ")ccc2c1": 852,
      "(Cc1ccccc1)": 853,
      "=S)": 854,
      "c1nc2c(": 855,
      "CCN1C(=O)": 856,
      ")cc4": 857,
      "C2CCCCC2)": 858,
      "C2CCC3": 859,
      "n3cn": 860,
      "C2O": 861,
      "C2CCC2": 862,
      "c(=N": 863,
      "c3c[nH]": 864,
      "c(=O)o": 865,
      "c1nc(-c2ccccc2)": 866,
      "O=[N+]([O-])": 867,
      "O=C(NCc1cc": 868,
      "c3ccccc3)cc2": 869,
      "c23": 870,
      "O=S1(=O)": 871,
      "NC(=O)C(": 872,
      "O=c1[nH]c(=O)": 873,
      "COc1ccc(N": 874,
      ")cc(OC)c1OC": 875,
      "c(C3": 876,
      ")NCc1ccccc1": 877,
      "c2ccc(Br": 878,
      "CCNCC2)cc1": 879,
      "n2C": 880,
      "C23": 881,
      "C2)n": 882,
      "CCCNC(=O)": 883,
      "Cc3ccccc3)": 884,
      "c2cc3c(cc2": 885,
      ")cc12": 886,
      "CCNCC1)": 887,
      "O=C(NN=C": 888,
      "Oc1ccccc1": 889,
      "(C)C3": 890,
      "C(=O)NC(C": 891,
      "c3cc(-": 892,
      "ccc2c1": 893,
      "O=c1o": 894,
      "[nH]c2c1": 895,
      "CCS(=O)(=O)": 896,
      "c2nnc(-": 897,
      "c(N2": 898,
      "CCN3": 899,
      "c2c(C)": 900,
      "C(=O)NCC": 901,
      "c2cc(C": 902,
      "C(=O)OC)": 903,
      "C1=O)": 904,
      "c1c[nH]c2ccccc12": 905,
      "c1ccc(Br)cc1": 906,
      "c2c(=O)": 907,
      "C(=O)c1ccccc1": 908,
      "c2c(N": 909,
      "3CCOCC3": 910,
      "s3)": 911,
      "c(C(F)(F)F)": 912,
      "c3ccncc3)": 913,
      "S(=O)(=O)c1ccccc1": 914,
      "[nH]2)": 915,
      "c1nnc(-": 916,
      "c3c2)": 917,
      "CCCC(C)": 918,
      "c2cc(O": 919,
      "O=C(COc1ccccc1)N": 920,
      "c3cccnc3)": 921,
      "COc1cc(C": 922,
      "O=C1C(=C": 923,
      "O=S(=O)(c1ccccc1)N1": 924,
      "3)C1)": 925,
      "c3ccccc3)n2)cc1": 926,
      "3)n2)cc1": 927,
      "c(=O)n1": 928,
      "C1CO": 929,
      "c1cccc2c1": 930,
      "c1ccc(CCN": 931,
      "CC=C": 932,
      "c1=O)": 933,
      "C1(C)": 934,
      "C1=C": 935,
      "O=C(c1cc": 936,
      "c1ccc(-n2cc": 937,
      "C=C(C)": 938,
      "CC(=N": 939,
      "c3ccc(Cl)cc3": 940,
      ")cc2)c1": 941,
      "c1cccc(Cl)c1": 942,
      "CCCCC2)": 943,
      "C(O)C1O": 944,
      "O)c(O)": 945,
      "Cn2": 946,
      "CCCn1": 947,
      "c1cccc2ccccc12": 948,
      "CCCC2)": 949,
      "c2cncc": 950,
      "C21": 951,
      "cnc2c1": 952,
      "O=C(NCCc1ccccc1)": 953,
      "nc(N)": 954,
      "3CCCCC3": 955,
      "c1c(C)": 956,
      "3)CC1": 957,
      "c3ccc(OC": 958,
      "Cc1ccc(S(=O)(=O)N": 959,
      "c3ccc(C": 960,
      "3CCCC3)": 961,
      "o1)": 962,
      "c2ccc(C(=O)N": 963,
      ")ccn1": 964,
      "n1)c1ccccc1": 965,
      "c2ccccc2N1": 966,
      ")N1CCOCC1": 967,
      "c2ccs": 968,
      "4CCN": 969,
      ")cc1)": 970,
      "c3ccccc3)CC2)cc1": 971,
      "(c2ccccc2)": 972,
      "CCc2ccccc2)": 973,
      "S=C(N": 974,
      "c(C(=O)O)": 975,
      "c1cncc(-": 976,
      "O=c1ccn(": 977,
      "c1ccc(C2=N": 978,
      "3CCCC3": 979,
      "C=CC(=O)": 980,
      "CC(F)(F)": 981,
      "C(=O)O)cc1": 982,
      "O=C1Nc2ccccc2": 983,
      "c2nnn": 984,
      "[nH]c(=O)": 985,
      "oc2c1": 986,
      "c2ccc(NC(=O)": 987,
      "no1": 988,
      "C(C#N)": 989,
      "OCC2": 990,
      "CCC(O": 991,
      "CCC(=O)O)": 992,
      "C3=O)": 993,
      "F)c(F)": 994,
      "n(-c2ccccc2)": 995,
      "O=C(CCc1ccccc1)N": 996,
      "CCc3ccccc3": 997,
      "c1cn(": 998,
      "O=C(C1": 999,
      "C(=O)NC1": 1000,
      "c(=O)[nH]c1=O": 1001,
      "(CO)": 1002,
      "S(=O)(=O)N1": 1003,
      "c(C(=O)": 1004,
      "C=CC1": 1005,
      "c2=O)cc1": 1006,
      "C(=O)N(C)": 1007,
      "c2ccc([N+](=O)[O-]": 1008,
      "H+]": 1009,
      "CCC2(CC1)": 1010,
      "C(c3ccccc3)": 1011,
      "O=C(C=Cc1ccccc1)N": 1012,
      "c1ccc(Cl)cc1)": 1013,
      "N(C)": 1014,
      "Cc1cc(N": 1015,
      "CC3CC(CC(C": 1016,
      "O=C1C2": 1017,
      "c2ncc3": 1018,
      "(C#N)": 1019,
      "c2nnc(": 1020,
      "2CCCCC2)": 1021,
      "n4)": 1022,
      "CCCN(C": 1023,
      "C(Cc1ccccc1)N": 1024,
      "c2C1": 1025,
      "CC3CC(CC(C3)C1)": 1026,
      ")cc2)CC1": 1027,
      "N=C(O)": 1028,
      "c1cccc2ccccc12)": 1029,
      "C(=NN": 1030,
      "CCC21": 1031,
      "CCN(S(=O)(=O)": 1032,
      "c2ccccc2)N": 1033,
      "c4cc(": 1034,
      "3)C2": 1035,
      "COC1": 1036,
      "c1ccc(CS": 1037,
      "Cc1ccc(NC(=O)": 1038,
      "c34": 1039,
      "CC2CC2)": 1040,
      "c(Cl)c1": 1041,
      "CCC(NC(=O)": 1042,
      "c2ccc3[nH]": 1043,
      "n2cnc3": 1044,
      "OCc1ccccc1)": 1045,
      "n2c1": 1046,
      "c1ccc(Oc2ccccc2)cc1": 1047,
      "nc1-": 1048,
      "n23)cc1": 1049,
      "oc2ccccc12": 1050,
      "CC1(": 1051,
      "CC(c2ccccc2)": 1052,
      "[nH]3)": 1053,
      "c(=O)cc": 1054,
      "C3)cc1": 1055,
      "c2cc(S(=O)(=O)N": 1056,
      "[nH]1)": 1057,
      "c([N+](=O)[O-])": 1058,
      "c4ncc": 1059,
      "CCC(=O)": 1060,
      "n2ccn": 1061,
      "3C)": 1062,
      "C(OC(C)=O)": 1063,
      "c(Br)": 1064,
      "(Cl)ccc2": 1065,
      "c1ccc2c(c1)OCO2": 1066,
      "O=S(=O)(c1ccccc1)": 1067,
      "Cc2cn": 1068,
      "c2s1": 1069,
      "(-c2ccccc2)": 1070,
      "c1ccc([N+](=O)[O-])cc1": 1071,
      "c2ccccn2)cc1": 1072,
      "Cc2ccccc2)cc1": 1073,
      "c3ccc4ccccc4": 1074,
      "C(CO": 1075,
      ")cc(N": 1076,
      "C2O)": 1077,
      "c2)n1": 1078,
      "c5ccccc5)": 1079,
      "c3ccco3)": 1080,
      "OC(CO)": 1081,
      "CCCCCCCCCCCC": 1082,
      "c2ccnc(N": 1083,
      "Cc1cccnc1": 1084,
      "c-2": 1085,
      "c1cccc(F)": 1086,
      "CCCO3)": 1087,
      "CCN1CCN(": 1088,
      "c4ccc5": 1089,
      "C(=O)N(C": 1090,
      "c1ccc(CC": 1091,
      "S(N)(=O)": 1092,
      "c2cccc(F)": 1093,
      "OCO2)": 1094,
      "CNS(=O)(=O)": 1095,
      "(C)C(": 1096,
      "[n+]2": 1097,
      "ncn1": 1098,
      "COc1ccc(C2": 1099,
      "Cn1cc": 1100,
      "c(cc3": 1101,
      "C3CC3)": 1102,
      "c3c2)cc1": 1103,
      "c3ccc4c(c3)OCO": 1104,
      "c1cccc(O": 1105,
      "c1cc(C": 1106,
      "o3)": 1107,
      "C(#": 1108,
      "C3CCCCC3": 1109,
      "OC(C)": 1110,
      "C(F)": 1111,
      "CCCN(C(=O)": 1112,
      "CC1=": 1113,
      "O3)": 1114,
      "c3cncc": 1115,
      "[S+]": 1116,
      "cs2)cc1": 1117,
      "CC#": 1118,
      "c(-c3ccccc3)": 1119,
      "[P": 1120,
      "C(c2ccccc2)N1": 1121,
      "c1ccc2c(c1)OCCO": 1122,
      "CO1": 1123,
      "6)": 1124,
      "c2cccc(O": 1125,
      ")N1CCN(c2ccccc2)CC1": 1126,
      "c4c3": 1127,
      "c4ccc(F)cc": 1128,
      "2CCCC2)": 1129,
      "c4)n": 1130,
      "Cc1c(": 1131,
      "c1ncn2": 1132,
      ")cc4)": 1133,
      "3)cc2)cc1": 1134,
      "O=c1cc(-c2ccccc2)": 1135,
      "CC1CN(": 1136,
      "c3cccc(Cl)": 1137,
      "Cc1cccs1": 1138,
      "c2cccc(N": 1139,
      "c2n[nH]": 1140,
      "c1ccccc12": 1141,
      "c2nn": 1142,
      "CC2)CC1": 1143,
      "CC21": 1144,
      "c2ccc(CN": 1145,
      "C(C)N": 1146,
      "c(=S)": 1147,
      "2CCCCC2)cc1": 1148,
      "CCC)": 1149,
      "sc2c1": 1150,
      "CCCO2)": 1151,
      "(C)c1": 1152,
      "oc(": 1153,
      "O2)cc1": 1154,
      "COc1ccc2c(c1)": 1155,
      "c2c[nH]c3ccccc23)": 1156,
      "c4ccccc43)": 1157,
      "c1cc2cc": 1158,
      "c2)C1": 1159,
      "c2nc3c(": 1160,
      "O=C1CC2": 1161,
      "3)cc2": 1162,
      "Cc1cccc(-": 1163,
      "CC(C)(C)O": 1164,
      "nc12": 1165,
      "c3cc2": 1166,
      "NC(=O)CS": 1167,
      "cnc12": 1168,
      "CC(C)=": 1169,
      "Nc1n": 1170,
      "S(C)(=O)=O)cc": 1171,
      "c2cccc(C(F)(F)F)": 1172,
      "c3cccs3)": 1173,
      "CCCS": 1174,
      "3CCOCC3)n": 1175,
      "2CCCC2": 1176,
      "O=C(OC1": 1177,
      "c(S(=O)(=O)N": 1178,
      "O)cc2": 1179,
      "OC)c(OC)c(OC)": 1180,
      "CCCCCC1": 1181,
      "c(NC": 1182,
      "CCC3)": 1183,
      "CCN(Cc2ccccc2)CC1": 1184,
      "Cc1cc(C": 1185,
      "OC4": 1186,
      "CCc1ccccc1)": 1187,
      "c3nc(-": 1188,
      "n3)n": 1189,
      "c(C#N)": 1190,
      "nc2ccccc12": 1191,
      "C1CCC1": 1192,
      "CC5)": 1193,
      "c1nccs1": 1194,
      "c2ccc(F)cc2": 1195,
      "cccc12": 1196,
      "C(OC(=O)": 1197,
      "c1ccc(O)cc1": 1198,
      "CCC3(": 1199,
      "cccc4": 1200,
      "c3ccn": 1201,
      "c2co": 1202,
      "c2ccc3c(c2)OCO3)": 1203,
      "c1ccc2o": 1204,
      "CCOCCO": 1205,
      "NC1": 1206,
      "H]": 1207,
      "C2CCC1": 1208,
      "c(=O)n(C)": 1209,
      "c1c[nH]cn1": 1210,
      "Cc1ccc(O": 1211,
      "c2nc(-c3ccccc3)": 1212,
      "Cc1nc(": 1213,
      "O=C(CCCC": 1214,
      "2CCN(": 1215,
      "c2ccccc2Cl)": 1216,
      "Cc1ncc": 1217,
      "c1ccc(Cn2": 1218,
      "c1ccc(Cl)": 1219,
      "c1C": 1220,
      "c3ccs": 1221,
      "4CCOCC4)": 1222,
      "O)cc1)": 1223,
      "I)": 1224,
      "Cc1cc(-": 1225,
      "c1ccc(N2CCN(": 1226,
      "P(=O)(O)O": 1227,
      "5CCCC": 1228,
      "ncc1)": 1229,
      "O=C(Nc1ccccc1": 1230,
      "c3nc(": 1231,
      ")N1CCNCC1": 1232,
      "N=Cc1ccccc1": 1233,
      "CNC": 1234,
      "CC1CCCCC1": 1235,
      "C(=O)C=": 1236,
      "c1ccc(-c2cs": 1237,
      "c2C)": 1238,
      "Cc1cs": 1239,
      "3CCC(": 1240,
      "(CCCC": 1241,
      "N(C": 1242,
      "Cc1cccc(N": 1243,
      "c2ccc(C3": 1244,
      "c1ccc(C(": 1245,
      "C2(C)": 1246,
      "C(N)=O": 1247,
      "Nc1nc(": 1248,
      "N=C(N)N": 1249,
      "nc(-c2ccccc2)": 1250,
      "cnc32)": 1251,
      "c2cc3ccccc3": 1252,
      "c(F)c1": 1253,
      "4CCOCC4": 1254,
      "[nH]cc": 1255,
      "O)c1": 1256,
      "CCC2)": 1257,
      "C2)C1": 1258,
      "c2cc(F)cc": 1259,
      "c4ccc(Cl)cc": 1260,
      "CC(C(=O)N": 1261,
      "c1ccc(F)cc1)": 1262,
      "COc1cc2c(cc1": 1263,
      "C2)N": 1264,
      "CN(C)C(=O)": 1265,
      "-3": 1266,
      "COc1cc(-": 1267,
      "C2=": 1268,
      "C3CCCCC3)": 1269,
      "c3ncccc3": 1270,
      "c(=O)n2": 1271,
      "COc1ccc(S(=O)(=O)N": 1272,
      "2CCOCC2)c1": 1273,
      "c2cc(C(=O)N": 1274,
      "[PH]": 1275,
      "nc2-": 1276,
      "c1ncc(-": 1277,
      "N1CCOCC1": 1278,
      "nc4": 1279,
      "CCNS(=O)(=O)": 1280,
      "COc1ccc(NC(=O)": 1281,
      "c2ccccc2F)": 1282,
      "CC3)cc1": 1283,
      "S2": 1284,
      "c1ccc(Cn2cc": 1285,
      "C(=O)c3ccccc3": 1286,
      "(-c3ccccc3)": 1287,
      "n(-c3ccccc3)": 1288,
      "c2o1": 1289,
      "O=C1CS": 1290,
      "c3ccc(F)cc3": 1291,
      "c1c(-": 1292,
      "c1ccc(-c2nc3ccccc3": 1293,
      "c1ccc(-c2ccccc2)": 1294,
      "(Cl)ccc1": 1295,
      "=O)Nc1ccccc1": 1296,
      "C2CCC(": 1297,
      "c1cnc(N": 1298,
      "O=C(Nc1cccc(": 1299,
      "C(F)(F)F)c1": 1300,
      "C12CC3CC(CC(C3)C1)": 1301,
      "o2)c1": 1302,
      "c(=O)n(": 1303,
      "c3ccc(O)cc": 1304,
      "c23)c1": 1305,
      "C2CCCC2)": 1306,
      "n5": 1307,
      "c1cc(=O)": 1308,
      "P(=O)(O)O)": 1309,
      "C1C": 1310,
      "O=C(CN1C(=O)": 1311,
      "c1nc2ccccc2s1": 1312,
      "c2ccccc21)": 1313,
      "c2ncccc2c1": 1314,
      "NCC": 1315,
      "C(=N)": 1316,
      "C(=S)": 1317,
      "C4)n": 1318,
      "C2=C(": 1319,
      "CCOc1ccccc1": 1320,
      "O=C(Cn1cc": 1321,
      "ncn2": 1322,
      "(Cl)cc(Cl)": 1323,
      "c2cccnc2)cc1": 1324,
      "CC1=C(": 1325,
      "N1C(=O)": 1326,
      "c4ccncc": 1327,
      "=NN": 1328,
      "c3cc(C": 1329,
      "#N": 1330,
      "C(=O)N1CCN(": 1331,
      "[nH]n1": 1332,
      "c1n[nH]": 1333,
      "3CCNCC3)": 1334,
      "4)cc3": 1335,
      "2)c1ccccc1": 1336,
      "C(=O)Nc1ccccc1": 1337,
      "c2ccc(C(F)(F)F": 1338,
      "4)C2)": 1339,
      "Cc1ccc(Cl)cc1": 1340,
      "O=C(C": 1341,
      "c1cn[nH]c1": 1342,
      "no": 1343,
      "CCNC1": 1344,
      "c2c(c1": 1345,
      "c1ccc(Nc2ncn": 1346,
      ")NC1": 1347,
      "Cn1cn": 1348,
      "O=C(Nc1ccccc1)c1ccccc1": 1349,
      "c3cc4c(cc3": 1350,
      "n4cc": 1351,
      "c(O)c1": 1352,
      "CC(=O)OC1": 1353,
      "c1ccsc1": 1354,
      "c2ccc(-c3ccccc3": 1355,
      "O=C1CCC2": 1356,
      "c32)cc1": 1357,
      "Cc1ccc(C(=O)N": 1358,
      "c1ccc(CC2": 1359,
      "c2ccc(O)cc2)": 1360,
      "CCCCC3": 1361,
      "CCOCC2)": 1362,
      "cn2)CC1": 1363,
      "CC=C(": 1364,
      "C(=O)C3": 1365,
      "P(=O)(O": 1366,
      "c3ccc(Br": 1367,
      "OC)c(OC": 1368,
      "co2)cc1": 1369,
      "CCC5": 1370,
      "c2N": 1371,
      "O=C(NN=": 1372,
      "c3cn[nH]": 1373,
      "3)C1": 1374,
      "c3ccncc3": 1375,
      "S(=O)(=O)c2ccccc2)": 1376,
      "Cc1c[nH]": 1377,
      "4)cc3)": 1378,
      "c2ccc(-c3ccccc3)cc2)": 1379,
      "COc1cc(N": 1380,
      "C(C)(": 1381,
      "c1cccnc1)": 1382,
      "CCOc1ccc(": 1383,
      "c1cnccn1": 1384,
      "c1ccc(-c2nc(": 1385,
      "SC1=": 1386,
      "c2cc(NC(=O)": 1387,
      "c1ccc(-c2ncc": 1388,
      "C(C(=O)O)": 1389,
      "C(=O)N1CCCC1": 1390,
      "3CC4": 1391,
      "O=C(Nc1ccccc1)N1": 1392,
      "c1cc2c(cc1": 1393,
      "c2c3ccccc3": 1394,
      "c(-c3ccccc3)n": 1395,
      "ccccc4": 1396,
      "c2cco": 1397,
      "(CC(=O)N": 1398,
      "C(C)=O": 1399,
      "c1nccs1)": 1400,
      "c2scc": 1401,
      "c3c(-": 1402,
      "CC1)c1ccccc1": 1403,
      "C1c1ccccc1": 1404,
      "n2)CC1": 1405,
      "c1nnn": 1406,
      "CC3)cc2": 1407,
      "O=C1CC": 1408,
      "C1=CC2": 1409,
      "c2cn[nH]": 1410,
      "c1cn2": 1411,
      "N(C(=O)": 1412,
      "O=C1CCC(": 1413,
      "C#C": 1414,
      "[N+](C)": 1415,
      "c2ccc(Cl)c(Cl)": 1416,
      ")cc(=O)": 1417,
      "C(=O)N1c1ccccc1": 1418,
      "c3ccccn3": 1419,
      "c1ccc(Cl)c(Cl)": 1420,
      "c1cncc(": 1421,
      "c4cccnc4": 1422,
      "(C(=O)": 1423,
      "c1cccc(NC(=O)": 1424,
      "CC(C)O": 1425,
      "Cc1ccc(F)cc1": 1426,
      "C(Cc2ccccc2)": 1427,
      "c3cc(O": 1428,
      "CCCCCCCCCCCCCCCC": 1429,
      "c1cccc(F)c1": 1430,
      "c2no": 1431,
      "C(=O)NC(Cc1ccccc1)": 1432,
      "O=C1CO": 1433,
      "Cc1ccccc1)c1ccccc1": 1434,
      "c2cc(Cl)ccc2": 1435,
      "c1ccc(C(F)(F)F)cc1": 1436,
      "S)N": 1437,
      "C1CCN(S(=O)(=O)": 1438,
      "c1cccc2cc": 1439,
      "c1c2c(": 1440,
      "O=c1cc(-": 1441,
      "c2cccc3ccccc23)": 1442,
      "c3cco": 1443,
      "c1csc(-": 1444,
      "OCO3": 1445,
      "O=C(NCCN1": 1446,
      "c1ccc(Nc2ncc": 1447,
      "c3cccc4cccc": 1448,
      "CC(C)N": 1449,
      "c1ccc2s": 1450,
      "c1ccc2[nH]ccc2c1": 1451,
      "O=C1CN": 1452,
      "c3cc(N": 1453,
      "c3s": 1454,
      "C2C3": 1455,
      "CC2C1": 1456,
      "c2ccccn2)CC1": 1457,
      "C1CCNCC1": 1458,
      "2)n1": 1459,
      "SCC(=O)N": 1460,
      "C=CC(": 1461,
      "(-c3ccccc3)n": 1462,
      "2CCCC2)cc1": 1463,
      "occ": 1464,
      "O=C1CC(c2ccccc2)": 1465,
      "c6cccc": 1466,
      "c2cc1OC": 1467,
      "c2cc(C)": 1468,
      "SC": 1469,
      "Cn1cc(": 1470,
      "c2ccc(-c3n": 1471,
      "Oc2ccccc21": 1472,
      "=C(N)N": 1473,
      "c1c(O)": 1474,
      "CCC(N)": 1475,
      "COc1cccc(-": 1476,
      "c2cc(OC": 1477,
      "NC(=O)C1": 1478,
      "c1cnn(-": 1479,
      "c2ccc(Cl)": 1480,
      "c2ccc(Br)cc2)": 1481,
      "c(-c2ccccc2)n1": 1482,
      "NC(=S)N": 1483,
      "C2CO": 1484,
      ")N(C": 1485,
      "5)n": 1486,
      "Cn1c(=O)": 1487,
      "c13)": 1488,
      "c1ccc2c(N": 1489,
      "O=C(NCCCN1": 1490,
      "CCn1cc": 1491,
      "C(=N)N)": 1492,
      "c(CN2": 1493,
      "COc1ccc(C(=O)N": 1494,
      "c5)": 1495,
      "C=CC(=O)N": 1496,
      "OCO4": 1497,
      "c1cc2c(s1)": 1498,
      "c2ccc(C)cc2)": 1499,
      "c2cnc(N": 1500,
      "(CO": 1501,
      "CC1OC(": 1502,
      "S(=O)(=O)C1": 1503,
      "OC(CO)C(O)C(O)": 1504,
      "cnc23)cc1": 1505,
      "N1CCCCC1": 1506,
      "c4ccco": 1507,
      "CCO1": 1508,
      "s1)c1ccccc1": 1509,
      "C(CC(C)C)": 1510,
      "C(=O)OC(C)(C)C)": 1511,
      "c1ccc2ncccc2c1": 1512,
      "c1cc(O": 1513,
      "C(C)=O)cc": 1514,
      "C5CCC4": 1515,
      "CCCC(=O)N": 1516,
      "c2ccc(C)": 1517,
      "CC2)C1": 1518,
      "c3ccccc3n2)cc1": 1519,
      "C(C1)": 1520,
      "CCCC4": 1521,
      "CC1CCCO1": 1522,
      "O=C(NC1CCCCC1)": 1523,
      "c3ccc(C(F)(F)F)cc": 1524,
      "c3cccc(F)": 1525,
      "c2ccccc2o1": 1526,
      "CC(CC(C4)C2)": 1527,
      "c4ccc(-": 1528,
      "COc1ccc(OC)": 1529,
      "OCc2ccccc2)": 1530,
      "C(=O)N1CCC(": 1531,
      "OC(CO": 1532,
      "c2c(cc": 1533,
      "c2c1cc": 1534,
      "cn2)c1": 1535,
      "CC1CC1": 1536,
      "N=C(N)": 1537,
      "c3ccc(-c4ccccc4": 1538,
      "O=c1cc[nH]": 1539,
      "c1ccc(-c2cc3": 1540,
      "C2CCCCC2": 1541,
      "CCCCCC": 1542,
      "CCN(C)C)": 1543,
      "c2c(Cl)": 1544,
      "=N1": 1545,
      "nc(O)": 1546,
      ")cc(C)": 1547,
      "c4ncn": 1548,
      "c2ccccc2c1=O": 1549,
      "c1ccc2c(c1)OCCO2": 1550,
      "c45)": 1551,
      "CCC4C5": 1552,
      "c1ccc(-n2cn": 1553,
      "c3ccc4c(c3)OCO4)": 1554,
      "cnc21": 1555,
      "CCC3(C)": 1556,
      "4)CC3)": 1557,
      "O)c(": 1558,
      "C(=O)c2ccccc21": 1559,
      "C2C": 1560,
      "c1cnn2": 1561,
      "O=C(NC(": 1562,
      "c4ccccc4)CC3)": 1563,
      "3CCNCC3": 1564,
      "O=C(Nc1cccc(-": 1565,
      "c1N": 1566,
      "c2ccncn": 1567,
      "CO2": 1568,
      "CCCCCCN": 1569,
      "C2CCCCC2)cc1": 1570,
      "C(=O)NC(C)": 1571,
      "CC(OC(=O)": 1572,
      "(Cl)ccc3": 1573,
      "CCCCNC(=O)": 1574,
      "c1ccc2c(-": 1575,
      "c3cs": 1576,
      "CCCN3": 1577,
      "CCOC(=O)C1": 1578,
      "C(=O)N3": 1579,
      ")ccc2n1": 1580,
      "FC(F)(F)": 1581,
      "c3=O)": 1582,
      "CC2)ccc1": 1583,
      "c1nc2ccccc2[nH]1": 1584,
      "nc(C": 1585,
      "[SH+]": 1586,
      "c(=O)n3": 1587,
      "c1ccco1)": 1588,
      "nc[nH]": 1589,
      "O=c1cc(N": 1590,
      "CCc1n": 1591,
      "NC(=O)c1ccccc1": 1592,
      "CCN(c2ccccc2)CC1": 1593,
      "c3c(N": 1594,
      "n2C)": 1595,
      "3cc": 1596,
      "CS(=O)(=O)N": 1597,
      "CCn2": 1598,
      "c2ncnc(N": 1599,
      "nc2n1": 1600,
      "COC(": 1601,
      "c2ccncc2)cc1": 1602,
      "c2ccc(OC)cc2)": 1603,
      "S=": 1604,
      "C(=S)N1": 1605,
      "c4ccc5c(": 1606,
      "c1ccc2nc(": 1607,
      "OC(C)(C)": 1608,
      "CN1CCC(": 1609,
      "c1cncnc1": 1610,
      "c32)": 1611,
      "Cc1no": 1612,
      "c1-c1ccccc1": 1613,
      "C1)c1ccccc1": 1614,
      "O)cc(O)": 1615,
      "C6": 1616,
      "(CC)": 1617,
      "c1o": 1618,
      "c4nn": 1619,
      "c3nnn": 1620,
      "c5ccc(": 1621,
      "n1-c1ccccc1)": 1622,
      "Cc1nc(N": 1623,
      "cnc32)cc1": 1624,
      "c4cccc5": 1625,
      "c4ccc(N": 1626,
      "nc(SCC(=O)N": 1627,
      "(CN": 1628,
      "C(F)(F)F)cc(C(F)(F)F)": 1629,
      "COc1ccc(-c2n": 1630,
      "c2ccccc2N": 1631,
      "F)cc2": 1632,
      "c23)CC1": 1633,
      "C1=CN": 1634,
      "CC(C)CC(NC(=O)": 1635,
      "C12CC3CC(CC(C3)C1)C2": 1636,
      "CCC(=O)O": 1637,
      "c(SCC(=O)N": 1638,
      "Cc1cc(=O)": 1639,
      "S)=N": 1640,
      "c2ccccc21)N": 1641,
      "2)N": 1642,
      "C(=O)C=C": 1643,
      "c1ccc2n": 1644,
      "C(=O)CS": 1645,
      "c3c(C)": 1646,
      "O=c1oc2ccccc2": 1647,
      "O=C1C(=Cc2ccccc2)": 1648,
      "Cc1ccccc1-": 1649,
      "COC(=O)C1": 1650,
      "CN2CCN(": 1651,
      "(C=C": 1652,
      "c2cccc(Cl)c2)": 1653,
      "c1cccs1)": 1654,
      "C3CCCC3": 1655,
      "S(N)(=O)=O)cc": 1656,
      "c2ccccc2)NC(=O)": 1657,
      "Cc1ccc(C)": 1658,
      "O=C1C=CC(=O)": 1659,
      "c2ccc3ccccc3c2)": 1660,
      "c2ccc3c(c2)OCCO": 1661,
      "c2-c2ccccc2)cc1": 1662,
      "c(n2)": 1663,
      "(Cl)c(": 1664,
      "=S": 1665,
      "s2)c1": 1666,
      "C3O)": 1667,
      "O=C1c2ccccc2C(=O)N1": 1668,
      "(C(=O)O)": 1669,
      "c2c(F)": 1670,
      "3cccc": 1671,
      "O=C1OC(": 1672,
      "cn12": 1673,
      "CCOC1": 1674,
      "3)nc2c1": 1675,
      "C(=Cc1ccccc1)": 1676,
      "2)nc1": 1677,
      "c1ncccc1": 1678,
      "c1ccc(F)": 1679,
      "C2CCCN2": 1680,
      "C1N": 1681,
      "CC(=C": 1682,
      "nc1)": 1683,
      "CCCn1cc": 1684,
      "cc2c1": 1685,
      "c2ccncc2": 1686,
      "O=C(NN=Cc1ccccc1)": 1687,
      "c2N1": 1688,
      "N=C2": 1689,
      "C#N)cc1": 1690,
      "c1ccc2c(c1)N": 1691,
      "c1ccc(-c2ccc(-": 1692,
      "c2nn[nH]": 1693,
      "c1ccc(NC": 1694,
      "c2ccc(Cl)cc2Cl)": 1695,
      ")cc23)cc1": 1696,
      "c(n1)": 1697,
      "3CCCCC3)n": 1698,
      "O=C1C=CC2": 1699,
      "c1ncc2ncn": 1700,
      "CC(F)(F)F)": 1701,
      "COc1c(": 1702,
      "C(CN": 1703,
      "c1ccc(C)cc1": 1704,
      "C(Cl)": 1705,
      "c3nc(N": 1706,
      "=NNC(=O)": 1707,
      "C(CCC3": 1708,
      "O=c1cc(": 1709,
      "O=C(OC": 1710,
      "c2c(O)": 1711,
      "CCCO3)c2n1": 1712,
      ")cc(OC)": 1713,
      "c4c3)": 1714,
      "c6ccccc6": 1715,
      "C(=O)NC2": 1716,
      "c2ccccc2)cc1)": 1717,
      "COc1cc2c(cc1OC)": 1718,
      "4)CC3": 1719,
      "c2ccc(Cl)cc2)cc1": 1720,
      "nc(SC": 1721,
      "c3cc(Cl)ccc3": 1722,
      "C(C)C)cc1": 1723,
      "c2cc[nH]": 1724,
      "5CCO": 1725,
      "n1C": 1726,
      "C(=NO)": 1727,
      "cccc2c1": 1728,
      "c1cc2ccccc2[nH]1": 1729,
      "CC1O": 1730,
      "CC1CCC(": 1731,
      "O=C1C=C(": 1732,
      "[N+](=O)[O-])c1": 1733,
      "CC3)n2)cc1": 1734,
      "O=C(NC": 1735,
      "C23CC4": 1736,
      "cn1)N": 1737,
      "C3(": 1738,
      "C(=O)c2ccccc2": 1739,
      "c1ccc(-c2ccc(": 1740,
      "c1cccc(C)c1": 1741,
      "c2ccccc2c1)": 1742,
      "c5cn": 1743,
      "nc1-c1ccccc1": 1744,
      "C(=O)C(C)": 1745,
      "CCc2c(": 1746,
      "4CCCCC4)": 1747,
      "c2[nH]c3ccccc3": 1748,
      "C5)": 1749,
      "c3cccnc3)n": 1750,
      "c2cc(C3": 1751,
      "c(-c3ccc(": 1752,
      "CC(=O)NC(": 1753,
      "e]": 1754,
      "(Cc3ccccc3)": 1755,
      "c2cc(=O)": 1756,
      "CC(=": 1757,
      "O=C1C": 1758,
      "c2ccco2)cc1": 1759,
      "c3ccccn3)n": 1760,
      "c[nH+]": 1761,
      "c3ccccc3)ccc2": 1762,
      ")cc2)n1": 1763,
      "Cc1ccncc1": 1764,
      "N1CCCC1": 1765,
      "c3ccc4[nH]": 1766,
      "C1=C2": 1767,
      "c3cccc(-": 1768,
      "c2cc3cc": 1769,
      "CC(C)(O)": 1770,
      "n3-": 1771,
      "[n+](": 1772,
      "c2ccc3n": 1773,
      "CC=C(C)": 1774,
      "N#Cc1": 1775,
      "c2ccc(F)": 1776,
      "cnc2c1ncn2": 1777,
      "CN2CCC(": 1778,
      "CCCCC3)": 1779,
      "C1CCS(=O)(=O)C1": 1780,
      "c(CO": 1781,
      "c1ccc(-c2ccccc2)cc1)": 1782,
      "CCN(CC": 1783,
      "CC(=O)Nc1ccccc1": 1784,
      "c3)cc2": 1785,
      "c2cn1": 1786,
      "COc1ccc(Cl)cc1": 1787,
      "O1)": 1788,
      "CCC4(C)C3": 1789,
      "nc(NC(=O)": 1790,
      "c3cc(F)cc": 1791,
      "c1ccc(O)cc1)": 1792,
      "OC(F)": 1793,
      "c1cc2ccccc2o1": 1794,
      "C1CCCO1": 1795,
      "CC(CO)": 1796,
      "c-3": 1797,
      "c4cccn": 1798,
      "c(C2": 1799,
      "CCCC(N": 1800,
      "CCCCC2)cc1": 1801,
      "C(=O)OCC)": 1802,
      "=C3": 1803,
      "C3CCN": 1804,
      "c1ncc(": 1805,
      "O)cc(": 1806,
      "c3ccc([N+](=O)[O-]": 1807,
      "O=C(CNS(=O)(=O)": 1808,
      "c1ccc2nc(N": 1809,
      "CCl": 1810,
      "O=C(N1": 1811,
      "c1ccc(NS(=O)(=O)": 1812,
      "c3c[nH]c4ccccc34)": 1813,
      "C(S)=N": 1814,
      "F)cc2)cc1": 1815,
      "c3[nH]2)cc1": 1816,
      "cs1)c1ccccc1": 1817,
      "c2cccc3cc": 1818,
      "CNCC2": 1819,
      "CC2)n1": 1820,
      "4CCCCC4": 1821,
      "n3ccnc3": 1822,
      "C(C)(O)": 1823,
      "[Si": 1824,
      "c1ccc(-c2cc(-": 1825,
      "Cc2ccc(": 1826,
      "ncc2c1": 1827,
      "CC(N)=O)": 1828,
      "O=C1CCCC2": 1829,
      "C3CCCC3)": 1830,
      "c(=O)c2": 1831,
      "C(C)CO)": 1832,
      "c2cncn": 1833,
      "CCN1CCOCC1": 1834,
      "O=C(Nc1ccccc1)C1": 1835,
      "C(=O)N2CCN(": 1836,
      "CCC(C)(C)": 1837,
      "4CCNCC4": 1838,
      "c3ccc(C)cc3)": 1839,
      "c(Cl)cccc1": 1840,
      "4CCOCC4)n": 1841,
      "n1Cc1ccccc1": 1842,
      "c1ccc2c(c1)OCO2)": 1843,
      "CCn1cc(": 1844,
      "CC2CCC(": 1845,
      "C=NNC(=O)": 1846,
      "n1cc(": 1847,
      "c1cn(Cc2ccccc2)": 1848,
      "c3n2)": 1849,
      "C1=CC(": 1850,
      "sc2": 1851,
      "[N-]": 1852,
      "CCC1)": 1853,
      "c(=O)[nH]c2=O)": 1854,
      ")NCCc1ccccc1": 1855,
      "c2ccc([N+](=O)[O-])cc2)": 1856,
      "c[nH]c2c1": 1857,
      "Cc1nc2ccccc2": 1858,
      "C(C)(C)C)cc1": 1859,
      "c3ncc(-": 1860,
      "cs2)": 1861,
      "c1cnc(-": 1862,
      "O=c1n": 1863,
      "c1ccc2c3c(": 1864,
      "CCCCCN": 1865,
      "CCCC3)": 1866,
      "C2CCN(C": 1867,
      "c1cn(-c2ccccc2)": 1868,
      "nnc(-": 1869,
      "C(=O)O1": 1870,
      "C2=O)c1": 1871,
      "N=c1[nH]": 1872,
      "CCCO1)": 1873,
      "CCc3ccccc3)": 1874,
      "c3ccccc3F)": 1875,
      "c3ccc4": 1876,
      "O=C(Nc1n": 1877,
      "c4cc5": 1878,
      "c2cccc3c2": 1879,
      "c2c3ccccc3n": 1880,
      "c(=O)c2c1": 1881,
      "c3cccc(C(F)(F)F)": 1882,
      "c2cccs2)cc1": 1883,
      "N3": 1884,
      "c1ccc(Cl)c(Cl)c1": 1885,
      "c2cc(F)": 1886,
      "c3ncncc3": 1887,
      "CCc2ccccc2C1": 1888,
      "CCC2(C)": 1889,
      "O=C(NC(=S)N": 1890,
      "c1cc(C)": 1891,
      "CC1CC1)": 1892,
      "c1cc(F)cc": 1893,
      "c(=O)n(C": 1894,
      "c1cc(Cl)ccc1": 1895,
      "nc(N)n": 1896,
      "c3ncccn3)": 1897,
      "c3c(c1)": 1898,
      "CCCc2ccccc21": 1899,
      "COCCO": 1900,
      "c3cccc(Cl)c3)": 1901,
      "CC(C)(": 1902,
      "CCCN1C(=O)": 1903,
      "c3ccco3)n": 1904,
      "c4ccccn4)": 1905,
      "Cc1cn(": 1906,
      "c3ccccc23": 1907,
      "[nH]2)c1": 1908,
      "Br)c1": 1909,
      "nc3)": 1910,
      "O=C(Nc1ccc(O": 1911,
      "N1CCC(": 1912,
      "CCCCN(": 1913,
      "c1cccc(C(F)(F)F)c1": 1914,
      "C23CC4CC(CC(C4)C2)": 1915,
      ")ccc4": 1916,
      "CC(F)": 1917,
      "4CCN(": 1918,
      "c4cn[nH]": 1919,
      "c1coc(-": 1920,
      "ncc4": 1921,
      "c2F)": 1922,
      "C2)n1": 1923,
      "CC3CC3)": 1924,
      "c3ccccc23)CC1": 1925,
      "c2ccc(=O)": 1926,
      "n[nH]1": 1927,
      "C)c1": 1928,
      "C(=Cc1cc": 1929,
      "C(Cc2ccccc2)NC(=O)": 1930,
      "c2cc3c(": 1931,
      "c4ccc5c(c4)": 1932,
      "c1ccc2c(=O)": 1933,
      "O=c1c(": 1934,
      "c3ccccc3-": 1935,
      "C=NN": 1936,
      "c1scc": 1937,
      "=C(C)": 1938,
      "C2CCCO2)": 1939,
      "c3ccccc13)": 1940,
      "ncc12": 1941,
      "c2cccc([N+](=O)[O-])": 1942,
      "Cc1ccc2c(c1)OCO2": 1943,
      "c2ccccc12)N": 1944,
      "c1cc2[nH]": 1945,
      "CCCCC1)N": 1946,
      "c3ncnc(N": 1947,
      "C=Cc1ccccc1": 1948,
      "O=C(NCC(=O)N1": 1949,
      "c(C)n": 1950,
      ")nc1": 1951,
      "CCCc1ccccc1": 1952,
      "N2C(=O)": 1953,
      "OCCN": 1954,
      "CCCCO1": 1955,
      "c1ncc2ncn(C3": 1956,
      "c1ccc2ncc": 1957,
      "c1c(-c2ccccc2)": 1958,
      "COc1ccccc1-": 1959,
      "O=C(c1ccco1": 1960,
      "C3CCC4": 1961,
      "C1CN": 1962,
      "c2C)cc1": 1963,
      "COc1cc(OC)": 1964,
      "c1ccc(N2CCOCC2)cc1": 1965,
      "Cc1nc(-": 1966,
      "C5CCC43C)": 1967,
      "C(Cc1c[nH]c2ccccc12)": 1968,
      "C=CC2": 1969,
      "cncc": 1970,
      "CC(CO": 1971,
      "C(O)(": 1972,
      "C2)nc1": 1973,
      "OCc3ccccc3)": 1974,
      "O=c1[nH]cn": 1975,
      "n2n1": 1976,
      "c1ccc(O)": 1977,
      "cc1-": 1978,
      "c2ncn3": 1979,
      "N1CCN(c2ccccc2)CC1": 1980,
      "c2ccc(N3": 1981,
      "CCCCn1": 1982,
      "c1ccnc(N": 1983,
      "c2cccc(C)": 1984,
      "c3C)": 1985,
      "c1ccon1": 1986,
      "c2cc(OC)c(OC)c(OC)": 1987,
      "CC2)nc1": 1988,
      "O3": 1989,
      "C3=N": 1990,
      "c1cccc(N2": 1991,
      "C=CCO": 1992,
      "n2ncc": 1993,
      "c3c2)c1": 1994,
      "c2ccccc2S": 1995,
      "CCCN(S(=O)(=O)": 1996,
      "4CCCC4)": 1997,
      "c1ccoc1": 1998,
      "C(=O)NCc1ccccc1": 1999,
      "O=C(Nc1ccccn1)": 2000,
      ")N1CC2": 2001,
      "Cn2cc": 2002,
      "S(=O)(=O)c1ccccc1)": 2003,
      "O=C(NC1CC1)": 2004,
      "nc2ccccc21": 2005,
      "[S+]([O-])": 2006,
      "C4CCC3": 2007,
      "CCCCCO": 2008,
      "O=P": 2009,
      "Cc1ccc2c(c1)OCO2)": 2010,
      "nc(-c3ccccc3)": 2011,
      "CC1CC2": 2012,
      "c3ccccc3)cc": 2013,
      "c2[nH]c(-": 2014,
      "C1=O)N": 2015,
      "[n+]([O-])": 2016,
      "c2c(F)cccc2": 2017,
      "CC1=N": 2018,
      "O=C(CSc1nnc(-": 2019,
      "O=S(=O)(C": 2020,
      "Cc1ccc(-n2": 2021,
      "c1ccc(OC)cc1": 2022,
      "=NN1": 2023,
      "c2ccc(C#N": 2024,
      "c3ccc(C(=O)N": 2025,
      "S2(=O)": 2026,
      "O=C(CSc1ncc": 2027,
      "S(C)(=O)=O": 2028,
      "c1ccc(OC2CCN(": 2029,
      "O=C1C(": 2030,
      "nn2)cc1": 2031,
      "#C": 2032,
      "C(N)=N": 2033,
      "C1O)": 2034,
      "c2cccc(O)": 2035,
      "c2ccc3c(c2": 2036,
      "c1ccccc1)S(=O)(=O)": 2037,
      "ncn3": 2038,
      "Cc1[nH]": 2039,
      "O=S(=O)(Nc1ccccc1)": 2040,
      "c4ccccc4c3": 2041,
      "n2ccnc2)cc1": 2042,
      "c1cc(S(=O)(=O)N": 2043,
      "4)cc": 2044,
      "c4cccc(": 2045,
      "c2ccc(C(F)(F)F)cc2)": 2046,
      "(C)C)cc1": 2047,
      "c1cc(C(=O)N": 2048,
      "C1CCN(C": 2049,
      "CCc2ccccc21": 2050,
      "C2CC(": 2051,
      "c4ccccc4)cc3": 2052,
      ")ccc1-": 2053,
      "C(N)=O)cc": 2054,
      "C(C(=O)": 2055,
      "[nH]c2ccccc12": 2056,
      "O=C(C=Cc1ccc(": 2057,
      "c2nc(C)": 2058,
      "c2cc(Br": 2059,
      ")NC1CCCCC1": 2060,
      "CCC12C": 2061,
      "COc1ccc(-n2": 2062,
      "nc21": 2063,
      "3CCN(C)": 2064,
      "CCC(=O)N1": 2065,
      "O=C(CCC1": 2066,
      "c1ccc[nH]1": 2067,
      "c2ccc(C(=O)O)cc": 2068,
      "c1nncs1": 2069,
      "[PH](=O)": 2070,
      "CC6": 2071,
      "c2nc(-c3ccccc3)n": 2072,
      "CCCO2)cc1": 2073,
      "n(Cc2ccccc2)": 2074,
      "cn4)": 2075,
      "O=C1c2ccccc2C(=O)": 2076,
      "n4)n": 2077,
      "2CCC(": 2078,
      "c3scc": 2079,
      "CCCC(C)=": 2080,
      "C34": 2081,
      "c3nc4ccccc4[nH]3)": 2082,
      "[Si]": 2083,
      "Cc1ccccc1)Nc1ccccc1": 2084,
      "COc1cc(OC": 2085,
      "[NH+]": 2086,
      "C1=C(C)": 2087,
      "CCCC)": 2088,
      "n(-c2ccccc2)n1": 2089,
      "CCC3(CC2)": 2090,
      "c1ccncc1)": 2091,
      "C1CCOCC1": 2092,
      "O=C1OC2": 2093,
      "CC2CO": 2094,
      "c4ccccc34": 2095,
