{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 60,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 60
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          0
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          1
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<bos>": 0,
      "<eos>": 1,
      "<pad>": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "(": 6,
      ")": 7,
      "*": 8,
      "+": 9,
      "-": 10,
      ".": 11,
      "/": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "6": 19,
      "7": 20,
      "8": 21,
      "9": 22,
      ":": 23,
      "<": 24,
      "=": 25,
      ">": 26,
      "?": 27,
      "@": 28,
      "B": 29,
      "C": 30,
      "F": 31,
      "I": 32,
      "N": 33,
      "O": 34,
      "P": 35,
      "S": 36,
      "[": 37,
      "\\": 38,
      "]": 39,
      "b": 40,
      "c": 41,
      "l": 42,
      "n": 43,
      "o": 44,
      "p": 45,
      "r": 46,
      "s": 47,
      "~": 48,
      "CC": 49,
      "C1": 50,
      "C(": 51,
      "=CC": 52,
      "=O": 53,
      "=O)": 54,
      "=CC=": 55,
      "C)": 56,
      "C=": 57,
      "C(=O)": 58,
      "N1": 59,
      "CC1": 60,
      "N=": 61,
      "C(C)": 62,
      "C2": 63,
      "=CC=C(": 64,
      "(C)": 65,
      "C1=CC": 66,
      "NC(=O)": 67,
      "C1C": 68,
      "(=O)": 69,
      "C1)": 70,
      "C1=": 71,
      "=CC=C(C=": 72,
      "C(=O)N": 73,
      "=CC=C1": 74,
      "C=1": 75,
      "F)": 76,
      "N1CC": 77,
      "=CC=1": 78,
      "N(": 79,
      "CO": 80,
      "C1=CC=C(C=": 81,
      "C1=N": 82,
      "1)": 83,
      "C1CC": 84,
      "N=C(": 85,
      "C1C=": 86,
      "N)": 87,
      "=CC(": 88,
      "CN": 89,
      "2)": 90,
      "C1=CC=CC=C1": 91,
      "OCC": 92,
      "=N": 93,
      "O=": 94,
      "CC1)": 95,
      "(=O)N": 96,
      "CN1": 97,
      "Cl": 98,
      "C1=CC=C(C=C1)": 99,
      "C(=": 100,
      "C=C1": 101,
      "S(=O)": 102,
      "CS": 103,
      "C(F)": 104,
      "OC": 105,
      "C1=CC=": 106,
      "OC)": 107,
      "=CC=CC=1": 108,
      "=CC(=": 109,
      "C1=CC(": 110,
      "Cl)": 111,
      "C1=CC=C(": 112,
      "=CC=C2": 113,
      "C1=CC=CC=": 114,
      "CC(C)": 115,
      "CNC(=O)": 116,
      "N1)": 117,
      "N(C)": 118,
      "C=C(": 119,
      "N=C1": 120,
      "=C1": 121,
      "N(CC1)": 122,
      "C(N)": 123,
      "C(=O)N1CC": 124,
      "=CC=C(C=1)": 125,
      "O)": 126,
      "=CC(=C1)": 127,
      "CC1=CC": 128,
      "S(=O)(=O)": 129,
      "CC(=O)N": 130,
      "C=CC=1": 131,
      "C1C=CC=CC=1": 132,
      "CC)": 133,
      "C=N": 134,
      "=CC2": 135,
      "=CC=C2C=1": 136,
      "C1CC1": 137,
      "C1N": 138,
      "CCO": 139,
      "N=1)": 140,
      "CN(": 141,
      "(F)": 142,
      "C#": 143,
      "NC(=O)N": 144,
      "C1=CC=CC=2": 145,
      "CC(": 146,
      "C2)": 147,
      "C(=N1)": 148,
      "C1=CC=C(C=C1": 149,
      "C1C=CC=C2C=1": 150,
      "CC1=N": 151,
      "C(=C1)": 152,
      "C1CCCC": 153,
      "CN(C)": 154,
      "C1=CC=CC(=C1)": 155,
      "C1C=CC=C(C=1)": 156,
      "N=N": 157,
      "Br": 158,
      "C1=CC=C(C=2)": 159,
      "S1)": 160,
      "C1S": 161,
      "C(=O)NCC": 162,
      "N=C(C)": 163,
      "C(OC)": 164,
      "=CC=C1C": 165,
      "C=1)": 166,
      "C(C)C": 167,
      "N=C2": 168,
      "(C)C": 169,
      "C2C1=CC=CC=2": 170,
      "C(F)(F)": 171,
      "OCC1": 172,
      "CN1CC": 173,
      "C=CC=C1": 174,
      "C1C=N": 175,
      "O1": 176,
      "CC1=CC=C(C=": 177,
      "CCCC": 178,
      "O1)": 179,
      "CC1=": 180,
      "C1=NN=C(": 181,
      "C2C1=CC=C(C=2)": 182,
      "CN=C1": 183,
      "C(C)=N": 184,
      "N2": 185,
      "C1=CC(C)": 186,
      "S(=O)(=O)N": 187,
      "C(C)=O": 188,
      "CC(=O)": 189,
      "C(Cl)": 190,
      "C1=CC=CC=C1C": 191,
      "Br)": 192,
      "C(CC1)": 193,
      "N(CC1)C(=O)": 194,
      "N#": 195,
      "O=C(C)": 196,
      "=CC=2": 197,
      "C(O)": 198,
      "C1=CC(F)": 199,
      "C2=O)": 200,
      "CC1C": 201,
      "CC1=CC=CC=C1": 202,
      "C1C=CC(": 203,
      "C(C)=": 204,
      "C1O": 205,
      "C(=O)N(C)": 206,
      "C1=CC=C(F)": 207,
      "C1=CC=C(C)": 208,
      "C=C2": 209,
      "C#N": 210,
      "C=C1C": 211,
      "N=C(N=1)": 212,
      "N1C(=O)": 213,
      "CC1=CC=": 214,
      "C#N)": 215,
      "C1=CC=N": 216,
      "CCNC(=O)": 217,
      "N1N": 218,
      "C(C1)": 219,
      "C1=C(C)": 220,
      "CN1C(=O)": 221,
      "C1=CN": 222,
      "C2=C1": 223,
      "O=C(N)": 224,
      "CN=": 225,
      "C1=CC=CC2": 226,
      "C=2": 227,
      "C1=NO": 228,
      "CC1=CC=C(C=C1)": 229,
      "CSC=1": 230,
      "C1C=C(C)": 231,
      "CN2": 232,
      "CCN(": 233,
      "S1": 234,
      "C(N)=O": 235,
      "C1CCCC1": 236,
      "CC1=CC=C(": 237,
      "C(=O)N(": 238,
      "N1C": 239,
      "CC(C)(C)": 240,
      "=CC(C)": 241,
      "C1=O)": 242,
      "COC(=O)": 243,
      "OC(C)": 244,
      "C(CC)": 245,
      "C2=": 246,
      "C1=CS": 247,
      "CC2": 248,
      "CNC(=O)N": 249,
      "C=1C": 250,
      "C1COCC": 251,
      "=CC=CC=C2": 252,
      "S2)": 253,
      "NC(=O)CC": 254,
      "CC(C1)": 255,
      "C1C=C(F)": 256,
      "C(C)(C)": 257,
      "C(=O)OCC": 258,
      "FC(F)(F)": 259,
      "CN(C)C(=O)": 260,
      "C1=CC(F)=CC=C1": 261,
      "C1=CC=C(F)C=C1": 262,
      "C1=NN": 263,
      "C=C(N=1)": 264,
      "C1=CC(Cl)": 265,
      "N(C)C(=O)": 266,
      "C=C(C)": 267,
      "C(F)(F)F": 268,
      "CN=C(": 269,
      "CN(C1)": 270,
      "O(C)": 271,
      "NC=1": 272,
      "CS1": 273,
      "C1=CC=C(Cl)": 274,
      "OC(=O)": 275,
      "C1(": 276,
      "N1CCN(CC1)": 277,
      "C2=CC=CC=C2": 278,
      "CC1CC": 279,
      "C1C)": 280,
      "C(N": 281,
      "COC1=CC=C(C=C1)": 282,
      "C=CC": 283,
      "C=1C)": 284,
      "C1C=CC=C2C=1N=C(": 285,
      "N1N=C(": 286,
      "C=C2C=1": 287,
      "CN=CC=1": 288,
      "C1=O": 289,
      "C1=CC=C(C=C1F)": 290,
      "N1C=N": 291,
      "NS(=O)(=O)": 292,
      "F)=CC=1": 293,
      "C(C)C)": 294,
      "C1=NC=N": 295,
      "C(=O)NC(C)": 296,
      "C1=NC": 297,
      "C1CCCCC1": 298,
      "OC=CC=1": 299,
      "N=2)": 300,
      "CO1": 301,
      "C1=NC=C(": 302,
      "l)": 303,
      "N(CC)": 304,
      "C1CC1)": 305,
      "N=C1C": 306,
      "N1N=N": 307,
      "S(C)": 308,
      "C(C)NC(=O)": 309,
      "N=C(C=1)": 310,
      "O=C1N": 311,
      "C1SC=CC=1": 312,
      "O=C(C)N": 313,
      "C1C=CN=CC=1": 314,
      "CCC1": 315,
      "C(C)(C)C": 316,
      "=CC=NC=1": 317,
      "N1CC(": 318,
      "N1CCCC1": 319,
      "(=O)=O": 320,
      "NC(C)=O": 321,
      "N(C=1)": 322,
      "C1=CC=C(C=C1OC)": 323,
      "C1=CC(C)=CC=C1": 324,
      "C1=CC=CC(": 325,
      "C1C(C)": 326,
      "CC1=O)": 327,
      "C1C=NC=CC=1": 328,
      "CCC(=O)N": 329,
      "N(CC": 330,
      "O=C1": 331,
      "N=C1)": 332,
      "C1=CC=C(C)C=C1": 333,
      "CCC": 334,
      "N(C1)": 335,
      "N1CCC(CC1)": 336,
      "O2)": 337,
      "C1C=C(F)C=CC=1": 338,
      "C(C#N)": 339,
      "N1C)": 340,
      "C1=NN=C(S1)": 341,
      "C1=NN=C(O1)": 342,
      "CO)": 343,
      "C1C=CSC=1": 344,
      "CN1N": 345,
      "C1=NN=C2": 346,
      "S(=O)(C)": 347,
      "C1C=CC(F)=CC=1": 348,
      "C1Cl)": 349,
      "C2C1=CC(": 350,
      "C1=C(F)": 351,
      "C1SC=C(N=1)": 352,
      "C(=O)NC1=CC=C(C=C1)": 353,
      "N1CCOCC1": 354,
      "C1=CC=CN=C1": 355,
      "OCC(=O)N": 356,
      "OCO": 357,
      "COCC": 358,
      "C1=NOC(=N1)": 359,
      "CN1C": 360,
      "C(=O)NCC1": 361,
      "C1C=C(Cl)": 362,
      "COC1=CC=CC=C1": 363,
      "C1=NC=": 364,
      "CN=C2": 365,
      "=CC=N1": 366,
      "C1C=CO": 367,
      "C(=O)N1CCN(CC1)": 368,
      "CCOC(=O)": 369,
      "C(=N": 370,
      "N=1": 371,
      "C2)C(=O)": 372,
      "C1C=C(": 373,
      "OC(C1)": 374,
      "C1ON=C(N=1)": 375,
      "CC1=CC=CC(=C1)": 376,
      "N1=": 377,
      "CC1=NO": 378,
      "CC(O)": 379,
      "N2)": 380,
      "CC1O": 381,
      "SCC(=O)N": 382,
      "C1CCCC2": 383,
      "C1=CC=C(C=C1C)": 384,
      "(N)": 385,
      "C(=O)N1CCC(CC1)": 386,
      "C1=CC(Cl)=CC=C1": 387,
      "CCCC1": 388,
      "CC1=CC(C)": 389,
      "C1=CC=C(C=C1)NC(=O)": 390,
      "COC": 391,
      "C1=CC=C(Cl)C=C1": 392,
      "O1CCO": 393,
      "C1N=": 394,
      "=CC(C)=CC=1": 395,
      "C1=NC=CC=C1": 396,
      "#N": 397,
      "CN2C1=N": 398,
      "C(=C2)": 399,
      "C1CCCN(C1)": 400,
      "O=C(OC)": 401,
      "NCC": 402,
      "FC1=CC=CC=C1": 403,
      "O=C1CC": 404,
      "N1CCN(CC1)C(=O)": 405,
      "=CC(=N1)": 406,
      "C(OC)=O": 407,
      "C1=CC=C(C=N1)": 408,
      "C1=CC=CC=C1F": 409,
      "C1=CC=C(C=C1Cl)": 410,
      "=C(": 411,
      "CC1=CS": 412,
      "C1=CC=C(C=C1)OC": 413,
      "(O)": 414,
      "=CC2=C1": 415,
      "C1=C2": 416,
      "CC2)": 417,
      "C1C=COC=1": 418,
      "N1CC(CC1=O)": 419,
      "CC1C=CC=C(C=1)": 420,
      "C(C)O": 421,
      "CC(C)C": 422,
      "C(C)=C(": 423,
      "C1=CN=C(": 424,
      "N1C=": 425,
      "N1=CC=": 426,
      "C1CCN(CC1)C(=O)": 427,
      "Cl)=CC=1": 428,
      "C(=O)OC": 429,
      "N=CC=1": 430,
      "C1OC=CC=1": 431,
      "C1OCC": 432,
      "CC1=CC=CC=C1C": 433,
      "CC1C=CC=CC=1": 434,
      "C1=CC=C2": 435,
      "(F)F": 436,
      "C1CCCN1C(=O)": 437,
      "N1N=C(C)": 438,
      "C1C2": 439,
      "C1=CSC(=N1)": 440,
      "C1C(F)": 441,
      "CN(C2=O)": 442,
      "C(=O)O": 443,
      "CC1S": 444,
      "=CC=2)": 445,
      "C1C=C2": 446,
      "C=C(C=1)": 447,
      "C(NC)": 448,
      "C1CCN(CC1)": 449,
      "CN1C=N": 450,
      "C1C(C)=N": 451,
      "C1=CC(OC)": 452,
      "N1=CC": 453,
      "C1=CC=C(N=C1)": 454,
      "C1=CC=C(OC)": 455,
      "C(=O)N1CCCC1": 456,
      "C(N1)": 457,
      "N1CCCC(C1)": 458,
      "C1=CC=CC=C1NC(=O)": 459,
      "C1C=NN(C=1)": 460,
      "=CC1": 461,
      "N1C(C)": 462,
      "C=N1": 463,
      "COC1=CC=C(C=C1OC)": 464,
      "CC1=NN=C(": 465,
      "N=C(C)C=1": 466,
      "C1=C(Cl)": 467,
      "OC2": 468,
      "FC1=CC=C(C=C1F)": 469,
      "C=2)": 470,
      "N2C)": 471,
      "C1N=N": 472,
      "C(C)S": 473,
      "=C1C": 474,
      "=C": 475,
      "NC(=O)NCC": 476,
      "C1=CC=CS1": 477,
      "C1=CC=CC=C1OC": 478,
      "OCOC2": 479,
      "COC1=CC=CC(=C1)": 480,
      "C1C=C(C)C=CC=1": 481,
      "C1COCCN1": 482,
      "C1C=C(Cl)C=CC=1": 483,
      "C(=O)N(CC)": 484,
      "C1=CC=C(O1)": 485,
      "C1=CC=NC=C1": 486,
      "N1C=C(": 487,
      "C(C(C)C)": 488,
      "CC1C=": 489,
      "C1C=CC=NC=1": 490,
      "C=CC1": 491,
      "C1C=CC(Cl)=CC=1": 492,
      "CN=1": 493,
      "N=NN1": 494,
      "C=CC=C1C": 495,
      "C1CCO": 496,
      "C1C=CC(C)=CC=1": 497,
      "C1CCC1": 498,
      "CC1=CC=N": 499,
      "CC1=CC(": 500,
      "SC=1": 501,
      "FC(F)": 502,
      "CSC1=N": 503,
      "CC(=O)N1CC": 504,
      "F)=C1": 505,
      "C=NC=1": 506,
      "N(C2=O)": 507,
      "C(=O)NC1=CC=CC=C1": 508,
      "C(C)=C1": 509,
      "N(C=1C)": 510,
      "N=C1S": 511,
      "C(=C2": 512,
      "S1C=CC=C1": 513,
      "C1=CC=CC=C1Cl": 514,
      "CC1=CSC(=N1)": 515,
      "=CC=C(C=2)": 516,
      "C1=CC=CO1": 517,
      "(C1)": 518,
      "C(=O)N1CCCC(C1)": 519,
      "=CC=C(C)": 520,
      "O1CCOC2C1=CC=C(C=2)": 521,
      "C1N=CC=CC=1": 522,
      "NC(=O)C1=CC=C(C=C1)": 523,
      "CN1N=N": 524,
      "S(=O)(C)=O": 525,
      "S(C)(=O)=O": 526,
      "(F)(F)F": 527,
      "C(=N2)": 528,
      "CC1C=N": 529,
      "CN1N=C(C)": 530,
      "C1=CC=CC=N1": 531,
      "O=S(C)": 532,
      "C1NCC": 533,
      "CC)C(=O)": 534,
      "N=CN(C2=O)": 535,
      "OCC(": 536,
      "C1=CN=CC=C1": 537,
      "C1CCCN1": 538,
      "C2C1=CC(=CC=2)": 539,
      "C1C(Cl)": 540,
      "C(C)C(=O)N": 541,
      "C1=CC(C)=N": 542,
      "N(C2)": 543,
      "CCCO": 544,
      "S1)C": 545,
      "CC1N": 546,
      "CNS(=O)(=O)": 547,
      "C1=NC=CC=C1C": 548,
      "C=C(C=C1": 549,
      "C1=NN(C)": 550,
      "C(N)=O)": 551,
      "CC1=CC=C(C=C1C)": 552,
      "C1N=CC=C(C=1)": 553,
      "CC1=CC=C(C=C1": 554,
      "CN(N=1)": 555,
      "N1N=CC(=C1)": 556,
      "CC1=CC(C)=N": 557,
      "SC": 558,
      "ClC1=CC=CC=C1": 559,
      "OC=1": 560,
      "C1=CC2": 561,
      "C=C1NC(=O)": 562,
      "CCN": 563,
      "OC(C)(C)C": 564,
      "N(C)C": 565,
      "C(CO)": 566,
      "N(C1=O)": 567,
      "CCCC2": 568,
      "N=C(S2)": 569,
      "C(=O)NCC(=O)N": 570,
      "C(C)N": 571,
      "=CC2=": 572,
      "C1=CO": 573,
      "O=S(=O)(C)": 574,
      "CC1=CC=C(C)": 575,
      "C1=CN(C)": 576,
      "CC(N)": 577,
      "C(=C1C)": 578,
      "CC1=CC=CN=C1": 579,
      "C1C=C(OC)": 580,
      "CCN(CC2)": 581,
      "CN1C)": 582,
      "=CC=C1NC(=O)": 583,
      "S(=O)(=O)N(C)": 584,
      "C1CC2": 585,
      "=CC(C)=C1": 586,
      "C1C=CC=C2C=1C=C(": 587,
      "C1=CC(Br)": 588,
      "C1=NC(C)": 589,
      "OCC(=O)": 590,
      "OC(": 591,
      "C(=O)N(C)C": 592,
      "CC1=CC=C(O1)": 593,
      "C=C1Cl": 594,
      "C(=O)CC": 595,
      "C1C=CC=C(C=1)OC": 596,
      "C(=C1": 597,
      "C1C=CC=C(": 598,
      "CCCNC(=O)": 599,
      "C1=CC=C(C)C(=C1)": 600,
      "C(=O)N(CC": 601,
      "C(C)CC": 602,
      "O1C=CC=C1": 603,
      "C1=NC2": 604,
      "N#CC1=CC=C(C=C1)": 605,
      "C(=O)NC1=CC=CC(=C1)": 606,
      "CC1=NOC(=N1)": 607,
      "CN=2": 608,
      "S(=O)(=O)N1CC": 609,
      "C1C=CC=C2C=1N=C(S2)": 610,
      "OCOC2=CC=1": 611,
      "C1=CC(=CC=C1": 612,
      "NC1=O": 613,
      "CC1=CC=C(F)": 614,
      "N1=CC=CC=C1": 615,
      "C1=NOC(=C1)": 616,
      "C1CC(=O)N": 617,
      "C12": 618,
      "C1=CC=CC(Cl)": 619,
      "CN(CC": 620,
      "C1=CC(OC)=CC=C1": 621,
      "N(C2)C(=O)": 622,
      "C1=C(F)C=CC=C1": 623,
      "C1=CC=C(N)": 624,
      "CN1CCN(CC1)": 625,
      "C1=CC(=N": 626,
      "CC1ON=C(N=1)": 627,
      "NC(=O)CO": 628,
      "S(N)": 629,
      "N#CC": 630,
      "CC(=O)NCC": 631,
      "N(C1)C(=O)": 632,
      "C=CN=C1": 633,
      "CC1OCC": 634,
      "C1C=CC=C2C=1N=C(N2)": 635,
      "OC=1C": 636,
      "C(N)=N": 637,
      "C(Br)": 638,
      "CC1OC=CC=1": 639,
      "C1=CC=CC(F)=C1": 640,
      "C(=O)NC1C=CC=C(C=1)": 641,
      "S(=O)(N)": 642,
      "C1CCCN(C1)C(=O)": 643,
      "C1=CC=C(Br)": 644,
      "C1=NC=CC=2": 645,
      "C1C(C)=CC=C(C=1)": 646,
      "SCC": 647,
      "CC(C)(C)O": 648,
      "C(=O)NC1CC": 649,
      "N1N=": 650,
      "NC(=O)N(C)": 651,
      "NC(=O)CS": 652,
      "O=C1C": 653,
      "C1=CC=C(C=C1N)": 654,
      "CC(N)=O": 655,
      "(CC)": 656,
      "N=CN1": 657,
      "C1N=C(C)": 658,
      "C=1N)": 659,
      "C1=C(OC)": 660,
      "C1=CC=CC2=C1": 661,
      "NC2=O)": 662,
      "C1=C(C)O": 663,
      "C(F)F": 664,
      "C(C)=CC=1": 665,
      "CC1=NN=C(O1)": 666,
      "C=CC1=O)": 667,
      "C(=O)NC(": 668,
      "CC1=NN": 669,
      "C1(CC": 670,
      "C1=CC(N)": 671,
      "C1=CC=NN1": 672,
      "O=C1N(C)": 673,
      "C1=CSC=C1": 674,
      "C2N1N=C(": 675,
      "C1=CC=C(OC)C=C1": 676,
      "CCNC(=O)N": 677,
      "C1ON=C(C=1)": 678,
      "=CC(=C1C)": 679,
      "C1N=C(": 680,
      "CC1=C(C)": 681,
      "CC(C)NC(=O)": 682,
      "C2=C1C": 683,
      "OC1=CC=C(C=C1)": 684,
      "C2C1=CC=C(C=2)NC(=O)": 685,
      "=CC=C(C)C=1": 686,
      "CCN(C2)C(=O)": 687,
      "N1C(C)=N": 688,
      "C1N(C)": 689,
      "C1C=CC=C(C=1)NC(=O)": 690,
      "N(N=1)": 691,
      "C(C)NC(=O)N": 692,
      "CC1=CN": 693,
      "C(=O)N1CCOCC1": 694,
      "C1=CC(C)=CC=C1C": 695,
      "CCN(C2)": 696,
      "CC1=NN=C2": 697,
      "N2C=1": 698,
      "NCC(=O)N": 699,
      "CC1CC1": 700,
      "C1C=C2OCOC2=CC=1": 701,
      "CC1C=CC(": 702,
      "CC1N=C(": 703,
      "=CC2C1=CC=CC=2": 704,
      "C1=CC(=CC=C1OC)": 705,
      "N1=N": 706,
      "C2=N": 707,
      "C(=C1N)": 708,
      "C1=C(N)": 709,
      "C1CCCCN1C(=O)": 710,
      "S(=O)(=O)NCC": 711,
      "O=C(NC)": 712,
      "C1(CC1)": 713,
      "C1NN=C(C=1)": 714,
      "C1N=CC=NC=1": 715,
      "C1=CC=C(F)C=C1F": 716,
      "C(C)OC(=O)": 717,
      "C(C)=O)": 718,
      "CC1=CN=C(": 719,
      "C(=C2C)": 720,
      "N=C1C)": 721,
      "C1COCCN1C(=O)": 722,
      "CCN1C(=O)": 723,
      "CN1N=CC(=C1)": 724,
      "C(C)=C(C)": 725,
      "C1CC1NC(=O)": 726,
      "OC1=CC=CC=C1": 727,
      "FC1=CC(F)=CC=C1": 728,
      "C1=C(C)N": 729,
      "O1CCCC1": 730,
      "SC=1C)": 731,
      "=C)": 732,
      "OCC)": 733,
      "C1=C(C)N=C(": 734,
      "CC1=CC=C(F)C=C1": 735,
      "C1=CC=C(C=C1)C(=O)N": 736,
      "C1=NC(C)=N": 737,
      "CC1CCCC": 738,
      "CN1CCN(CC1)C(=O)": 739,
      "CN1N=C(": 740,
      "N(C1CC1)": 741,
      "C1C=CN(N=1)": 742,
      "O=S(C)(=O)": 743,
      "C1=CC=NC(=C1)": 744,
      "N1N=CC=C1": 745,
      "CN1CCOCC1": 746,
      "C=C1C(=O)N": 747,
      "C1=CC=CC(=C1)NC(=O)": 748,
      "C1C(C)=CC=CC=1": 749,
      "NC(": 750,
      "C1=CC=C(F)C(=C1)": 751,
      "C1=CC=C(C=C1)OCC": 752,
      "C1=NNC(=C1)": 753,
      "OC=1C)": 754,
      "N=N1)": 755,
      "CC1OC(C)": 756,
      "C(NC)=O": 757,
      "C1=NN=C(N1": 758,
      "=C2": 759,
      "=CC2C1=CC=C(C=2)": 760,
      "SCC(=O)": 761,
      "CC2C1=CC=CC=2": 762,
      "CN=C2C=1": 763,
      "CN=C1C": 764,
      "C1=CC=C2C(=C1)": 765,
      "CC1=CC=C(C=C1F)": 766,
      "=CC=C(C=1": 767,
      "C1COCCN1CC": 768,
      "=2": 769,
      "C1C=C(N)": 770,
      "N(C)C=1": 771,
      "C2N1N=C(N=2)": 772,
      "CC1=CC=C(C)C=C1": 773,
      "NC)": 774,
      "CC1=CC=CC=C1F": 775,
      "N1C=C(N=2)": 776,
      "C(S1)": 777,
      "OC(C1)C": 778,
      "C1=CC(F)=CC=C1C": 779,
      "CC1C=C(C)": 780,
      "C1=CC=CC=C1O": 781,
      "CC(C)O": 782,
      "C1C=C(Br)": 783,
      "C1=CC=C(N=N1)": 784,
      "CC(=O)N(C)": 785,
      "C1=C(Cl)C=CC=C1": 786,
      "C(N1)=CC=C(C=2)": 787,
      "CN(C)S(=O)(=O)": 788,
      "O=C1CCCN1": 789,
      "C1CCCCN1": 790,
      "C1=CC=CN=2": 791,
      "C1=CC=CC(Cl)=C1": 792,
      "C1=CC=CC=C1OCC": 793,
      "=CC2=C1CC": 794,
      "#C": 795,
      "N1N=C(S2)": 796,
      "C1=C(C)C": 797,
      "C1C(OC)": 798,
      "C1=NN=C(N1C)": 799,
      "=CC2=O)": 800,
      "NC(=O)NC(C)": 801,
      "CN=CN1": 802,
      "C1C=C(F)C=C2C=1": 803,
      "CNC(=O)CC": 804,
      "C=CN=1": 805,
      "N1CCCC1=O": 806,
      "C2CCCC": 807,
      "CC1=CC=C(C=C1)OC": 808,
      "C1CC(C)": 809,
      "CN(C1=O)": 810,
      "CC1=CC=CO1": 811,
      "C1=CN(C)N=C1": 812,
      "C(=O)OCC1": 813,
      "N=CN=C2": 814,
      "N1C=CN=C1": 815,
      "CC1=CC=C(S1)": 816,
      "N1CC(C)": 817,
      "C=C(C=C1OC)": 818,
      "CC1N=": 819,
      "CCC1C": 820,
      "O(C)C(=O)": 821,
      "COC)": 822,
      "C1N=CN=C(": 823,
      "CCN(CC2)C(=O)": 824,
      "CN2C1=NC(=C2)": 825,
      "N1CCC": 826,
      "C(=O)N1CCN(CC1)C(=O)": 827,
      "C1=NC=CN1": 828,
      "CN(C1)C(=O)": 829,
      "CN(CC)": 830,
      "C1=NC=C(C=2)": 831,
      "C1=CC=C(C)C=C1C": 832,
      "C1C(O)": 833,
      "C1=CC=CC2C1=CC=C(C=2)": 834,
      "C(=O)NC1CC1": 835,
      "CC1=NN(C)": 836,
      "C1=CC(C)=": 837,
      "N(CC)CC": 838,
      "C1=NN=NN1": 839,
      "C=CC=2": 840,
      "=CC(=C1": 841,
      "CCN1": 842,
      "N(CC)C(=O)": 843,
      "C2=C1CC": 844,
      "C1=CC=C(C=C1)C#N": 845,
      "CC(C)C)": 846,
      "CC1SC=CC=1": 847,
      "NC(=O)C(C)": 848,
      "OCOC2=C1": 849,
      "CCOC": 850,
      "CC(OC)": 851,
      "C(O1)": 852,
      "C=C2)": 853,
      "C1=CC=C(Br)C=C1": 854,
      "N=C(N2)": 855,
      "C(=O)OCC(=O)N": 856,
      "C1C(F)=CC=C2C=1": 857,
      "OC(C)C": 858,
      "N1N=NN=C1": 859,
      "OC2C1=CC=CC=2": 860,
      "C(=O)N1CCCCC1": 861,
      "C1NN=C(N=1)": 862,
      "C1=NC(C)=C(": 863,
      "C1=CC(Br)=CC=C1": 864,
      "OCCO": 865,
      "N=C1N)": 866,
      "N1C=CC=C2": 867,
      "NC1=O)": 868,
      "C1C=CC=C2C=1OCC(": 869,
      "C1=CC=C(O)": 870,
      "Br)=CC=1": 871,
      "C1CCC(CC1)": 872,
      "CCOC1=CC=C(C=C1)": 873,
      "N1C=CC=C1": 874,
      "FC1C=CC=C(C=1)": 875,
      "OC2C1=CC=C(C=2)": 876,
      "N1CC(=O)N": 877,
      "C1=CC(=NN1C)": 878,
      "#N)": 879,
      "COC1=CC=C(C=C1F)": 880,
      "O1C=CC=C1C": 881,
      "S(=O)(=O)N(C)C": 882,
      "S1C": 883,
      "C1=NN=": 884,
      "C(N2)": 885,
      "C1=CC=CN2": 886,
      "SC)": 887,
      "C1C(F)=CC=C(C=1)": 888,
      "C1NCCC2": 889,
      "C1=NC=C(S1)": 890,
      "N1C=CC=N1": 891,
      "C1=COC=C1": 892,
      "C1C=CC=C(C=1": 893,
      "ClC1=CC=C(C=C1Cl)": 894,
      "N=N1": 895,
      "C(=O)NC": 896,
      "C1C=CC=C2C=1CC(": 897,
      "C1=CNC2C1=CC=CC=2": 898,
      "C1=CC=CC=C1N": 899,
      "N(C)C=1C": 900,
      "N1CCO": 901,
      "N1N=CC=2": 902,
      "CC1N=C(C)": 903,
      "NC(=O)CNC(=O)": 904,
      "CC1=CC=CS1": 905,
      "CC2C1=CC=C(C=2)": 906,
      "CN(CC)C(=O)": 907,
      "C(=O)NC1S": 908,
      "C1C=C(O)": 909,
      "C(=O)NCC(=O)": 910,
      "CC1C=CSC=1": 911,
      "C1=NC2=CC=CC=C2": 912,
      "C1=CC(C)=CC=2": 913,
      "C1=CC=CC2C1=CC=CC=2": 914,
      "C1=CC=C(S1)": 915,
      "C(CC": 916,
      "C=CN1": 917,
      "N1CC)": 918,
      "N(C(C)C)": 919,
      "CCN(CC)C(=O)": 920,
      "N(CC1": 921,
      "C1=NNC(=N1)": 922,
      "CCN(C1)": 923,
      "=CC(Cl)": 924,
      "C(C)=NC=1": 925,
      "CC1C(C)=N": 926,
      "C=C1CC": 927,
      "N1CCCC": 928,
      "COCC2": 929,
      "C1=CNN=C1": 930,
      "=C(F)": 931,
      "C(=O)NCCNC(=O)": 932,
      "C2C1=CC=C(C=2)C(=O)N": 933,
      "CC1=CC(C)=CC=C1": 934,
      "N1=CC=CN1": 935,
      "C1C=CC=C(C)C=1": 936,
      "NC(C)": 937,
      "CC1=NC=C(": 938,
      "N1C=CC(=N1)": 939,
      "C1CCCC2=C1": 940,
      "CC1ON=C(C)C=1": 941,
      "C1=CC=NC2": 942,
      "C(C2)": 943,
      "C1(CCCC1)": 944,
      "CC1N(C)": 945,
      "C2=C1C=C(": 946,
      "ON=1": 947,
      "N#CC1C=CC=C(C=1)": 948,
      "N1CCCCC1": 949,
      "C1=CC=CC=C1CNC(=O)": 950,
      "=CC1=O)": 951,
      "C1N2": 952,
      "CC(=O)OCC": 953,
      "N(CC2)": 954,
      "C1=NN=C(N1N)": 955,
      "FC(F)O": 956,
      "CC1=CC=C(Cl)": 957,
      "S(=O)(N)=O": 958,
      "C1=CC(Cl)=CC=C1C": 959,
      "N1CC(CC1=O)C(=O)N": 960,
      "C=C(C2=O)": 961,
      "C2=C1N=C(": 962,
      "C1=C(Br)": 963,
      "N1=CC=N": 964,
      "OC(C2)": 965,
      "C1=CC=C(N=2)": 966,
      "C1=CC(F)=CC=2": 967,
      "N=C1CC": 968,
      "S(N)(=O)=O": 969,
      "CC1=CC=CC=N1": 970,
      "O1N=C(C)": 971,
      "N1CCOC(C1)": 972,
      "N=C1N": 973,
      "C1=CC(=": 974,
      "N(C)S(=O)(=O)": 975,
      "C1CCCCCC1": 976,
      "CCS": 977,
      "C1OCCC1": 978,
      "S1)NC(=O)": 979,
      "N(CCO)": 980,
      "C1N(C)N=CC=1": 981,
      "C1C=C(C)C=C2C=1": 982,
      "=CC(=C2)": 983,
      "C1=CC=C(Cl)C(=C1)": 984,
      "C1C=C(Cl)C=C2C=1": 985,
      "C1C(Cl)=CC=C(C=1)": 986,
      "C1=CN=CC=C1C": 987,
      "=CC=CN=1": 988,
      "C(=O)N1CC(C)": 989,
      "C(C1=O)": 990,
      "C1=NN(": 991,
      "C1=NC=CC=N1": 992,
      "CC1=CC=C(N=C1)": 993,
      "CCCC(=O)N": 994,
      "C(=O)NC1=NN=C(S1)": 995,
      "C1=NC=CS1": 996,
      "CC(F)(F)F": 997,
      "N1CCC2": 998,
      "C1N=CC=CN=1": 999,
      "C)C(=O)": 1000,
      "C1C2=CC=CC=C2": 1001,
      "CC1(": 1002,
      "C=C1Cl)": 1003,
      "C1C=CN": 1004,
      "OC(F)F": 1005,
      "COC2C1=CC=C(C=2)": 1006,
      "O)=CC=1": 1007,
      "C1=NC=NC2=C1": 1008,
      "O=S(N)": 1009,
      "C1=CC=CN1": 1010,
      "CC1=CC=NC=C1": 1011,
      "NC(=O)CN1": 1012,
      "CN1CCOC(C1)": 1013,
      "CCC#N": 1014,
      "N1C=CSC=1": 1015,
      "CC1=CC=NC(=C1)": 1016,
      "C1=NC=NC=2": 1017,
      "SC(C)": 1018,
      "N=C2C=1": 1019,
      "C1=C2OCOC2": 1020,
      "CC1ON=C(C=1)": 1021,
      "C1C=C(OC)C=C2C=1": 1022,
      "CCC(C)": 1023,
      "CS(=O)(=O)": 1024,
      "CCOCC1)": 1025,
      "C1=CC=CC(=C1)F": 1026,
      "CC1=CC=CC=C1OC": 1027,
      "N1N=C(C)C=C1C": 1028,
      "=C(C=C1": 1029,
      "C1CCOCC1": 1030,
      "N2CC": 1031,
      "=CC1=O": 1032,
      "N1N=CN=C1": 1033,
      "C(N1)=O": 1034,
      "O=S(N)(=O)": 1035,
      "O(C)C1=CC=C(C=C1)": 1036,
      "C1=NN(C)C=C1": 1037,
      "CCCC(=O)": 1038,
      "C1=CC=CN2C1=N": 1039,
      "C1CCC2": 1040,
      "C(=O)NCC1=CC=C(C=C1)": 1041,
      "CC1C=CC(F)=CC=1": 1042,
      "O1CCCO": 1043,
      "C1=CC(F)=CC=C1F": 1044,
      "CN1N=CC=C1": 1045,
      "CC1SC=C(N=1)": 1046,
      "O=C(C)NC1=CC=C(C=C1)": 1047,
      "C(N1C)": 1048,
      "COC1C=CC=C(C=1)": 1049,
      "C1OCCN(C1)": 1050,
      "C1=C(C)C=C(C)": 1051,
      "O=C(C)N1CC": 1052,
      "C(O2)": 1053,
      "C(=O)NC(C)C": 1054,
      "O=S(=O)(N)": 1055,
      "C(=O)NC1SC=C(N=1)": 1056,
      "FC1=CC=C(C=C1Cl)": 1057,
      "C1SC=NC=1": 1058,
      "C1=CN=CC=N1": 1059,
      "C1=CC=C(O1)C": 1060,
      "NC(=O)CN": 1061,
      "C(=O)N(CC)CC": 1062,
      "C(=O)N1": 1063,
      "C1CCOC1": 1064,
      "CC1=NOC(=C1)": 1065,
      "C1=NC(C)=C(S1)": 1066,
      "CC1CCCO1": 1067,
      "CN1C=CN=C1": 1068,
      "COC2": 1069,
      "N1N=CC2=C1": 1070,
      "CC1=CC=CC=C1Cl": 1071,
      "C(F)(F)F)": 1072,
      "C(C)=N1": 1073,
      "C1COCC1": 1074,
      "C1C=CC=C2C=1N": 1075,
      "C1=CC=C(C=C1)CC": 1076,
      "CC1C=NC=CC=1": 1077,
      "N2C)=O": 1078,
      "C=C(Cl)": 1079,
      "=CC(F)=C1": 1080,
      "C(C(N)=O)": 1081,
      "CCOCC": 1082,
      "N=C(S2)NC(=O)": 1083,
      "O1CCOC12": 1084,
      "CC1=CC=C(C=C1Cl)": 1085,
      "C=N1)": 1086,
      "O=C1C=CC(": 1087,
      "N1C=CC=NC=1": 1088,
      "CN1CC(=O)N": 1089,
      "C1C(C)=NOC=1": 1090,
      "C1=NC=NN1": 1091,
      "OCC1C": 1092,
      "C1=CC=C(N)C=C1": 1093,
      "C1=CN=C2": 1094,
      "C1=CC(O)": 1095,
      "CCOC1=CC=CC=C1": 1096,
      "C1=C(OC)C=C(C=C1OC)": 1097,
      "C1C=NN(C)C=1": 1098,
      "(C#N)": 1099,
      "N#CC1": 1100,
      "N1=CC=CN=C1": 1101,
      "C1C=C(Br)C=CC=1": 1102,
      "N=NC=1": 1103,
      "=CC=CC=2": 1104,
      "COC1=CC=C(C=C1": 1105,
      "C1N=CN=C2C=1": 1106,
      "C1N=NN(C=1)": 1107,
      "CC1=CC(F)": 1108,
      "C1C=CC=C2C=1C=C(O2)": 1109,
      "C(=O)NCCC": 1110,
      "C1=CN=C(S1)": 1111,
      "C1CCCO1": 1112,
      "N1=CC=CC=C1C": 1113,
      "C1=CNC2": 1114,
      "OCC(C2)": 1115,
      "CC1CC2": 1116,
      "=CC=CC=1F": 1117,
      "C1=CC=C2OCOC2=C1": 1118,
      "N(C)C(=O)N": 1119,
      "C1=NNC=C1": 1120,
      "(NC)": 1121,
      "C1C=CC=C2C=1OCC(O2)": 1122,
      "C(=O)N(C1CC1)": 1123,
      "ClC1C=CC=C(C=1)": 1124,
      "C1=CC=CC=C1C#N": 1125,
      "C(=O)OC(C)": 1126,
      "FC1=CC=CC=C1C": 1127,
      "=CC(=O)": 1128,
      "C1C=NN2": 1129,
      "C(CC)=O": 1130,
      "C1=CC(N)=CC=C1": 1131,
      "CN(C1CC1)": 1132,
      "C1C=CC(Br)=CC=1": 1133,
      "C1=C": 1134,
      "N1C=NN=C1": 1135,
      "C1=NOC(C)=C1": 1136,
      "CC=C": 1137,
      "N1N=C(C=C1": 1138,
      "NC(=O)C1=CC=CC(=C1)": 1139,
      "N1C(=O)N": 1140,
      "C(=O)N1CCC2": 1141,
      "C1=NC(C)=CC=2": 1142,
      "C(C)=C1C": 1143,
      "=CC=C(N=1)": 1144,
      "C(=O)N1CCOC(C1)": 1145,
      "C2=C1C=CC=C2": 1146,
      "C(=O)N1CCC(C1)": 1147,
      "N2C1=NN=C2": 1148,
      "COC=1": 1149,
      "C(C)CC1": 1150,
      "C1CCCCC1(": 1151,
      "C1=CC=CC2C1=NC=CC=2": 1152,
      "C1(C)": 1153,
      "CCC1=CC=C(C=C1)": 1154,
      "C=C(C)N=1": 1155,
      "C1CCOC1C": 1156,
      "CC(OC)=O": 1157,
      "C(CC)=N": 1158,
      "C1=C(C)N=C(S1)": 1159,
      "C1C=C(O)C=CC=1": 1160,
      "C(=O)N(C)CC": 1161,
      "C1CC(=O)": 1162,
      "OCC(C)": 1163,
      "CC(C)CNC(=O)": 1164,
      "O=S(C)(=O)N": 1165,
      "NC2": 1166,
      "CCNS(=O)(=O)": 1167,
      "C=C(F)": 1168,
      "C1=NC(": 1169,
      "CC2=C1": 1170,
      "C1=NN2": 1171,
      "CN1CC(": 1172,
      "C1=CC=C(C=C1)NC(C)=O": 1173,
      "NC(=O)C1CC1": 1174,
      "O=C1C=CC(=": 1175,
      "C2C(N1)=CC=C(C=2)": 1176,
      "S1C=CN=C1": 1177,
      "N1N=CC2": 1178,
      "N1N=NC(=C1)": 1179,
      "N1C(C)=": 1180,
      "C1=CC=C(C=C1)N": 1181,
      "COC1=CC=C(C=N1)": 1182,
      "N#CC1=CC=CC=C1": 1183,
      "CC1N=CC=CC=1": 1184,
      "CC1=CC(C)=NN1": 1185,
      "C1=CC(OC)=CC=C1OC": 1186,
      "C1=CC(=O)N": 1187,
      "C1=NN=C2N1N=C(S2)": 1188,
      "CC1C=NN(C=1)": 1189,
      "C1=CC=CC=C1)": 1190,
      "C1C=CC=CC=1)": 1191,
      "C(=O)OCC(=O)": 1192,
      "CC1N=C(C)SC=1": 1193,
      "N1CCN(": 1194,
      "C=C1)": 1195,
      "C1=C(C)ON=C1C": 1196,
      "=CCC1": 1197,
      "C1=CC=CC(=N1)": 1198,
      "COCC1": 1199,
      "C1N=NN(N=1)": 1200,
      "N1CCC(C1)": 1201,
      "C(=O)NC(C)CC": 1202,
      "C(=O)NCCO": 1203,
      "=CC(=N": 1204,
      "C1C=CC(O)=CC=1": 1205,
      "C1C=CC=C(N=1)": 1206,
      "CCCCC1)": 1207,
      "C=CS": 1208,
      "C1ON=C(C)C=1": 1209,
      "O=C1C=CC(=N": 1210,
      "CN(C2)C(=O)": 1211,
      "C(=O)N1CC2": 1212,
      "C1SC=CN=1": 1213,
      "C1=CC=C(S1)C": 1214,
      "CC(C)(C)NC(=O)": 1215,
      "CC(=O)N(C)C": 1216,
      "C1C=CC=C2C=1N=C(NC2=O)": 1217,
      "CN1CC(C)": 1218,
      "C1=CC=CC(=C1)Cl": 1219,
      "N1N=C(C)C(=C1C)": 1220,
      "FC1=CC=C(F)C=C1": 1221,
      "OC(C)=C1": 1222,
      "NCC1": 1223,
      "CC1N=C(OC=1C)": 1224,
      "CCC(C)NC(=O)": 1225,
      "C1C=NN(C=1C)": 1226,
      "COCCNC(=O)": 1227,
      "CS1(=O)=O": 1228,
      "CC(C1)C": 1229,
      "N1C(=O)CC": 1230,
      "FC1C=CC=C(": 1231,
      "C1=NC=CN=C1": 1232,
      "C1=NC(C)=": 1233,
      "OC1C=CC=C(C=1)": 1234,
      "C1=C(C)N(C)": 1235,
      "CO1)": 1236,
      "C1=CC(Cl)=": 1237,
      "CC#N": 1238,
      "C2C1=NC=C(C=2)": 1239,
      "CC1=CC(=O)": 1240,
      "NC1=CC=CC=C1": 1241,
      "C1C(Cl)=CC=C2C=1": 1242,
      "CNC(=O)C1=CC=C(C=C1)": 1243,
      "C1C(N)": 1244,
      "N1C=C(C)": 1245,
      "N1=C(C)S": 1246,
      "C1=CC=C(O)C=C1": 1247,
      "C1N=CSC=1": 1248,
      "CC1C(C)": 1249,
      "C1C=CC=C2C=1N=C(O2)": 1250,
      "N1C=NC=N1": 1251,
      "C1NN=CC=1": 1252,
      "CNC(C)=O": 1253,
      "CC1C=CC=C(C=1)OC": 1254,
      "C=C(C)N=C1": 1255,
      "O=C(CC)": 1256,
      "CC(=O)N1CCCC1": 1257,
      "C=C(Br)": 1258,
      "COC1=CC=C(C)C=C1": 1259,
      "N=C(C)N=1": 1260,
      "C1=CC=CC(C)=C1": 1261,
      "FC1=C(F)": 1262,
      "C(=O)NCC(O)": 1263,
      "C(C)=NC=1C": 1264,
      "CC1=NC=CN1": 1265,
      "N1CCN(C2)": 1266,
      "C(F)(F)(F)": 1267,
      "N1C2=CC=CC=C2": 1268,
      "C1=CC(=CN1C)": 1269,
      "CN(C)C(=O)N": 1270,
      "CN(CC1)": 1271,
      "CC(=O)N1CCN(CC1)": 1272,
      "N1=CN=CN1": 1273,
      "C1=CC=C(C=C1C)NC(=O)": 1274,
      "S(=O)(=O)NC(C)": 1275,
      "C1C=CC=C2C=1O": 1276,
      "NC": 1277,
      "C1=CSC(=N1)NC(=O)": 1278,
      "C=C(C)C=1": 1279,
      "C(OC)=O)": 1280,
      "C(F)=C1": 1281,
      "(CO)": 1282,
      "NC(=O)COC(=O)": 1283,
      "CN(C2)": 1284,
      "=C(C=2)": 1285,
      "CN1N=CC2=C1": 1286,
      "C1C(OC)=CC=C2C=1": 1287,
      "S(CC)": 1288,
      "C=C1OC": 1289,
      "C1CCCCC1C": 1290,
      "C1(CCOCC1)": 1291,
      "N1N=CC(=C1C)": 1292,
      "C1=NC=C(C=N1)": 1293,
      "=C(C=C1OC)": 1294,
      "CC1CCN(CC1)C(=O)": 1295,
      "S(=O)(CC)": 1296,
      "=CC(N)": 1297,
      "C1=CC=C(OC)C=C1OC": 1298,
      "OCCNC(=O)": 1299,
      "C1=C(F)C=CC=2": 1300,
      "C(=CC1=O)": 1301,
      "C(=O)N(C(C)C)": 1302,
      "O=C1OCC": 1303,
      "C2C1=CC(N)": 1304,
      "C1=CC=CC2=": 1305,
      "FC(F)(F)C1C=CC=C(C=1)": 1306,
      "COC1=CC=CC=C1C": 1307,
      "C1NC(=O)": 1308,
      "C1=CN=C(N=C1N)": 1309,
      "CCN(C)C(=O)": 1310,
      "CC1=CN(C)": 1311,
      "CC1=CNC2C1=CC=CC=2": 1312,
      "C(C)N(C)C(=O)": 1313,
      "C1=CN=CN1": 1314,
      "C(=C1)OC": 1315,
      "N(C=1": 1316,
      "C1N=C(N)": 1317,
      "C1(CCC1)": 1318,
      "CN1CCCC1": 1319,
      "C1C=COC=1C": 1320,
      "FC1=CC=C(C=C1C)": 1321,
      "CN1N=C(C=CC1=O)": 1322,
      "C1=NN=N": 1323,
      "CN1CC(CC1=O)": 1324,
      "N2CC)": 1325,
      "CC1OCCC1": 1326,
      "C1=CC=CC(=C1": 1327,
      "C1=CC=CC2C1=CC=C(N=2)": 1328,
      "N(C=1N)": 1329,
      "CC1=CC=C(Cl)C=C1": 1330,
      "NC(C1)": 1331,
      "C1N=CN=C(C=1N)": 1332,
      "CC1=CC=CC2": 1333,
      "NC=1C": 1334,
      "C(C1CC1)": 1335,
      "C1C=CC=C(C)": 1336,
      "C(=O)OC)": 1337,
      "C1C(C)=CC=C2C=1": 1338,
      "CN1C2=CC=CC=C2": 1339,
      "CC1N=C(SC=1C)": 1340,
      "C(CC)CC": 1341,
      "C2=C1C=C(S2)": 1342,
      "CC1N=CSC=1": 1343,
      "CCCC2=CC=1": 1344,
      "C2CCCC=2": 1345,
      "C=NC=1C": 1346,
      "O=C(N)N": 1347,
      "C1=NC=NC(=C1N)": 1348,
      "C1=CN=C(N=C1)": 1349,
      "C1=NN=C(S1)NC(=O)": 1350,
      "CC1=NC=C(S1)": 1351,
      "C(=O)NCCOC": 1352,
      "CC1OC(C)CN(C1)": 1353,
      "C1CCCN2": 1354,
      "C1CCCCCN1C(=O)": 1355,
      "N1C=NC2C1=CC=CC=2": 1356,
      "C1=CC(C)=CC=C1OC": 1357,
      "C1CCCC1NC(=O)": 1358,
      "C1=CC=C(F)C=C1C": 1359,
      "C(O)CNC(=O)": 1360,
      "C1C=CC=C2C=1N=C(N2C)": 1361,
      "CC1=NOC(C)=C1": 1362,
      "C1C=C(C)N(C=1C)": 1363,
      "=CC(Br)": 1364,
      "C2C1=CC=CN=2": 1365,
      "OCC1CC": 1366,
      "N(CCC#N)": 1367,
      "C1=CC=CN2C1=NN=C2": 1368,
      "C(N2C)=O": 1369,
      "C(=O)NC1CCCC1": 1370,
      "C1=CC=CC(=C1)C#N": 1371,
      "=CC(=N2)": 1372,
      "N1C=NC=C1": 1373,
      "S1C=CC=C1C": 1374,
      "COC1=CC=C(F)C=C1": 1375,
      "CC(=O)NC(C)": 1376,
      "C1C=CC=C2C=1CC(C2)": 1377,
      "CC(=O)N1CCC(CC1)": 1378,
      "CN1N=CC2": 1379,
      "C2C1=CC(N)=CC=2": 1380,
      "C1C=C(C)OC=1C": 1381,
      "C1=CC(O)=CC=C1": 1382,
      "N1N=C(C=CC1=O)": 1383,
      "C(=O)NC1=CC=C(N=C1)": 1384,
      "C1C=NN(C=1)C": 1385,
      "C(=O)CS": 1386,
      "N=C(NC2=O)": 1387,
      "N(C)C)": 1388,
      "C1=C(C)C=CC=C1": 1389,
      "N1=CC=NC=C1": 1390,
      "O=C1CC(": 1391,
      "C1(CCCCC1)": 1392,
      "CC1OC(C)=CC=1": 1393,
      "C1C=CC=C2C=1N=CN(C2=O)": 1394,
      "CCN(CC)": 1395,
      "CN(C(C)C)": 1396,
      "C1=CC=C(C=N1)C#N": 1397,
      "=CC(C)=C1C": 1398,
      "=CC(C)=N": 1399,
      "OCC(F)(F)F": 1400,
      "O=C(N)C1=CC=C(C=C1)": 1401,
      "CNC(=O)NCC": 1402,
      "COC1=CC=C(C=C1Cl)": 1403,
      "CC1CCCC1": 1404,
      "C(=O)NCC(C)": 1405,
      "C1=CC=CC(=C1)N": 1406,
      "C1C=C2CCCC2=CC=1": 1407,
      "CN1C(=O)N(C)": 1408,
      "C1=CC=CC(Cl)=C1C": 1409,
      "C1N=C2": 1410,
      "=CC(C)=": 1411,
      "N#CC1=CC=CC(=C1)": 1412,
      "OCCC": 1413,
      "N2C1=N": 1414,
      "CC1=CC(Cl)": 1415,
      "C2=C1C=NN2": 1416,
      "C1N=CN=C(C=1)": 1417,
      "S1C=CC2=C1CC": 1418,
      "N1=NN=CN1": 1419,
      "SC2C1=CC=CC=2": 1420,
      "C=C(C=C1F)": 1421,
      "CC1=CN=C(S1)": 1422,
      "C(C)ON=C1C": 1423,
      "CN2C1=NC(=N2)": 1424,
      "C1C=CC=C(C=1)C": 1425,
      "C1COCCC1": 1426,
      "N1N=C(C=C2)": 1427,
      "C1=C(O)": 1428,
      "C1NC(C)=C(": 1429,
      "CC1=NN=C(S1)": 1430,
      "C1CCN(C1)": 1431,
      "C1=CC(Cl)=CC=2": 1432,
      "C1CCCC2=": 1433,
      "C=CC=C2": 1434,
      "C1C=NN(C=1)CC": 1435,
      "SC=1C": 1436,
      "CCC(CC)": 1437,
      "S(=O)(=O)N1CCC(CC1)": 1438,
      "N1OC(C)": 1439,
      "COC1=CC=C(Cl)C=C1": 1440,
      "=NC2": 1441,
      "N1OC(C)=CC=1": 1442,
      "C1=C(C)ON=C1": 1443,
      "CN1C(C)=N": 1444,
      "C1C=NNC=1": 1445,
      "COC1=CC=CC2=C1": 1446,
      "C1CC2O": 1447,
      "OCC(F)F": 1448,
      "C(=O)N(C)C(C)": 1449,
      "N1C=NN=N1": 1450,
      "CC1C=CN=CC=1": 1451,
      "N1CC(=O)": 1452,
      "N=CN2": 1453,
      "C2CCCCC=2": 1454,
      "CS2)": 1455,
      "N1C=CN=C1C": 1456,
      "O1COC2C1=CC=C(C=2)": 1457,
      "CC#C": 1458,
      "S(=O)(=O)N1CCN(CC1)": 1459,
      "CCOC2": 1460,
      "C1=C2OCOC2=CC=C1": 1461,
      "C1CCCC2C1=CC=CC=2": 1462,
      "CC(=O)NC2C1=CC=C(C=2)": 1463,
      "C1=CC=CC=C1CC": 1464,
      "C1C=CC=C2C=1C=C(N2)": 1465,
      "C1=NC(N)=N": 1466,
      "N1=CS": 1467,
      "N(C2=O)CC(=O)N": 1468,
      "C1CCN(C1)C(=O)": 1469,
      "C1C=CC(N)": 1470,
      "C1=NC=NC(=C1)": 1471,
      "N1N=NN=C1S": 1472,
      "C(C)=C(S2)": 1473,
      "C1=C(OC)C(OC)": 1474,
      "N1CCN(CC1=O)": 1475,
      "NC(=O)C1=CC=CC=C1": 1476,
      "C1=CC=C(C=C1)CNC(=O)": 1477,
      "CN1C=CC=N1": 1478,
      "C1=NNC2C1=CC=CC=2": 1479,
      "F)C=1": 1480,
      "COC1=CC(OC)": 1481,
      "C1=CC(C)=NN1C": 1482,
      "C(=O)N1CC(C1)": 1483,
      "C1=CC=C(C=C1)O": 1484,
      "C(C)=CC=C1": 1485,
      "CCC1=CC=CC=C1": 1486,
      "=CC=C1OC": 1487,
      "CC1CCC(CC1)": 1488,
      "N1=C(C)": 1489,
      "C(S1)=N": 1490,
      "C=1)=O": 1491,
      "C(=O)NC(C)(C)C": 1492,
      "C1=CC(=O)": 1493,
      "N1CCOCC1)": 1494,
      "O1CCCOC2C1=CC=C(C=2)": 1495,
      "C(=O)NCC=C": 1496,
      "CC(C)(C)C": 1497,
      "N(CCOC)": 1498,
      "COC1=C(OC)C=C(C=C1OC)": 1499,
      "CC1=C(Cl)": 1500,
      "C1=NN=CN1": 1501,
      "C=C(N2)": 1502,
      "CC1=CC=CC(F)=C1": 1503,
      "S1C=": 1504,
      "C(C(C)C)NC(=O)": 1505,
      "CC(C#N)": 1506,
      "C1C=C(C)ON=1": 1507,
      "N=2": 1508,
      "CC1C=CC(C)=CC=1": 1509,
      "C1=NC(=N": 1510,
      "N=C(N1)": 1511,
      "C1C(C)=NN(C=1C)": 1512,
      "C(O)CN": 1513,
      "C(OC)=CC=1": 1514,
      "C1C(C)=CC(C)=CC=1": 1515,
      "C2=C1C=": 1516,
      "C1CN(C1)C(=O)": 1517,
      "C1C=CC=C2C=1CCN(C2)C(=O)": 1518,
      "C1=CC=NC=2": 1519,
      "C1=C(C#N)": 1520,
      "C1C=C(OC=1C)": 1521,
      "N1N=NN=C1C": 1522,
      "2CC": 1523,
      "N1CCN(C2)C(=O)": 1524,
      "NC(C1)=O": 1525,
      "C1=CC(F)=CC=C1OC": 1526,
      "C1=NC=C(C=C1Cl)": 1527,
      "C2=C1CN(CC2)": 1528,
      "C1=CC=CC=C1C(=O)N": 1529,
      "N1C(C)=CSC=1": 1530,
      "C(CC(C)C)": 1531,
      "COCCO": 1532,
      "CCN1N=CC(=C1)": 1533,
      "CC1CCCN(C1)": 1534,
      "C1=NN=CN1C": 1535,
      "N1CCC(C1=O)": 1536,
      "N=C1SCC(=O)N": 1537,
      "CC(=O)OC": 1538,
      "N(CC=C)": 1539,
      "O=C1C=CC=": 1540,
      "N=C(N2C)": 1541,
      "C1=CC=CC(=C1)C(F)(F)F": 1542,
      "C1C=C(OC)C=C(C=1)": 1543,
      "C1C=CC(N)=CC=1": 1544,
      "=C2C=1": 1545,
      "S(=O)(=O)N1CCCC1": 1546,
      "CN(CC2)": 1547,
      "C1C=C": 1548,
      "CC1=CC(C)=NC2N1N=C(N=2)": 1549,
      "C1CCCCC1NC(=O)": 1550,
      "CCC(=O)N1CC": 1551,
      "ClC1=CC=CC=C1C": 1552,
      "CC1OCCN(C1)": 1553,
      "C#CC": 1554,
      "N#CC1=CC=C(N=C1)": 1555,
      "CN2C1=NC=C2": 1556,
      "CC1CCCCC1": 1557,
      "CC(C)OC(=O)": 1558,
      "CC1CCCN(C1)C(=O)": 1559,
      "C1=NOC(=C1)C": 1560,
      "C(=NC=1": 1561,
      "C1=CSC(=C1)": 1562,
      "C1=NC=C(C2=O)": 1563,
      "NC(N)=O": 1564,
      "N=CN1CC": 1565,
      "CN=2)": 1566,
      "CN1N=NC(=N1)": 1567,
      "N1C(": 1568,
      "CC1=CO": 1569,
      "OC1=O)": 1570,
      "C1=CN=": 1571,
      "CC1N(C)N=C(C)C=1": 1572,
      "CC1=NN=NN1": 1573,
      "=C(C)": 1574,
      "C1=NC(C)=CC=C1": 1575,
      "C(=CC2=O)": 1576,
      "=CC(F)": 1577,
      "C1C=CC=C2C=1N=N": 1578,
      "C(=O)NCCCO": 1579,
      "SC=CC=2": 1580,
      "C(O1)=CC=C(C=2)": 1581,
      "C2=C1C(=O)N(C)": 1582,
      "OCCOC=2": 1583,
      "ClC1=CC(Cl)=CC=C1": 1584,
      "C1=CC1": 1585,
      "CC1CCCCN1C(=O)": 1586,
      "CCC(=O)": 1587,
      "C1=CC=CC(F)": 1588,
      "O=C1C=C(C)": 1589,
      "C1=CC=CC2C1=CC=CN=2": 1590,
      "(N)=O": 1591,
      "C2=C1N=CN(C2=O)": 1592,
      "CNC1=O": 1593,
      "SC(=N2)": 1594,
      "CN1C(C)": 1595,
      "N1C(C)=CC(=C1C)": 1596,
      "C(N1C)=O": 1597,
      "CC1C=CC=C(C)C=1": 1598,
      "C1CCCC2C1=CC=C(C=2)": 1599,
      "C1=CC=C(Cl)C=C1Cl": 1600,
      "=C(OC)": 1601,
      "CC(C)NC(=O)N": 1602,
      "C1=CSC2": 1603,
      "COC1=CC(OC)=CC=C1": 1604,
      "CC1CCN(CC1)": 1605,
      "C(=O)NCCCC": 1606,
      "N1C=CC=C2C=1": 1607,
      "C1=CC=C(C=N1)NC(=O)": 1608,
      "ON=C(N=1)": 1609,
      "C1C(C)=NOC=1C": 1610,
      "C1C(": 1611,
      "C(=O)NC(C(C)C)": 1612,
      "C1=CC=C(C=C1)C(C)=O": 1613,
      "CSC1=NN=NN1": 1614,
      "CN1CCCC1=O": 1615,
      "C1=C(": 1616,
      "=CC(Cl)=C1": 1617,
      "CN1C=C(": 1618,
      "C1C2=CC=CC=1": 1619,
      "C(=CC=1": 1620,
      "OCC(O)": 1621,
      "OC1CCN(CC1)C(=O)": 1622,
      "C1=NN=C(S1)C": 1623,
      "FC1C=CC=C(F)C=1": 1624,
      "C=CSC=2": 1625,
      "C(=O)NCC1=CC=CC=C1": 1626,
      "C1SC(C)=NC=1C": 1627,
      "C1=NC=CN1C": 1628,
      "CC1=CC=CC2=C1": 1629,
      "N=C(O2)": 1630,
      "C1=CC=C(C)C=2": 1631,
      "CCCC2=C1": 1632,
      "O=C1C=CC(=NN1C)": 1633,
      "C2=C1N=CN=C2": 1634,
      "SC1=C2": 1635,
      "C1C(=O)N": 1636,
      "C1=CC(F)=C(F)": 1637,
      "Cl)C=1": 1638,
      "CC1=CC(F)=CC=C1": 1639,
      "NC(=O)C2C1=CC=CC=2": 1640,
      "C1COC(C2)": 1641,
      "C=C(C=2)": 1642,
      "C1CC(O)": 1643,
      "CNC(=O)N(C)": 1644,
      "CNC(=O)NC(C)": 1645,
      "CN1N=": 1646,
      "=C(C=1)": 1647,
      "C1=C(C)C=CC=C1C": 1648,
      "N(CCC)": 1649,
      "C1=CC(C)=CC=C1NC(=O)": 1650,
      "CC(=O)O": 1651,
      "C1C=CC=C(C=1C)": 1652,
      "C1NC(C)=C(C=1C)": 1653,
      "C=CC2": 1654,
      "CC1=NC(C)=N": 1655,
      "C1CN(C2)": 1656,
      "C=1C#N": 1657,
      "C2C1=NC=NC=2": 1658,
      "CN1C=CC=C1": 1659,
      "C1=NN=C(N1CC)": 1660,
      "CCN(C1)C(=O)": 1661,
      "CC1=C(C)ON=C1C": 1662,
      "C1CC(": 1663,
      "OCCC1": 1664,
      "SC(C)C(=O)N": 1665,
      "C(=N1)N": 1666,
      "CN1N=C(C)C=C1C": 1667,
      "C=C1C)": 1668,
      "C1=CC(C)=NC2": 1669,
      "CCCC=2": 1670,
      "N1C2": 1671,
      "C1SC=NC=1C1CC1": 1672,
      "C1CN(C)": 1673,
      "COC1=CC=C(OC)C=C1": 1674,
      "CC1=CC=C(S1)C": 1675,
      "N1CC(C1)": 1676,
      "C(=O)NCC1C=N": 1677,
      "C1C=CC=C(C)C=1C": 1678,
      "C1C=CC=C2C=1CC": 1679,
      "BrC1=CC=CC=C1": 1680,
      "C(C)NS(=O)(=O)": 1681,
      "C1CC1C(=O)N": 1682,
      "N1CCC2C1=CC=CC=2": 1683,
      "C1=CC(Cl)=CC=C1OC": 1684,
      "C2=C(C1)": 1685,
      "CC1=CC=C(O1)C": 1686,
      "C1=CC=CC=C1Br": 1687,
      "C(C#N)C(=O)": 1688,
      "C1SC=C(C=1)": 1689,
      "COC1=CC=C(C=C1C)": 1690,
      "OC(=CC2=O)": 1691,
      "N1CC(C)OC(C1)C": 1692,
      "O=C1S": 1693,
      "C1C=CC=C2C=1CCN(C2)": 1694,
      "C1SC(C)=NC=1": 1695,
      "C2C1=CC(=CC=2)NC(=O)": 1696,
      "CC1C=C2": 1697,
      "C(C)(C)CNC(=O)": 1698,
      "CC1=C(F)": 1699,
      "C(C)(C)NC(=O)": 1700,
      "O=C1NC2=CC=CC=C2": 1701,
      "N=C(N)": 1702,
      "O=C1C=CC(=CN1C)": 1703,
      "C1=NC=C(S1)C": 1704,
      "=CC=C(C=C1)": 1705,
      "C1=C(C)NC(=C1C)": 1706,
      "N1CCCN(CC1)": 1707,
      "C1=CC=CC(=C1C)": 1708,
      "N1C(C)=NOC=1": 1709,
      "O(C)C1=CC=C(C=C1OC)": 1710,
      "C(=O)CCC(=O)N": 1711,
      "CC(=O)NC1CC1": 1712,
      "C1=CC2=CC=CC=C2": 1713,
      "CC1C(C)=CC=CC=1": 1714,
      "CN1C(=O)CC": 1715,
      "N2C(=O)": 1716,
      "C1=NN=C2N1C=CC=C2": 1717,
      "C(=O)NC1CCCCC1": 1718,
      "C=CN2": 1719,
      "C1N=CC=C(N=1)": 1720,
      "C1C=C(N)C=CC=1": 1721,
      "N2C=1N=C(C)": 1722,
      "C1=NC(C)=CS1": 1723,
      "C(C)=C1CC": 1724,
      "C1C=CC=C(C=1)OCC": 1725,
      "CC1C=CC(Cl)=CC=1": 1726,
      "CC1=CC(=O)N": 1727,
      "OC1=O": 1728,
      "FC(F)(F)CO": 1729,
      "CN1C=CC(=N1)": 1730,
      "C1=CC=CC(=C1)O": 1731,
      "C1=C2CCCC2": 1732,
      "C1CCCC1)": 1733,
      "C=CCNC(=O)": 1734,
      "(=O)=O)": 1735,
      "OC(C)C(=O)N": 1736,
      "C1=NC=CC=C1CNC(=O)": 1737,
      "C1=CC=CN1C": 1738,
      "CC(=O)N1CCCC(C1)": 1739,
      "O=C(C)C1=CC=C(C=C1)": 1740,
      "C1CCC2=C1": 1741,
      "FC(F)(F)C1=CC=C(C=C1)": 1742,
      "OCOC=2": 1743,
      "C#C": 1744,
      "N1CCCCCC1": 1745,
      "C1C(C)=NOC=1CC": 1746,
      "C1=NC=C(N=2)": 1747,
      "OC2=O)": 1748,
      "C1=CC=C(Cl)C=C1C": 1749,
      "C(=O)N(CCC)": 1750,
      "CN1C(=O)N": 1751,
      "C(=O)NCC(C)C": 1752,
      "C1C=NN(C=1": 1753,
      "S1(=O)=O": 1754,
      "C=CC=CC2": 1755,
      "CC1=CC=CC(C)=C1": 1756,
      "C1=C(F)C=CC=C1F": 1757,
      "C(=O)N1CCCCCC1": 1758,
      "C2C1=CC(=": 1759,
      "S(=O)(=O)CC": 1760,
      "N1C=CC2": 1761,
      "COC1=CC=CC(=C1": 1762,
      "C1=CC=C(C=C1)C(N)=O": 1763,
      "C(F)=CC=1": 1764,
      "O=C1N2": 1765,
      "CC1=CN=C(S1)C": 1766,
      "C1C=CNC=1": 1767,
      "CC1=CC=C(C=C1)C#N": 1768,
      "O=C1CC(CN1C)": 1769,
      "C1CCCN2C1COC(C2)": 1770,
      "COC1=CC(C)": 1771,
      "C1=CC=C(C)N=C1": 1772,
      "C(=O)NCC1=CC=CN=C1": 1773,
      "CN=N1": 1774,
      "C(=O)NCC1(": 1775,
      "C1CCC2C1=CC=CC=2": 1776,
      "CC(=O)NC(C)C": 1777,
      "C1=C(C)N(C)N=C1C": 1778,
      "CC1C=C(F)": 1779,
      "C1=CN(": 1780,
      "C1COCCC1(": 1781,
      "NN=C2": 1782,
      "CCC)": 1783,
      "N=C(N2CC": 1784,
      "C1CC1C1N=CSC=1": 1785,
      "C1C(C)=": 1786,
      "C(COC)": 1787,
      "C1C(C)=CC=CC=1C": 1788,
      "N=C(C=1N)": 1789,
      "O=S(=O)(C)N": 1790,
      "N1CCCCC2": 1791,
      "NC(=O)C2": 1792,
      "C2=C(S1)": 1793,
      "CN(C1CC1)C(=O)": 1794,
      "C2C1=CC(=CN=2)": 1795,
      "CC1CC(C)": 1796,
      "OC1=CC=C(C=C1OC)": 1797,
      "N1C(N)=N": 1798,
      "C1C=C2COCC2": 1799,
      "C1C=C2COCC2=CC=1": 1800,
      "SC)=N": 1801,
      "C#CCNC(=O)": 1802,
      "C1CCCC1(C#N)": 1803,
      "CCC1ON=C(N=1)": 1804,
      "C=CN(C1=O)": 1805,
      "NC(=O)N1CCC(CC1)": 1806,
      "CN1C=CC": 1807,
      "C1=CC(=CC=2)": 1808,
      "C=NN=1": 1809,
      "C1NC=C(C=1)": 1810,
      "CC1C=C(": 1811,
      "N1N=CC(=C1": 1812,
      "C(=O)NCC1=CC=CC(=C1)": 1813,
      "C1CC2OC1CC2": 1814,
      "N1CCCN(CC1)C(=O)": 1815,
      "CC1(C)": 1816,
      "(C1)CC": 1817,
      "#C)": 1818,
      "C=CC=C1Cl": 1819,
      "C1=CC=CC=C1C(": 1820,
      "OCC(C)C": 1821,
      "C=NN2": 1822,
      "N1=CN": 1823,
      "C1=CC(Br)=": 1824,
      "C1C=CC=C(C=1)NC(C)=O": 1825,
      "C1C=CC=C(C=1)N": 1826,
      "C(=O)NCCN": 1827,
      "S1C=N": 1828,
      "N1CC2": 1829,
      "C(=O)NCC1=N": 1830,
      "C1CC)": 1831,
      "N(C(C)C)C(=O)": 1832,
      "COCC(=O)N": 1833,
      "CC(C)CC": 1834,
      "C1CN(C1)": 1835,
      "CC1C(C)=NOC=1C": 1836,
      "C1=CC=C(F)C=C1Cl": 1837,
      "CC1=CC=C(OC)": 1838,
      "C1C=COC=1CNC(=O)": 1839,
      "C(N=1)": 1840,
      "C(C)NC(=O)CC": 1841,
      "(C)NC(=O)": 1842,
      "C1COC2": 1843,
      "N1CCCC2": 1844,
      "C1=CC(C#N)": 1845,
      "C1CCN(CC1)C(C)=O": 1846,
      "C1CCN(C1=O)": 1847,
      "C1C(F)=CC=CC=1F": 1848,
      "N(C1CC1)C(=O)": 1849,
      "C(N)=C1": 1850,
      "C1N=CC(": 1851,
      "C1=CC=CC2C1=NC=C(N=2)": 1852,
      "N(C)(C)": 1853,
      "C1C=C(N)C=C2C=1": 1854,
      "C(=O)NC1C=NN(C=1)": 1855,
      "S(=O)(=O)C1=CC=C(C=C1)": 1856,
      "C1SN=NC=1": 1857,
      "C(=O)N1CCC(CC1)O": 1858,
      "CC1N(C)N=CC=1": 1859,
      "NC(=O)N1CCN(CC1)": 1860,
      "CCOC1=CC=CC(=C1)": 1861,
      "C1SC=C(C)N=1": 1862,
      "C1(C)C": 1863,
      "COC1=CC=C(C=C1N)": 1864,
      "C1=CC=C(F)C(F)=C1": 1865,
      "N1N=C(C)C=2": 1866,
      "N2C=1N": 1867,
      "C(C)N1C(=O)": 1868,
      "C1SC=NC=1C": 1869,
      "F)OC": 1870,
      "N1N=CN=2": 1871,
      "=CC=C(C1=O)": 1872,
      "NC(=O)C(C)S": 1873,
      "C1CCC1(": 1874,
      "O=C1O": 1875,
      "CN1C=CC2": 1876,
      "CC1=CSC=C1": 1877,
      "CNC1=CC=CC=C1": 1878,
      "CC1=CC=CC2C1=CC=CC=2": 1879,
      "OC(=C2C)": 1880,
      "C2C1=CC(C)=CC=2": 1881,
      "C2=C1C(=O)N(C)C(N2C)=O": 1882,
      "C1C(=O)": 1883,
      "C(=O)COC(=O)": 1884,
      "CC1=CN=C2": 1885,
      "C1C=CN=C2C=1": 1886,
      "CCC1SC=C(N=1)": 1887,
      "CC1NCC": 1888,
      "C1OC=C(N=1)": 1889,
      "NC(C)=O)": 1890,
      "O=C1NC(C)=N": 1891,
      "C1=CC=NN1CC": 1892,
      "NC(=O)CSC1=N": 1893,
      "C(=O)N1CCCN(CC1)": 1894,
      "CCN(C)": 1895,
      "C1C=C(C)N=CC=1": 1896,
      "CC(=O)N(CC)": 1897,
      "C(=O)N1CCCCC1C": 1898,
      "O=C1N(C)C(=O)N(C)": 1899,
      "FC(F)(F)CNC(=O)": 1900,
      "S(=O)(=O)N1CCOCC1": 1901,
      "C(=O)N1CCC2C1=CC=CC=2": 1902,
      "C1CCCCC1(C#N)": 1903,
      "C(=O)N1CCOC2": 1904,
      "C1=NOC(=N1)CC": 1905,
      "C1=NN2C(S1)=N": 1906,
      "C2C1=CC(=CC=2": 1907,
      "C(C)N(C)": 1908,
      "C1C=CC=C(C=1)C#N": 1909,
      "Br)C=C1": 1910,
      "C(CCC)": 1911,
      "C(=O)NC(C)(C)": 1912,
      "C1CC=CC1": 1913,
      "CN1C=NN=C1": 1914,
      "NC(=O)CN1C(=O)": 1915,
      "NC(=O)C(C)O": 1916,
      "C(N)=": 1917,
      "(F)(F)": 1918,
      "CC1=NN=C(S1)NC(=O)": 1919,
      "C(=O)NC1=CC=CN=C1": 1920,
      "CC(NC)": 1921,
      "N1CCCS1(=O)=O": 1922,
      "OCC(=O)N(C)": 1923,
      "C1=CN=C(O1)": 1924,
