{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 60,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 60
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 11,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 11,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 32,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 67,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 110,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "(\\[[^\\]]+]|<|Br?|Cl?|N|O|S|P|F|I|b|c|n|o|s|p|\\(|\\)|\\.|=|#|-|\\+|\\\\\\\\|\\/|:|~|@|\\?|>|\\*|\\$|\\%[0-9]{2}|[0-9])"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          32
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          110
        ],
        "tokens": [
          "<eos>"
        ]
      },
      "<unk>": {
        "id": "<unk>",
        "ids": [
          67
        ],
        "tokens": [
          "<unk>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "%39": 0,
      "I": 1,
      "%12": 2,
      "%25": 3,
      "%21": 4,
      ")": 5,
      "%63": 6,
      "<": 7,
      "%64": 8,
      "P": 9,
      "%01": 10,
      "<pad>": 11,
      "%68": 12,
      "%41": 13,
      "B": 14,
      "?": 15,
      "%61": 16,
      "7": 17,
      "9": 18,
      "~": 19,
      "n": 20,
      "%46": 21,
      "%05": 22,
      "#": 23,
      "%20": 24,
      "Cl": 25,
      "%57": 26,
      "%80": 27,
      "%33": 28,
      "%15": 29,
      ":": 30,
      ">": 31,
      "<bos>": 32,
      "%74": 33,
      "*": 34,
      "%99": 35,
      "C": 36,
      "=": 37,
      "%75": 38,
      "%47": 39,
      "%08": 40,
      "%70": 41,
      "%36": 42,
      "8": 43,
      "%31": 44,
      "%44": 45,
      "%89": 46,
      "%86": 47,
      "o": 48,
      "b": 49,
      "]": 50,
      "%07": 51,
      "%23": 52,
      "%84": 53,
      "%06": 54,
      "%34": 55,
      "%73": 56,
      "%42": 57,
      "%09": 58,
      "%77": 59,
      "%83": 60,
      "%28": 61,
      "%49": 62,
      "%16": 63,
      "2": 64,
      "%43": 65,
      "%48": 66,
      "<unk>": 67,
      "c": 68,
      "%66": 69,
      "\\": 70,
      "%56": 71,
      "%03": 72,
      "%19": 73,
      "O": 74,
      "%79": 75,
      "%95": 76,
      "%24": 77,
      "%54": 78,
      "%55": 79,
      "5": 80,
      "%93": 81,
      "%10": 82,
      "[nH]": 83,
      "%72": 84,
      "%26": 85,
      "%18": 86,
      "%98": 87,
      "%53": 88,
      "%35": 89,
      "p": 90,
      "%02": 91,
      "%45": 92,
      "%14": 93,
      "%92": 94,
      "%94": 95,
      "F": 96,
      "%50": 97,
      "3": 98,
      "s": 99,
      "%87": 100,
      "%91": 101,
      "%81": 102,
      "%30": 103,
      "%96": 104,
      "0": 105,
      "%32": 106,
      "@": 107,
      "%38": 108,
      "%97": 109,
      "<eos>": 110,
      "%90": 111,
      "%29": 112,
      "(": 113,
      "%76": 114,
      "4": 115,
      "S": 116,
      "-": 117,
      "%17": 118,
      "%00": 119,
      "6": 120,
      "/": 121,
      "%71": 122,
      ".": 123,
      "%13": 124,
      "%37": 125,
      "%51": 126,
      "%59": 127,
      "%69": 128,
      "%60": 129,
      "%65": 130,
      "%11": 131,
      "%78": 132,
      "Br": 133,
      "+": 134,
      "%04": 135,
      "%85": 136,
      "%62": 137,
      "N": 138,
      "%58": 139,
      "%52": 140,
      "$": 141,
      "%40": 142,
      "%67": 143,
      "%22": 144,
      "%88": 145,
      "1": 146,
      "%82": 147,
      "[": 148,
      "%27": 149
    },
    "unk_token": "<unk>"
  }
}