{
  "added_tokens_decoder": {
    "0": {
      "content": "<bos>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "1": {
      "content": "<eos>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "2": {
      "content": "<pad>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    }
  },
  "bos_token": "<bos>",
  "clean_up_tokenization_spaces": false,
  "eos_token": "<eos>",
  "extra_special_tokens": {},
  "model_max_length": 60,
  "pad_token": "<pad>",
  "tokenizer_class": "PreTrainedTokenizer"
}
