{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 60,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 60
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": "(\\[[^\\]]+]|<|Br?|Cl?|N|O|S|P|F|I|b|c|n|o|s|p|\\(|\\)|\\.|=|#|-|\\+|\\\\\\\\|\\/|:|~|@|\\?|>|\\*|\\$|\\%[0-9]{2}|[0-9])"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          0
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          1
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<bos>": 0,
      "<eos>": 1,
      "<pad>": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "(": 6,
      ")": 7,
      "*": 8,
      "+": 9,
      "-": 10,
      ".": 11,
      "/": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "6": 19,
      "7": 20,
      "8": 21,
      "9": 22,
      ":": 23,
      "<": 24,
      "=": 25,
      ">": 26,
      "?": 27,
      "@": 28,
      "B": 29,
      "C": 30,
      "F": 31,
      "H": 32,
      "I": 33,
      "N": 34,
      "O": 35,
      "P": 36,
      "S": 37,
      "[": 38,
      "\\": 39,
      "]": 40,
      "b": 41,
      "c": 42,
      "l": 43,
      "n": 44,
      "o": 45,
      "p": 46,
      "r": 47,
      "s": 48,
      "~": 49,
      "CC": 50,
      "cc": 51,
      "C(": 52,
      "C1": 53,
      "c1": 54,
      "=CC": 55,
      "=O": 56,
      "=O)": 57,
      "=C(": 58,
      "c1cc": 59,
      "C)": 60,
      "=C1": 61,
      "C(=O)": 62,
      "N1": 63,
      "c2": 64,
      "CC1": 65,
      "C1=CC": 66,
      "O=C(": 67,
      "c1cccc": 68,
      "=1": 69,
      "C2": 70,
      "c1ccccc1": 71,
      "CN": 72,
      "=N": 73,
      "(=O)": 74,
      "2)": 75,
      "cn": 76,
      "N1CC": 77,
      "(C)": 78,
      "=C(C": 79,
      "C=CC": 80,
      "c(": 81,
      "C(=O)N": 82,
      ")N": 83,
      "O=C(N": 84,
      "CO": 85,
      "c2cc": 86,
      "C(C)": 87,
      "H]": 88,
      "[n": 89,
      "[nH]": 90,
      "=CC=C1": 91,
      "C1CC": 92,
      "c2cccc": 93,
      "F)": 94,
      "1)": 95,
      "C1=CC=C(C": 96,
      "C=1": 97,
      "N(": 98,
      "=C1)": 99,
      "C1=N": 100,
      "c2ccccc2": 101,
      "C1C=CC": 102,
      "=C2": 103,
      "c1ccc(": 104,
      "cc1": 105,
      "c1ccccc1)": 106,
      "c3": 107,
      "S(=O)": 108,
      "n1": 109,
      "=CN": 110,
      "=CC=1": 111,
      "NC(=O)": 112,
      "OCC": 113,
      "C1=CC=CC=C1": 114,
      "CC1)": 115,
      "=C(C)": 116,
      "CC1=CC": 117,
      "C1C": 118,
      "c1n": 119,
      "CN1": 120,
      "CS": 121,
      "C1=CC=CC": 122,
      "C=C1": 123,
      "(=O)N": 124,
      "O=": 125,
      "CCC1": 126,
      "=1)": 127,
      "c1cn": 128,
      "=C(N": 129,
      "2)cc1": 130,
      "c2n": 131,
      "O=C1": 132,
      "cs": 133,
      "c2ccccc2)": 134,
      "OC": 135,
      "c1)": 136,
      "=2": 137,
      "Cl": 138,
      "(F)": 139,
      "CCCC": 140,
      "N)": 141,
      "=N1": 142,
      "O=C(NC": 143,
      "C1=CC=C(C=C1)": 144,
      "3)": 145,
      "CCO": 146,
      "O=C(C": 147,
      "c1ccccc1)N": 148,
      "OC)": 149,
      "CNC(=O)": 150,
      "C1)": 151,
      "n2": 152,
      "CC(C)": 153,
      "C1CC1": 154,
      "cccc": 155,
      "c1ccc(-": 156,
      "C1=NN": 157,
      "=C2C=1": 158,
      "=2)": 159,
      "C=CC=1": 160,
      "C1=CC=C(C=C1": 161,
      "S(=O)(=O)": 162,
      "C(=O)N1CC": 163,
      "=C(C=1)": 164,
      "C1N": 165,
      "CN(": 166,
      "c1ccc2": 167,
      "1)N": 168,
      "=CS": 169,
      "co": 170,
      "N(CC1)": 171,
      "c(-": 172,
      "=C(F)": 173,
      "CC(": 174,
      "CC(=O)N": 175,
      "CCN": 176,
      "c1ccn": 177,
      "=NN": 178,
      "C1C=CC=CC=1": 179,
      "C2)": 180,
      "OCC1": 181,
      "O)": 182,
      "C1=CC(": 183,
      "N1N": 184,
      "=C(S": 185,
      "c[nH]": 186,
      "C(F)": 187,
      "O=C(Nc1ccccc1)": 188,
      "O=S(=O)": 189,
      "(-": 190,
      ")NC(=O)": 191,
      "C#": 192,
      "cccn": 193,
      "(N": 194,
      "=N1)": 195,
      "CC)": 196,
      "C1=CC=CC(": 197,
      "Cl)": 198,
      "O=C(NCC": 199,
      "O=C(CC": 200,
      "1)N1CC": 201,
      "C=CC=C1": 202,
      "C1=CC=CC=2": 203,
      "C=N": 204,
      "CN1CC": 205,
      "c1ccccc1)N1CC": 206,
      "nn": 207,
      "c1ccc2c(": 208,
      "OC(": 209,
      "C(=O)NCC": 210,
      "C1C=CC=C2C=1": 211,
      "(C)C": 212,
      "CC2": 213,
      "=CC(": 214,
      "c3cccc": 215,
      "c1cccn": 216,
      "l)": 217,
      "=C(N=1)": 218,
      "CCN1": 219,
      "Br": 220,
      "C1=CN": 221,
      "C1=CC=C(C=2)": 222,
      "c1ccc2c(c1)": 223,
      "CN(C)": 224,
      "=C(O": 225,
      "c(=O)": 226,
      "CC2)": 227,
      "c2)": 228,
      "ON": 229,
      "C(N)": 230,
      "C1CCCCC1": 231,
      "C1S": 232,
      "c1nn": 233,
      "O1": 234,
      "O=C(CO": 235,
      "CCN(": 236,
      "C2C1=CC=CC=2": 237,
      "[nH]1": 238,
      "C(F)(F)": 239,
      "C2=C1": 240,
      "CC1=CC=C(C": 241,
      "c2c1": 242,
      "ncc": 243,
      "c3ccccc3": 244,
      "[nH]c1": 245,
      "=CN=C1": 246,
      "c1cccs": 247,
      "C1=CC=CC(=C1)": 248,
      "CC1=CC=CC=C1": 249,
      "S(=O)(=O)N": 250,
      "C#N": 251,
      "C(C)C": 252,
      "=C(C)N": 253,
      "O=c1": 254,
      "C1C=CC=C(C=1)": 255,
      "1)c1ccccc1": 256,
      "N2": 257,
      "CC(=O)": 258,
      "C(=O)N(C)": 259,
      "C2C1=CC=C(C=2)": 260,
      "ccs": 261,
      "=CO": 262,
      "CCCO": 263,
      "O=C(Cn1": 264,
      "C1CCCC1": 265,
      "C1=CC(C)": 266,
      "=C(S1)": 267,
      "C(C)=O": 268,
      "NCC1": 269,
      "O=S(=O)(N": 270,
      "C(=O)NCC1": 271,
      "CN1N": 272,
      "C2=O)": 273,
      "O=C1N": 274,
      "c2cn": 275,
      "nc1": 276,
      "C(=C1)": 277,
      "c1ccc(-n2": 278,
      "Br)": 279,
      "Cc1ccccc1": 280,
      "ncn": 281,
      "=C(O1)": 282,
      "O=C(CS": 283,
      "N#": 284,
      "C1CO": 285,
      "=C(C)C=C1": 286,
      "=CN1": 287,
      "c1ccco": 288,
      "O=C(C)": 289,
      "n2)": 290,
      "=C(C=1": 291,
      "C1=NC": 292,
      "c1cs": 293,
      "CCCC1": 294,
      "N1C": 295,
      "N(CC1)C(=O)": 296,
      "C1=CC(F)": 297,
      "C1C=N": 298,
      "O=C(NCc1ccccc1)": 299,
      "CN1C(=O)": 300,
      "CCC": 301,
      "=C(F)C=C1": 302,
      "OC(C)": 303,
      "c1cccnc1": 304,
      "=C(Cl)": 305,
      "C(=O)N(": 306,
      "n2)cc1": 307,
      "OCO": 308,
      "c1)N1CC": 309,
      "O=S(=O)(": 310,
      "c12": 311,
      "=CC2": 312,
      "O=c1[nH]": 313,
      "C(C)=N": 314,
      "c1ccc(-c2n": 315,
      "c1ccccc1)Nc1ccccc1": 316,
      "N(C)": 317,
      "S1": 318,
      "CCNC(=O)": 319,
      "C(CC1)": 320,
      "c1cn[nH]c1": 321,
      "C1=CC=N": 322,
      "C1=O)": 323,
      "CCOCC": 324,
      "C1CC1)": 325,
      "CN2": 326,
      "c4": 327,
      "C(O)": 328,
      "C(=N1)": 329,
      "C(=O)NC(C)": 330,
      "c1cc2": 331,
      "C1=CC=CC2": 332,
      "(-c2ccccc2)": 333,
      "C1C=CC=C2C=1N": 334,
      "=CSC=1": 335,
      "N(C=1": 336,
      "=C(OC)": 337,
      "C2=CC": 338,
      "CC1C=CC": 339,
      "c1ccccn1": 340,
      "=CC=C2": 341,
      "C(N)=O": 342,
      "C1C=CN": 343,
      "CC(C)(C)": 344,
      "COC(=O)": 345,
      "c1cco": 346,
      "O=C1CC": 347,
      "2)c1": 348,
      "C1=CC(F)=CC=C1": 349,
      "=C1C)": 350,
      "O=C(N)": 351,
      "CN(C)C(=O)": 352,
      "n1)": 353,
      "C1=CC=C(F)C=C1": 354,
      "C1=CC=C(N": 355,
      "N1CCCC1": 356,
      "1)Nc1ccccc1": 357,
      "=NC=1": 358,
      "NC": 359,
      ")Nc1ccccc1": 360,
      "C(OC)": 361,
      "CC1=N": 362,
      "c3cc": 363,
      "N1CCOCC1": 364,
      "N=C1": 365,
      "CC1=CC=C(C=C1)": 366,
      "C1N=CC": 367,
      "C=2": 368,
      "CNC(=O)N": 369,
      "=CC=2": 370,
      "CCCC2": 371,
      "o1": 372,
      "c2ccccc21": 373,
      "C1=CS": 374,
      "CN(C1)": 375,
      "=CC(=C1)": 376,
      "C#N)": 377,
      "O=C(c1ccccc1)N1CC": 378,
      "C1(": 379,
      "c3ccccc3)": 380,
      "c1ccncc1": 381,
      "c1nccs": 382,
      "NC(=O)N": 383,
      "C(=O)OCC": 384,
      "FC(F)(F)": 385,
      "=C(S2)": 386,
      "=C1)N": 387,
      "c1=O)": 388,
      "N1=CC": 389,
      "COC1=CC=C(C=C1": 390,
      "(C": 391,
      "C(F)(F)F": 392,
      "C1C=C(C)": 393,
      "C1C=C(F)": 394,
      "C1=CC(Cl)": 395,
      "=CN2": 396,
      "C1=O": 397,
      "c12)": 398,
      "C1C(C)": 399,
      "SC": 400,
      "OC2": 401,
      "C1=NOC(": 402,
      "c1ccccc1)c1ccccc1": 403,
      "c1cccs1": 404,
      "ccn": 405,
      "C=1C": 406,
      "N1CCCCC1": 407,
      "C1=CC(C)=CC=C1": 408,
      "c1c[nH]": 409,
      "O(C)": 410,
      "C1=CC=C(Cl)": 411,
      "c2nn": 412,
      "cn1": 413,
      "ON=C(N=1)": 414,
      "c1ccc2[nH]": 415,
      "C2CC2)": 416,
      "C2=CC=CC=C2": 417,
      "OC(=O)": 418,
      "c(C": 419,
      "c2ccccc2)cc1": 420,
      "CC1=NN": 421,
      "c1ccc[nH]": 422,
      "C(C)(C)": 423,
      "CC(C1)": 424,
      "CC1C": 425,
      "=NN=C1": 426,
      "CCC2": 427,
      "C1=CC=C(C)C=C1": 428,
      "c1ccc(CN": 429,
      "OCCO": 430,
      "=NN1": 431,
      "C1=C(C)": 432,
      "CC1N": 433,
      "C1SC": 434,
      "cc2": 435,
      "O=C(CN": 436,
      "C1=NC=CC=C1": 437,
      "c(-c2cc": 438,
      "C=C2C=1": 439,
      "4)": 440,
      "c1cnn": 441,
      "N1CCN(CC1)": 442,
      "=CS1": 443,
      "c(-c2ccccc2)": 444,
      "(F)=CC=1": 445,
      "CC1CC": 446,
      "c2ccccc2)CC1": 447,
      "c2ccccc12": 448,
      "C(C)C)": 449,
      "C1=NC=N": 450,
      "c1ncn": 451,
      "2)CC1": 452,
      "=C(Br)": 453,
      "O=C(NC1CC": 454,
      "c1ccco1": 455,
      "=C2)": 456,
      "=C1N": 457,
      "C=CC(": 458,
      "O=C(Nc1cccc": 459,
      "c1ccc(C": 460,
      "C(N": 461,
      "c1ccs": 462,
      "=C(C)C=1": 463,
      "COC1=CC=CC=C1": 464,
      "O=C(Nc1ccccc1)c1ccccc1": 465,
      "c1ccc(-c2cc": 466,
      "C(C)NC(=O)": 467,
      "=C1)NC(=O)": 468,
      "no": 469,
      "c1ccccc1)NC": 470,
      "COC1=CC=C(C=C1)": 471,
      "c2ncn": 472,
      "OC=CC=1": 473,
      "c(=O)[nH]": 474,
      "ccccc2": 475,
      "c1cno": 476,
      "S(C)": 477,
      "C(CC)": 478,
      "N1CCN(": 479,
      "CCN1C(=O)": 480,
      "CC1=O)": 481,
      "(=O)=O": 482,
      "c1cc[nH]": 483,
      "C1C=CN=CC=1": 484,
      "=C(C=2)": 485,
      "(O)": 486,
      "C(C)(C)C": 487,
      "c1nc2ccccc2": 488,
      "N(C=1)": 489,
      "O=C(C)N": 490,
      "c1cn[nH]": 491,
      "ncc2": 492,
      "n3": 493,
      "CCC(=O)N": 494,
      "C1=CC(Cl)=CC=C1": 495,
      "c1cncc": 496,
      "ccc2": 497,
      "=CC=CC=1": 498,
      "C1C=CC=C(C=1": 499,
      "C1SC=CC=1": 500,
      "CC3)": 501,
      "O=C(NCC1": 502,
      "C=CC2": 503,
      "C1C=NC=CC=1": 504,
      "cs1": 505,
      "C1=CC=C(Cl)C=C1": 506,
      "FC1=CC=C(C=C1": 507,
      "cncn": 508,
      "=CC1": 509,
      "O=C(CNC(=O)": 510,
      "C1C=C(F)C=CC=1": 511,
      "c2[nH]": 512,
      "C1C=CSC=1": 513,
      "N1CC(": 514,
      "FC1=CC=CC=C1": 515,
      "NCC": 516,
      "=C(N1": 517,
      "C1=NN=C2": 518,
      "C1C=CC(F)=CC=1": 519,
      "C1=CC=CN=C1": 520,
      "CCCCC2)": 521,
      "c1)c1ccccc1": 522,
      "c1ccc(N2": 523,
      "s1": 524,
      "c3)": 525,
      "c2)cc1": 526,
      "C(=O)N1CCN(CC1)": 527,
      "C1=C(F)": 528,
      "OCC(=O)N": 529,
      "nc2": 530,
      "C1=NOC(=N1)": 531,
      "C(C1)": 532,
      "O=C1CC(": 533,
      "c2cccn": 534,
      "COC": 535,
      "CCOC(=O)": 536,
      "=COC=1": 537,
      "c1cccc2": 538,
      "C1C=C(Cl)": 539,
      "c1ncc": 540,
      "CC2)cc1": 541,
      "OC(C1)": 542,
      "C1CCC1": 543,
      "O=C(COc1ccccc1)N": 544,
      "c1co": 545,
      "(N)": 546,
      "CSC1=NN": 547,
      "c1)N": 548,
      "=C(N=2)": 549,
      "N1C(=O)": 550,
      "C1=NC(C)": 551,
      "=C(N)": 552,
      "C1=CC=C(C=C1)N": 553,
      "C2)C(=O)": 554,
      "cc1)": 555,
      "C(=O)NC1=CC=C(C=C1)": 556,
      "SCC(=O)N": 557,
      "C1CCN(": 558,
      "C1=CC=C(C=C1)NC(=O)": 559,
      "CC(O)": 560,
      "=C(C=C1": 561,
      "=C1C": 562,
      "3)cc1": 563,
      "=C": 564,
      "C1SC=C(N=1)": 565,
      "C1=NC(": 566,
      "n1)N1CC": 567,
      "2)C1": 568,
      "=CN(": 569,
      "C(=O)NCC1=CC": 570,
      "c(N": 571,
      "(Cl)": 572,
      "=CC=C2C=1": 573,
      "C2(": 574,
      "C(N1": 575,
      "c1cc2ccccc2": 576,
      "c1cc(": 577,
      "C(=O)NC1=CC=CC=C1": 578,
      "=C(N2)": 579,
      "N(CC)": 580,
      "nn1": 581,
      "c1cc(-": 582,
      "O1CCO": 583,
      "CC1=CC(C)": 584,
      "=CO1": 585,
      "(C)=CC=1": 586,
      "n[nH]": 587,
      "c2ccccc12)": 588,
      "C1CCCN1C(=O)": 589,
      "O=S(=O)(NC": 590,
      "=C2OCO": 591,
      "O=C(OC)": 592,
      "C1CCCN(C1)": 593,
      "c2n1": 594,
      "n1cccn": 595,
      "=NN2": 596,
      "O=C(Cc1ccccc1)N": 597,
      "s1)": 598,
      "N1CCC(CC1)": 599,
      "C(OC)=O": 600,
      "CN1C": 601,
      "O=C(CSc1nn": 602,
      "C1NN": 603,
      "cccn2)cc1": 604,
      "C1=CC=C(C=C1)OC": 605,
      "C1=C(C)N": 606,
      "C1CCO": 607,
      "c3c(": 608,
      "N1C=CC": 609,
      "Nc1ccccc1": 610,
      "C(=O)N1CCC(CC1)": 611,
      "N1CCO": 612,
      "C1C=COC=1": 613,
      "C1=NN=C(O1)": 614,
      "C(Cl)": 615,
      "c1ccc2c(c1)OCO": 616,
      "N1C(C)": 617,
      "CCCC2)": 618,
      "C(=O)OC": 619,
      "=C(O)": 620,
      "CC1=CN": 621,
      "C)=O": 622,
      "=C(S1)N": 623,
      "c1=O": 624,
      "C=CC=2": 625,
      "Cc2cc": 626,
      "C1=CC=CC=C1F": 627,
      "CC(C)C": 628,
      "C1=CC(OC)": 629,
      "C(=O)N1CCCC1": 630,
      "C1CCCCC1)": 631,
      "C1CCN(CC1)C(=O)": 632,
      "n3)": 633,
      "C2=C1N": 634,
      "C(C#N)": 635,
      "NS(=O)(=O)": 636,
      "N1CCN(CC1)C(=O)": 637,
      "C(=N1": 638,
      "c(N2": 639,
      "(F)F": 640,
      "c2ncc": 641,
      "c1ccc(C2": 642,
      "CCN2": 643,
      "n2cn": 644,
      "c2s": 645,
      "c(CN": 646,
      "C1ON=C(N=1)": 647,
      "c1n[nH]": 648,
      "=C(N2": 649,
      "cs2)": 650,
      "CC#": 651,
      "C1CC2": 652,
      "N1CC(CC1=O)": 653,
      "c1ccc(NC": 654,
      "c1ccc(N": 655,
      "N1C=N": 656,
      "C1CCCN1": 657,
      "C(=O)N(CC)": 658,
      "ccc2c1": 659,
      "CC1=CS": 660,
      "=CN1CC": 661,
      "c(C3": 662,
      "C1OC=CC=1": 663,
      "COCC": 664,
      "C1C(F)": 665,
      "=N2)": 666,
      "=CC=2)": 667,
      "C1COCCN1": 668,
      "C1=CN=CC=C1": 669,
      "c2cn[nH]": 670,
      "C1CCN(CC1)": 671,
      "c3cn": 672,
      "CO)": 673,
      "C1=CC=CC=C1NC(=O)": 674,
      "cnc2c1": 675,
      "co2)": 676,
      "c2ccccn2)": 677,
      "c1ccn[nH]1": 678,
      "C1OCC": 679,
      "C1CCCC2": 680,
      "c1ccsc1": 681,
      "O=C(OC": 682,
      "=C(C)C(": 683,
      "N(C)C(=O)": 684,
      "C1=CC=C(OC)": 685,
      "=CC=C(C=1)": 686,
      "c2ccccc2N1": 687,
      "c2ccccc2C1": 688,
      "-c1ccccc1": 689,
      "c2c(": 690,
      "O=C1CCCN1": 691,
      "nn2)cc1": 692,
      "S1C=CC=C1": 693,
      "C1=CC=C(C=C1C)": 694,
      "c3n": 695,
      "c2ccccc2)C1": 696,
      "C1C=NN(C=1)": 697,
      "c1ccccc1)N1CCCCC1": 698,
      "C3)": 699,
      "c1ccc2ccccc2": 700,
      "C(=O)O": 701,
      "1)N1CCCCC1": 702,
      "C2N1N": 703,
      "COC1=CC=C(C=C1OC)": 704,
      "(Cl)=CC=1": 705,
      "C1=C(Cl)": 706,
      "c1nccs1": 707,
      "CCCN": 708,
      "c1ccc(OC": 709,
      "[nH]1)": 710,
      "C(O": 711,
      "CC1=CC=C(C=C1": 712,
      "C(N1)": 713,
      "O1C=CC=C1": 714,
      "C1CCNCC1": 715,
      "C2=C1C": 716,
      "O=C(COC(=O)": 717,
      "=C(C)C": 718,
      "n1)N": 719,
      "N1N=N": 720,
      "c1cccc(-": 721,
      "(F)=C1": 722,
      "C=1C)": 723,
      "CC1=CC=CC(=C1)": 724,
      "C1=CC=NC=C1": 725,
      "C1=CC=CS1": 726,
      "C1N=CN": 727,
      "CC(=O)N1CC": 728,
      "n1)c1ccccc1": 729,
      "=C(S1)C": 730,
      "CCNC2": 731,
      "(C)C(=O)": 732,
      "3CCCC": 733,
      "CC1C=CC=CC=1": 734,
      "cccn2)": 735,
      "OCC(=O)": 736,
      "O=C(c1cn": 737,
      "c2cs": 738,
      "C1C=C(C)C=CC=1": 739,
      "=C2OCOC2": 740,
      "C1CCCO": 741,
      "CC1CC1": 742,
      "(C)N": 743,
      "C1C=C(Cl)C=CC=1": 744,
      "CC1)c1ccccc1": 745,
      "C1N=N": 746,
      "C(=O)NC(": 747,
      "CC1CCCO": 748,
      "N1=CC=CC=C1": 749,
      "nc2c1": 750,
      "c(-c3cc": 751,
      "C1=CC=C(O1)": 752,
      "c2ccccc21)N": 753,
      "O=C(Nc1ccn": 754,
      "(C)N=C1": 755,
      "C1C=CC=NC=1": 756,
      "N(C1)": 757,
      "C1=CC=C(C=N1)": 758,
      "CNS(=O)(=O)": 759,
      "ClC1=CC=CC=C1": 760,
      "O=C(Cn1cn": 761,
      "c1cccnc1)": 762,
      "C1C=CC(Cl)=CC=1": 763,
      "c2nccs": 764,
      "C1=CC(=CC=2)": 765,
      "C1=C2": 766,
      "CCC1)": 767,
      "=CN=1": 768,
      "(N2": 769,
      "O=C1CO": 770,
      "=CN(C2=O)": 771,
      "C2CCCC": 772,
      "c1ccc(CN2": 773,
      "S(=O)(C)": 774,
      "c1cscn": 775,
      "C1C=CC(C)=CC=1": 776,
      "c1ccoc1": 777,
      "O=C(NCCC": 778,
      "c1ccc(Cn2": 779,
      "CCC2)": 780,
      "C1=CC=C2": 781,
      "c1ccc2c(c1)OCCO": 782,
      "o2)cc1": 783,
      "FC(F)": 784,
      "c1ccc[nH]1": 785,
      "=NN(C)": 786,
      "c1cc(-c2ccccc2)": 787,
      "=CC1=O)": 788,
      "C(C)N": 789,
      "C1=CC=CC=C1C": 790,
      "O=C(Nc1nn": 791,
      "c1ccc2n": 792,
      "C1=CC=CC=C1OC": 793,
      "SC=1": 794,
      "CC)C(=O)": 795,
      "C1ON": 796,
      "N(C=1C)": 797,
      "c1cscn1": 798,
      "CCC)": 799,
      "c3nn": 800,
      "O=C(NCc1ccccc1)c1ccccc1": 801,
      "C1=CC=C(N=C1)": 802,
      "C=C2C=1N": 803,
      "(N=1)": 804,
      "CCOCC2)": 805,
      "=CC=C(C=2)": 806,
      "C1CCCC": 807,
      "C1=CC=CO1": 808,
      "c1nccs1)": 809,
      "n1cn": 810,
      "C(=O)N1CCCC(C1)": 811,
      "c3ncn": 812,
      "=C(O2)": 813,
      "N1CCC(": 814,
      "O1CCOC2C1=CC=C(C=2)": 815,
      "C(C)O": 816,
      "CN1C=N": 817,
      "c1cccs1)": 818,
      "=CC(C)": 819,
      "OCC(": 820,
      "O=C(NCCc1ccccc1)": 821,
      "(F)(F)F": 822,
      "C1=NN=C(S1)": 823,
      "S(=O)(C)=O": 824,
      "FC1=CC=C(C=C1F)": 825,
      "S(C)(=O)=O": 826,
      "c1cnoc1": 827,
      "C1=CC=CC=N1": 828,
      "[nH]2)cc1": 829,
      "CN(C(=O)": 830,
      "cs1)": 831,
      "c1cc2c(": 832,
      "C(=O)NCC(=O)N": 833,
      "c1ccc(-c2cn": 834,
      "C1=CC=C(F)": 835,
      "CCS": 836,
      "C=N1": 837,
      "n12": 838,
      "CCOC": 839,
      "=NN1CC": 840,
      "c1ccc(OCC": 841,
      "O=S(C)": 842,
      "CCN1N": 843,
      "=C(C)N=C1": 844,
      "(=O)N(": 845,
      "=NC=C1": 846,
      "c(-c3ccccc3)": 847,
      "O=C(O": 848,
      "c1ccco1)": 849,
      "C1C(Cl)": 850,
      "c1ccc(-c2nn": 851,
      "C(C)=NO": 852,
      ")NC": 853,
      "c1ccon1": 854,
      "C=NC=1": 855,
      "CCN(CC2)": 856,
      "C1=CC(N)": 857,
      "C1=CC2": 858,
      "c1ccc(O": 859,
      "=C1N)": 860,
      "SC(C)": 861,
      "COC1=CC=CC(=C1)": 862,
      "C1=CC(OC)=CC=C1": 863,
      "C1=CC(Br)": 864,
      "C1=CC=C(OC)C=C1": 865,
      "C(C)=C1": 866,
      "O=C(Nc1n": 867,
      "C(=O)N(C)C": 868,
      "C1=CC=CC=C1Cl": 869,
      "C12": 870,
      "CN1CCN(CC1)": 871,
      "O=C(c1ccn": 872,
      "C(=O)N2": 873,
      "c(C2": 874,
      "CC1C=CC=C(C=1)": 875,
      "CC1=CC=C(C=C1C)": 876,
      "C(=O)NC": 877,
      "CCCNC(=O)": 878,
      "O=C(COc1ccccc1)Nc1ccccc1": 879,
      "C(N)=O)": 880,
      "=C(N)N": 881,
      "1)NC": 882,
      "C1=C(F)C=CC=C1": 883,
      "N(C2=O)": 884,
      "c1cn[nH]c1)": 885,
      "C1=CC=CN2": 886,
      "CCN(C2)C(=O)": 887,
      "C1C2": 888,
      "C=C(C=C1": 889,
      "=C(Br)C=C1": 890,
      "C1N=CC=CC=1": 891,
      "c1cccnc1)N1CC": 892,
      "=CC2=C1N": 893,
      "=C(C=1)N": 894,
      "c1ccc(-n2cc": 895,
      "CN1CCOCC1": 896,
      "c1cnn(-c2ccccc2)": 897,
      "C1=NN(C)": 898,
      "cccc2": 899,
      "N1CCCC(C1)": 900,
      "c3c(c2)": 901,
      "C1C=CC=C2C=1C": 902,
      "O=C(CSc1n": 903,
      "C1=CC=CC(F)=C1": 904,
      "CN(C": 905,
      "OC(C)(C)C": 906,
      "c1ccc(-n2cn": 907,
      "c1ccc(-n2cccn2)cc1": 908,
      "O=C(NCCO": 909,
      "C(=O)NC1CC": 910,
      "CCC(": 911,
      "C1=CO": 912,
      "CC1=NOC(": 913,
      "S1C": 914,
      "C1C=CC=C(C=1)N": 915,
      "cnc1": 916,
      "O=C(NC1CCCCC1)": 917,
      "o1)": 918,
      "=C(C2=O)": 919,
      "C(C(C)C)": 920,
      "C1N=CC=C(C=1)": 921,
      "C1=CC=C(C=C1OC)": 922,
      "cnc2": 923,
      "=CN=C2": 924,
      "=CN1C": 925,
      "c1cc[nH]n1": 926,
      "co2)cc1": 927,
      "O=C(CCC": 928,
      "S(=O)(=O)N(C)": 929,
      "CC1=CC=C(O1)": 930,
      "=CC=N1": 931,
      "Cl)=C1": 932,
      "O=C(NCc1ccn": 933,
      "c1nncs1": 934,
      "O=C(NCc1ccccc1)N": 935,
      "=C(N1C)": 936,
      "(C1)": 937,
      "1)N1CCCC1": 938,
      "2)nc1": 939,
      "C=C(C=1)": 940,
      "c1ccc2c(c1)CCNC2": 941,
      "c1ccccn1)": 942,
      "C1=CC=C(C)": 943,
      "CCN(C2)": 944,
      "C1C=CC=C(C=1)OC": 945,
      "N1N=NN=C1": 946,
      "N1CCNCC1": 947,
      "C1=CSC=C1": 948,
      "C1CCCN(C1)C(=O)": 949,
      "c1no": 950,
      "CCOCC2)cc1": 951,
      "O=C(CCn1": 952,
      "N1N=CC(": 953,
      "O=C(Nc1ccccc1)N": 954,
      "OC(C)=C1": 955,
      "CCOCC3)": 956,
      "CC1ON": 957,
      "1)N1CCN(": 958,
      "C1=CC(=CC=C1": 959,
      "c1ccc2c(c1)OCO2": 960,
      "=CC2=C1": 961,
      "N1CCOCC1)": 962,
      "c1cn2": 963,
      "c(C2CC2)": 964,
      "CC(N)": 965,
      "1)NCc1ccccc1": 966,
      "C1=CC=CC(=C1)NC(=O)": 967,
      "C1C=CC=C(C=1)NC(=O)": 968,
      "c3[nH]": 969,
      "c2ccccn2)cc1": 970,
      "=C2C)": 971,
      "CCN1CC": 972,
      "C1C=CC=C2C=1N=C(S2)": 973,
      "C(=O)NC1=CC=CC(=C1)": 974,
      "=C2OCOC2=CC=1": 975,
      "C1=NC2": 976,
      "C(=C2)": 977,
      "C1=CC=CN": 978,
      "O=S(=O)(c1ccccc1)N1CC": 979,
      "C2C1=CC=C(C=2)NC(=O)": 980,
      "n2)c1": 981,
      "c1cc(-c2cc": 982,
      "=C(S1)NC(=O)": 983,
      "=C(N2C)": 984,
      "C1C=C(OC)": 985,
      "C1=CC=CC(=C1)N": 986,
      "c2ncccn": 987,
      "3CCOCC3)": 988,
      "CCNCC2)": 989,
      "C2)cc1": 990,
      "c2ccccc21)": 991,
      "C1CN": 992,
      "O=S(=O)(Nc1ccccc1)c1ccccc1": 993,
      "CCc1ccccc1": 994,
      "C(=O)N1CCOCC1": 995,
      "ccc2N1": 996,
      "CC(C)NC(=O)": 997,
      "O=C(NC1CC1)": 998,
      "c(=O)[nH]c1": 999,
      "C(=N1)N": 1000,
      "CCO)": 1001,
      "C(=C1)N": 1002,
      "CN1CCN(CC1)C(=O)": 1003,
      "ncn1": 1004,
      "S(N)": 1005,
      "CC)N": 1006,
      "c1ccc2[nH]cnc2c1": 1007,
      "c2cccnc2)": 1008,
      "O2)": 1009,
      "c4cccc": 1010,
      "CN1N=N": 1011,
      "c(C3CC3)": 1012,
      "O=C(CC1": 1013,
      "c3cccn": 1014,
      "C=CC=C2": 1015,
      "c2nc3ccccc3": 1016,
      "=NN1C)": 1017,
      "=CC=C1NC(=O)": 1018,
      "(CC)": 1019,
      "C1=NC=CC=2": 1020,
      "C1=NOC(=C1)": 1021,
      "CC(C)(C)O": 1022,
      "c1cnccn1": 1023,
      "CC1)N": 1024,
      "CN(C1)C(=O)": 1025,
      "O=c1[nH]c(=O)": 1026,
      "c1cccc(": 1027,
      "n[nH]1": 1028,
      "CN(CC1)": 1029,
      "C1=CC=C(N)": 1030,
      "CC1=CC=CN=C1": 1031,
      "C1=CN=C(N": 1032,
      "c1ccccc1)NCc1ccccc1": 1033,
      "O=C(Cn1cc": 1034,
      "N(N": 1035,
      "O=C1C": 1036,
      "O=S(=O)(C": 1037,
      "SCC(=O)": 1038,
      "c1=O)N": 1039,
      "cs2)cc1": 1040,
      "C(S": 1041,
      "CCCCC2": 1042,
      "CC1=NC": 1043,
      "=NC2N1N": 1044,
      "CCCN(": 1045,
      "C(C)S": 1046,
      "=C(C)C=C1C": 1047,
      "C1CCOCC1": 1048,
      "(=O)N1CC": 1049,
      "C1C=CC=C2C=1N=C(N2)": 1050,
      "Cc2ccccc21": 1051,
      "c(NC": 1052,
      "c2cscn": 1053,
      "ncn2)cc1": 1054,
      "cc12": 1055,
      "CC1=CSC(=N1)": 1056,
      "C1CN(": 1057,
      "C1CC(=O)N(": 1058,
      "C1=C(OC)": 1059,
      "Oc1ccccc1": 1060,
      "CC1CCCO1": 1061,
      "c1[nH]": 1062,
      "c1ccc2c(c1)OCO2)": 1063,
      "C(F)F": 1064,
      "c3s": 1065,
      "C1=CSC(=N1)": 1066,
      "ON=C1": 1067,
      "c2[nH]ncc2": 1068,
      "C1)N": 1069,
      "C=CC1": 1070,
      "=C(NC2=O)": 1071,
      "COC2": 1072,
      "cccn3)": 1073,
      "=C(C=1)NC(=O)": 1074,
      "C1=C(C)C": 1075,
      "O=C(c1ccccc1)N1CCCCC1": 1076,
      "CC1OCC": 1077,
      "O=S(=O)(C)": 1078,
      "C1=CC=NN1": 1079,
      "ncn2": 1080,
      "C1CC1NC(=O)": 1081,
      "ClC1=CC=C(C=C1": 1082,
      "c2cn[nH]c2)": 1083,
      "O=C(Nc1ccccn1)": 1084,
      "O=C(NCc1n": 1085,
      "(Cc2ccccc2)": 1086,
      "O=C(Nc1nccs1)": 1087,
      "CCN(C": 1088,
      "O=C(Cn1cccn": 1089,
      "c3ccccc32)cc1": 1090,
      "c(=O)[nH]1": 1091,
      "=C(C=CC1=O)": 1092,
      "O=c1ccn": 1093,
      "=C(C)N=1": 1094,
      "c1c[nH]c2ccccc12)": 1095,
      "C1C=C2": 1096,
      "CC1C=N": 1097,
      "C1CCCO1": 1098,
      ")NCc1ccccc1": 1099,
      "=NN2C=1": 1100,
      "C1CCCCN1C(=O)": 1101,
      "CC(N)=O": 1102,
      "c1ccc2c(c1)OCCO2": 1103,
      "c[nH]1": 1104,
      "=CC(C)=C1": 1105,
      "c1ccc2o": 1106,
      "C=CC=N1": 1107,
      "C1=CC=CC2=C1": 1108,
      "CCCC(=O)N": 1109,
      "(-c2cc": 1110,
      "(N)=O": 1111,
      "O=C(Cc1ccccc1)N1CC": 1112,
      "FC1=CC(F)=CC=C1": 1113,
      "S(=O)(=O)N1CC": 1114,
      "CC1=CC=C(F)C=C1": 1115,
      "c1ccc(CNc2ccccc2)cc1": 1116,
      "C1=CC=CC(Cl)=C1": 1117,
      "C3": 1118,
      "C1C=C2OCOC2=CC=1": 1119,
      "C(=O)NC1C=CC=C(C=1)": 1120,
      "C1=CC=C(C=C1)OCC": 1121,
      "=CN2C1=NC(": 1122,
      "CC1S": 1123,
      "CC(C)O": 1124,
      "SC=C(N=1)": 1125,
      "C1=CC(=CC=C1OC)": 1126,
      "C1ON=C(C=1)": 1127,
      "C1=C(Cl)C=CC=C1": 1128,
      "COCC2": 1129,
      "N#CC1=CC=C(C=C1)": 1130,
      "=CN1C)": 1131,
      "c1cncs1": 1132,
      "1)N1CCOCC1": 1133,
      "O=C(NCc1nn": 1134,
      "N1=CN": 1135,
      "c1cn[nH]c1)N1CC": 1136,
      "O1CCCC1": 1137,
      "c1ccc2s": 1138,
      "C1=NC(C)=N": 1139,
      "O=C(NC)": 1140,
      "c(SC": 1141,
      "c1ccc(CCN": 1142,
      "c1ccc(CS": 1143,
      "N1C=CN=C1": 1144,
      "O=C1C=CC(": 1145,
      "SCC": 1146,
      "C(=N1)NC(=O)": 1147,
      "C1CCOC1": 1148,
      "ccn1": 1149,
      "C(=O)NCC1C=CC": 1150,
      "C1=CC=CC=C1N": 1151,
      "C(C)=O)": 1152,
      "=C)": 1153,
      "C(C)OC(=O)": 1154,
      "C(=O)NC1CC1": 1155,
      "C1=CC=C(F)C=C1F": 1156,
      "c1cc(=O)": 1157,
      "C1N=CC=NC=1": 1158,
      "C1=CC=C(Br)C=C1": 1159,
      "ncc2)": 1160,
      "c1cc[nH]c1": 1161,
      "N(C": 1162,
      "O=C(Cc1ccccc1)Nc1ccccc1": 1163,
      "CC1CCCC": 1164,
      "(-c3ccccc3)": 1165,
      "CC1CCCCC1": 1166,
      "C1NN=C(C=1)": 1167,
      "c1csc(-": 1168,
      "co3)": 1169,
      "C1=NN(C)C=C1": 1170,
      "CC1ON=C(N=1)": 1171,
      "CN(C)S(=O)(=O)": 1172,
      "CCNS(=O)(=O)": 1173,
      "C1COCCN1C(=O)": 1174,
      "C(=O)NCC1=CC=CC=C1": 1175,
      "CCOC)": 1176,
      "CC1OC=CC=1": 1177,
      "O=c1[nH]cn": 1178,
      "CC(=O)N(C)": 1179,
      "cc1)c1ccccc1": 1180,
      "n1cccn1": 1181,
      "CC1=CC=CC(": 1182,
      "n2)CC1": 1183,
      "CC1OC(C)": 1184,
      "=C(SC=1C)": 1185,
      "CCCC1)": 1186,
      "no1": 1187,
      "n1cc": 1188,
      "n2cccn": 1189,
      "CC1=CC=C(C)C=C1": 1190,
      "c4ccccc4": 1191,
      "CCCC2=O)": 1192,
      "N(N=1)": 1193,
      "SC(": 1194,
      "c1ccc(-n2ccn": 1195,
      "C1C=CN(N=1)": 1196,
      "oc2)": 1197,
      "c2ccc(": 1198,
      "cs3)": 1199,
      "c(CN2": 1200,
      "C1C(C)=CC=CC=1": 1201,
      "CC1=NOC(=N1)": 1202,
      "ncc3": 1203,
      "N(C1=O)": 1204,
      "c1ccc(=O)[nH]": 1205,
      "c1cncc(": 1206,
      "c2cncc": 1207,
      "c2ccs": 1208,
      "C1NCCC2": 1209,
      "CCN(CC2)C(=O)": 1210,
      "c1cccs1)N": 1211,
      "C1(CC1)": 1212,
      "C(NC)=O": 1213,
      "c1ccno1": 1214,
      "C1COCCC1": 1215,
      "N#CC1": 1216,
      "=C(OC=1C)": 1217,
      "O=C(CN1CC": 1218,
      "C1CCCCN1": 1219,
      "C(C)=CC=1": 1220,
      "[nH]1)N": 1221,
      "c1cnc(N2": 1222,
      "O=C(Nc1ccccc1": 1223,
      "CC2C1=CC=CC=2": 1224,
      "CCC#N)": 1225,
      "O=C(COc1ccccc1)N1CC": 1226,
      "C=CC2=C1": 1227,
      "no2)cc1": 1228,
      "C(C": 1229,
      "C1=CN(C)N=C1": 1230,
      "O=S(=O)(NCC": 1231,
      "C1=CC=C(C=C1)C#N": 1232,
      "O=C1OCC": 1233,
      "C(=O)OCC1": 1234,
      "C1=CC=CC=C1O": 1235,
      "=N1)NC(=O)": 1236,
      "n12)": 1237,
      "CCCN2": 1238,
      "C1CC(=O)N": 1239,
      "=NN(C)C=1": 1240,
      "N1CCCC1=O": 1241,
      "c3cn[nH]": 1242,
      "N1C=C(N=2)": 1243,
      "OC(C1)C": 1244,
      "C1COCCN1CC": 1245,
      "c2ccccn12": 1246,
      "C(=O)NC1": 1247,
      "c3ncc": 1248,
      "nn2": 1249,
      "O=C(CSc1nnc[nH]": 1250,
      "C(=O)N1CCCCC1": 1251,
      "C1=CC=CC=C1OCC": 1252,
      "C1=CC(Br)=CC=C1": 1253,
      "C(C)CC": 1254,
      "c2nnc[nH]": 1255,
      "C(N1)=CC=C(C=2)": 1256,
      "c1cn[nH]c1)N": 1257,
      "C2=N": 1258,
      "C1=CC=CN=2": 1259,
      "C(=O)CC": 1260,
      "C2C1=CC(=CC=2)": 1261,
      "O=C(c1ccccc1)": 1262,
      "3CCCCC3)": 1263,
      "c1s": 1264,
      "C1C(C)=CC": 1265,
      "N1=C(C)": 1266,
      "C1CCCC1)": 1267,
      "O=C(CCc1ccccc1)N": 1268,
      "C1C=C(Br)": 1269,
      "C(=O)NCCNC(=O)": 1270,
      "=NN1C": 1271,
      "CC1=CC=C(C=C1)OC": 1272,
      "N1N=C(S2)": 1273,
      "c1=O)Nc1ccccc1": 1274,
      "=c1[nH]": 1275,
      "O=C1CCC(": 1276,
      "OC1=CC=CC=C1": 1277,
      "3cccc": 1278,
      "(Br)": 1279,
      "CCNCC2)cc1": 1280,
      "C1C(OC)": 1281,
      "c1ccc(CO": 1282,
      "c1ccc[nH]c1=O": 1283,
      "CCNC(=O)N": 1284,
      "=C(C)SC=1": 1285,
      "#C": 1286,
      "CC#N": 1287,
      "NC(=O)CC": 1288,
      "Cl)NC(=O)": 1289,
      "=CC2=O)": 1290,
      "OC2C1=CC=CC=2": 1291,
      "c3ccccn3)": 1292,
      "C(C)=NOC=1": 1293,
      "C(CO)": 1294,
      "CN1C(C)": 1295,
      "C1N(C)N": 1296,
      "C(C)NC(=O)N": 1297,
      "c1)N1CCCCC1": 1298,
      "C(=O)N1CCN(CC1)C(=O)": 1299,
      "O(C)C(=O)": 1300,
      "C1=CC=C(C=C1)C(=O)N": 1301,
      "C1CCCCCC1": 1302,
      "c1ncno": 1303,
      "C1=CC=C(N)C=C1": 1304,
      "c(=O)o": 1305,
      "C(C)C(=O)N": 1306,
      "N1N=CC=C1": 1307,
      "C=CC(=N1)": 1308,
      "c3n2)cc1": 1309,
      "#N)": 1310,
      "c2cc[nH]": 1311,
      "c1ccc(-c2ccccc2)": 1312,
      "c2no": 1313,
      "C1=NC=CN1": 1314,
      "C=C(C=C1OC)": 1315,
      "ncc3)": 1316,
      "C1=NNC=C1": 1317,
      "C(=O)NCC1N": 1318,
      "c2nnn": 1319,
      "C(N)=N": 1320,
      "C2C1": 1321,
      "c1cncnc1": 1322,
      "OCCCO": 1323,
      "c2nccs2)cc1": 1324,
      "C1=COC=C1": 1325,
      "CN1C=CN=C1": 1326,
      "O=C(c1cccnc1)N1CC": 1327,
      "CC(=O)NCC": 1328,
      "C1=CC=C(C=C1F)": 1329,
      "c1ncccn": 1330,
      "N(C)N": 1331,
      "[nH]1)c1ccccc1": 1332,
      "CCOCC1)": 1333,
      "c1ccc2[nH]ccc2c1": 1334,
      "O=S(C)(=O)": 1335,
      "C1CCN(C1)": 1336,
      "NC(=O)NCC": 1337,
      "1)N1CCNCC1": 1338,
      "C(=O)NCC1=NN": 1339,
      "C1SN": 1340,
      "=N1)N": 1341,
      "c1cc(N2": 1342,
      "C1=NC2=CC=CC=C2": 1343,
      "C1=CNN=C1": 1344,
      "ON=C1C": 1345,
      "CCC1C": 1346,
      "CCCCC1": 1347,
      "O=c1cc(": 1348,
      "O=C(NCc1ccccc1)Nc1ccccc1": 1349,
      "C1=NC=C(C=2)": 1350,
      "(NC": 1351,
      "c2cc(": 1352,
      "F)N": 1353,
      "CCCO2)": 1354,
      "NC(C)=O": 1355,
      "c2ccc3c(c2)": 1356,
      "c1cc2c(s1)": 1357,
      "N#CC1=CC": 1358,
      "C(=C1C)": 1359,
      "C1=CC=CC2C1=CC=C(C=2)": 1360,
      "c1ccn2": 1361,
      "O=C1CN(C(=O)": 1362,
      "O=C(NCc1ccco1)": 1363,
      "COC)": 1364,
      "C1=NNC(=C1)": 1365,
      "CC=C)": 1366,
      "C1C(C)=CC=C(C=1)": 1367,
      "COCC1": 1368,
      "OCC)": 1369,
      "c2nco": 1370,
      "CC1=CC=C(S1)": 1371,
      "O=C1N(C)": 1372,
      "=CC=C2C=1N": 1373,
      "c2ccccc2)N1": 1374,
      "O=C(Oc1ccccc1)": 1375,
      "O=C(CCNC(=O)": 1376,
      "CC1=NN=C(O1)": 1377,
      "c(-c2cccs2)": 1378,
      "C1CCCN": 1379,
      "C(N2": 1380,
      "F)NC(=O)": 1381,
      "C(=C1)NC(=O)": 1382,
      "c1ccc(-n2ccnn2)cc1": 1383,
      "cc2N1": 1384,
      "=C(N1N)": 1385,
      "CC(C)C)": 1386,
      "=NNC=1": 1387,
      "CN1N=C(C)": 1388,
      "C1=NN=NN1": 1389,
      "N#CC": 1390,
      "C1=CC=C(N=N1)": 1391,
      "c(CS": 1392,
      "CC1=CC=CC=C1F": 1393,
      "CC1=CC(C)=CC=C1": 1394,
      "=C2OCOC2=C1": 1395,
      "C1C=C(C)N": 1396,
      "c(-c2ccco2)": 1397,
      "FC(F)O": 1398,
      "CN(CC)C(=O)": 1399,
      "C(=O)OCC(=O)N": 1400,
      "CN(C1CC1)": 1401,
      "CCC3": 1402,
      "CN1N=CC=C1": 1403,
      "O=C(NCc1ccccc1)NC": 1404,
      "=C(N1)": 1405,
      "c1ccc2c(c1)CCC2": 1406,
      "=C2C=1N": 1407,
      "c(-c4": 1408,
      "CCNCC3)": 1409,
      "=NN2C=1N": 1410,
      "c3cccnc3)": 1411,
      "O=c1cc[nH]": 1412,
      "c1ccc(-c2no": 1413,
      "c2scc": 1414,
      "C1OCCN(C1)": 1415,
      "c1cccc2cccn": 1416,
      "O=S1": 1417,
      "CN1CC(": 1418,
      "CN1N=CC(": 1419,
      "C(O1)": 1420,
      "NC1=O": 1421,
      "CC3": 1422,
      "[nH]n1": 1423,
      "N1C=CC=C2": 1424,
      "O=C(CNc1ccccc1)Nc1ccccc1": 1425,
      "c1ccccn1)N1CC": 1426,
      "C1C=CC=C2C=1OCC(": 1427,
      "C1=CC=C(O)": 1428,
      "OC2C1=CC=C(C=2)": 1429,
      "CN1CCOC(C1)": 1430,
      "c2ccccc21)Nc1ccccc1": 1431,
      "CC(F)(F)F": 1432,
      "c1nc(-c2ccccc2)": 1433,
      "N1C=CC=C1": 1434,
      "CC1=NOC(C)=C1": 1435,
      "C1=C(C)C=CC=C1": 1436,
      "O=C(Nc1cccc(-": 1437,
      "c1cnoc1)N": 1438,
      "C1CC(C)": 1439,
      "C1=CC(=NN1C)": 1440,
      "O=C1CCCN1c1ccccc1": 1441,
      "c1ccc(-n2cncn": 1442,
      "C(c1ccccc1)": 1443,
      "C2CC2)cc1": 1444,
      "C1=CC(O)": 1445,
      "O=C(CCS": 1446,
      "c3cn[nH]c3)": 1447,
      "=O)N": 1448,
      "CC1=C(C)": 1449,
      "O=C1CCCC": 1450,
      "S(=O)(=O)N(C)C": 1451,
      "c1cn[nH]c1)c1ccccc1": 1452,
      "C1=CC(C)=CC=C1C": 1453,
      "O=C(CN1CCN(": 1454,
      "C(=O)NCC1C": 1455,
      "CC(OC)": 1456,
      "=CC=CC=C2": 1457,
      "C1=CC=C(C=C1)O": 1458,
      "CCN(C1)": 1459,
      "o2)": 1460,
      "C1=NC=C(S1)": 1461,
      "c2ccccn12)": 1462,
      "CC1=CC=C(C=C1F)": 1463,
      "C1=CC=C(C)C(=C1)": 1464,
      "nnn1": 1465,
      "C1=CC=C(C)C=C1C": 1466,
      "c1ccc2ccccc2c1": 1467,
      "O=C(Nc1cccc2": 1468,
      "N1C=NN=C1": 1469,
      "C1C=CC=C2C=1CC(": 1470,
      "=CN(C1=O)": 1471,
      "C1=CC=NC(=C1)": 1472,
      "C1C=C(N)": 1473,
      "O=C(CNc1ccccc1)N": 1474,
      "o3)": 1475,
      "O1N": 1476,
      "O=C(Nc1ccccc1)c1cn": 1477,
      "=C(C=C1C)": 1478,
      "O=C(NCC1CCCO": 1479,
      "(C)OC(C1)C": 1480,
      "CC1)NC(=O)": 1481,
      "c1ccccn1)N": 1482,
      "c1ccc2c(c1)OCCO2)": 1483,
      "[nH]2)": 1484,
      "CCN(C(=O)": 1485,
      "C(=O)N(C1CC1)": 1486,
      "(-c2ccccc2)n1": 1487,
      "CC2C1=CC=C(C=2)": 1488,
      "NCC1)": 1489,
      "CC1C=CSC=1": 1490,
      "n[nH]2)cc1": 1491,
      "N=1": 1492,
      "c1cccnc1)c1ccccc1": 1493,
      "CC(=O)N(": 1494,
      "C1=CC(C)=CC=2": 1495,
      "CCC1N": 1496,
      "O=C(Cn1nn": 1497,
      "C1=CC=CC2C1=CC=CC=2": 1498,
      "CCC#N": 1499,
      "c1ccccc1)N1CCOCC1": 1500,
      "O=C(Cc1ccccc1)NC": 1501,
      "=C(S2)NC(=O)": 1502,
      "n2cnnn": 1503,
      "O=C(OCC": 1504,
      "3CCCC3)": 1505,
      ")=O": 1506,
      "CCN(CC)C(=O)": 1507,
      "C1(c2ccccc2)": 1508,
      "C1=C(N)": 1509,
      "c1ccc2c(c1)N": 1510,
      "OCCO2": 1511,
      "c1cnn(-c2ccccc2)c1": 1512,
      "=NN(C)C=1C": 1513,
      "CN1C=CC": 1514,
      "c1cccnc1)N": 1515,
      "CC1=NN=C2": 1516,
      "O=C(c1cco": 1517,
      "O=C(c1ccccc1)N1CCN(": 1518,
      "O=C1CC(C(=O)N": 1519,
      "N1=CC=CN1": 1520,
      "C1C=CC=C(C)C=1": 1521,
      "C(C)=NOC=1C": 1522,
      "n3cccn3)": 1523,
      "=NC(=C1)": 1524,
      "=C(N=1": 1525,
      "c1cc(C2CC2)": 1526,
      "c1ccc(-n2cnnn2)cc1": 1527,
      "O=C(NCc1cn": 1528,
      "O=C(C)N1CC": 1529,
      "=C(C1=O)": 1530,
      "c1cc2ccccc2o1": 1531,
      "n2cccn2)": 1532,
      "c1ccc(-n2cccn2)": 1533,
      "(Cc1ccccc1)": 1534,
      "O=C(Nc1nncs1)": 1535,
      "n1)Nc1ccccc1": 1536,
      "FC1C=CC=C(C=1)": 1537,
      "ON=1": 1538,
      "CS(=O)(=O)": 1539,
      "c1c[nH]c2ccccc12": 1540,
      "CC1=CC=C(Cl)": 1541,
      "S(=O)(=O)NCC": 1542,
      "Cl)N": 1543,
      "1)N1CCC(": 1544,
      "C1OCCC1": 1545,
      "C1NN=C(N=1)": 1546,
      "CN1N=CC(=C1)": 1547,
      "O=C(CCC(=O)": 1548,
      "C(=O)NC(C)C": 1549,
      "CN(CC)": 1550,
      "c2nc[nH]": 1551,
      "C(=O)NCCCC": 1552,
      "O=C(NCCNC(=O)": 1553,
      "O=C(Cc1cscn": 1554,
      "CCC1=CN": 1555,
      "C1NCC": 1556,
      "O=C(NCc1cccnc1)": 1557,
      "CC1ON=C(C)C=1": 1558,
      "n1C": 1559,
      "=C(CC)": 1560,
      "C(=O)NCCC": 1561,
      "C1C(O)": 1562,
      "S(=O)(N)=O": 1563,
      "C(=O)NCCO": 1564,
      "C1=CC=C(C=C1)NC(C)=O": 1565,
      "O=c1[nH]c2ccccc2": 1566,
      "s3)": 1567,
      "3)c1": 1568,
      "C1=CC(N)=CC=C1": 1569,
      "C=C2": 1570,
      "C1=CC=C(S1)": 1571,
      "C1=CC=C(N=2)": 1572,
      "O=C1COc2ccccc2N1": 1573,
      "C1=CC(F)=CC=2": 1574,
      "O=C(Nc1ccccc1)c1cccnc1": 1575,
      "O=C(c1ccc[nH]": 1576,
      "C(=O)N1": 1577,
      "=C(N=C1)": 1578,
      "CC1=NN(C)": 1579,
      "cnc2)": 1580,
      "C1=CC=CC(C)": 1581,
      "C2(C1)": 1582,
      "O=S(=O)(c1ccccc1)N1CCCCC1": 1583,
      "[nH]1)Nc1ccccc1": 1584,
      "c1nccs1)c1ccccc1": 1585,
      "c1cccc2cccc": 1586,
      "(C)NC(=O)": 1587,
      "N#CC1=CC=CC=C1": 1588,
      "COC1=CC=C(C=C1F)": 1589,
      "CN1CC(CC1=O)": 1590,
      "c2o": 1591,
      "C(C2)": 1592,
      "c1ccc2c(c1)CCN2": 1593,
      "O=C(CCO": 1594,
      "N1CCCCC1)": 1595,
      "cc12)": 1596,
      "C(=O)N(CC)CC": 1597,
      "C1=CC=C(F)C(=C1)": 1598,
      "O=C(Nc1cccnc1)": 1599,
      "c1ccc(-c2ncc": 1600,
      "C(S1)": 1601,
      "c2c(s1)": 1602,
      "S(N)(=O)=O": 1603,
      "C1=CC=C(C)C(": 1604,
      "C(=O)N(C)C(C)": 1605,
      "CC(=O)OCC": 1606,
      "CC1C(C)": 1607,
      "c1ccc(=O)[nH]c1": 1608,
      "C1N(C)N=CC=1": 1609,
      "C1C=C(O)": 1610,
      "c1nco": 1611,
      "CC1SC=CC=1": 1612,
      "CC1CO": 1613,
      "CC1=CC=CO1": 1614,
      "c1ccc(CNC": 1615,
      "CCOC1=CC=C(C=C1)": 1616,
      "C1=NC=CC=N1": 1617,
      "C1C=CC=C2C=1OC(": 1618,
      "O=C(NC1CCCC1)": 1619,
      "c2ccccc2O": 1620,
      "CC1=CC=CC2": 1621,
      "CC(C)(C)NC(=O)": 1622,
      "C1=NC=C2": 1623,
      "N1=NN": 1624,
      "N=C2": 1625,
      "=C(C)C(=C1C)": 1626,
      "c1ccccn1)c1ccccc1": 1627,
      "ncc2c1": 1628,
      "=COC=1C": 1629,
      "C1=NC=CS1": 1630,
      "O=C(Nc1ccc2c(c1)": 1631,
      "CN(CC2)": 1632,
      "c1nc[nH]": 1633,
      "C(=O)NCC(=O)": 1634,
      "c2ccccc2)CCN1": 1635,
      "ncnc2": 1636,
      "C(C)=NN(C=1C)": 1637,
      "C1N=CC=CN=1": 1638,
      "O=c1c2ccccc2": 1639,
      "O=C(c1cccs": 1640,
      "C(=O)NC1SC=C(N=1)": 1641,
      "C1CC=CC": 1642,
      "C1C(F)=CC": 1643,
      "Cn2": 1644,
      "O=C1CC2": 1645,
      "c1ccc(CC": 1646,
      "cc2c1": 1647,
      "N1N=CC(=C1)": 1648,
      "N(CC)C(=O)": 1649,
      "O=c1[nH]n": 1650,
      "=C(N1CC": 1651,
      "c2c[nH]": 1652,
      "CCC(=O)N1CC": 1653,
      "O=C(CS(=O)(=O)": 1654,
      "C1=C2OCOC2": 1655,
      "CC1(": 1656,
      "N1C=CC=N1": 1657,
      "=CN2C1=NC(=C2)": 1658,
      "c1ncc2": 1659,
      "O=S(N)": 1660,
      "=C(C#N)": 1661,
      "C1=CC=CN1": 1662,
      "O=C(COc1ccccc1)NC": 1663,
      "CCOC1=CC=CC=C1": 1664,
      "C(=O)NC1=NN=C(S1)": 1665,
      "O=C(N)N": 1666,
      "on1": 1667,
      "(CN": 1668,
      "O=c1o": 1669,
      "CCN(C)": 1670,
      "C1C(F)=CC=C2C=1": 1671,
      "N1C=CSC=1": 1672,
      "c1cc2ccccc2o": 1673,
      "C(=O)NC(C)CC": 1674,
      "CCC1ON=C(N=1)": 1675,
      "C1=NNC(=N1)": 1676,
      "FC1=CC=C(F)C=C1": 1677,
      "c2c1)": 1678,
      "C1=NC=NC=2": 1679,
      "CC=C": 1680,
      "OCCOC": 1681,
      "CC1=CC=CS1": 1682,
      "CS1": 1683,
      "=C(C=1C)": 1684,
      "O=C(CCn1cccn": 1685,
      "C#N)NC(=O)": 1686,
      "NC(=O)CO": 1687,
      "=C(F)C=1": 1688,
      "O=S(=O)(Nc1ccccc1)": 1689,
      "c1ccc(-c2cc[nH]": 1690,
      "n1-c1ccccc1": 1691,
      "CC1=CC=C(Cl)C=C1": 1692,
      "CC1=C(C)N": 1693,
      "c32)cc1": 1694,
      "O=C(NCc1ccco": 1695,
      "CC1N(C)N": 1696,
      "OC=1C": 1697,
      "n2c1": 1698,
      "C2CCCC=2": 1699,
      "C(=O)NCC1=N": 1700,
      "CC1=CC=NC=C1": 1701,
      "C1=C(Br)": 1702,
      "3c(": 1703,
      "C(=O)NCC1=CC=C(C=C1)": 1704,
      "C1SC(C)=N": 1705,
      "c1cc2ccccc2[nH]1": 1706,
      "O=C(CSc1ncc": 1707,
      "c2ccccc2O1": 1708,
      "c2cccnc2)cc1": 1709,
      "C1=CC=CC(=C1)F": 1710,
      "C(N1)=O": 1711,
      "=NC2N1N=C(N=2)": 1712,
      "C1C2=CC": 1713,
      "CCCC(=O)": 1714,
      "S1C=CN=C1": 1715,
      "O=C(NCc1nc2ccccc2": 1716,
      "CCCCC2)cc1": 1717,
      "CC1CCO": 1718,
      "O=C(Cn1cccc": 1719,
      "CCN(C)C(=O)": 1720,
      "(Br)=CC=1": 1721,
      "C1CCC2": 1722,
      "c1cncc(-": 1723,
      "O1CCCO": 1724,
      "CCC(C)": 1725,
      "C1C=C(F)C=C2C=1": 1726,
      "C1=CC(F)=CC=C1F": 1727,
      "C2(CC1)": 1728,
      "C1SC=NC=1": 1729,
      "O=S(N)(=O)": 1730,
      "C2C(N1)=CC=C(C=2)": 1731,
      "c2ccccc2)CN1": 1732,
      "O=C(Nc1cn[nH]c1)": 1733,
      "CCO2": 1734,
      "CN1C=CC2": 1735,
      "O=C(c1ccco": 1736,
      "C1=NN=C(N1C)": 1737,
      "c4c(": 1738,
      "O=C(NCCN": 1739,
      "c1)N1CCCC1": 1740,
      "OC(C)C": 1741,
      "C1SC=CN=1": 1742,
      "N1CCCC(": 1743,
      "(O)=CC=1": 1744,
      "C1=CC=C(O1)C": 1745,
      "O=C(NCC(=O)": 1746,
      "COC1C=CC=C(C=1)": 1747,
      "sc2)": 1748,
      "C1N2": 1749,
      "NCCc3ccccc3": 1750,
      "C(C)C)C(=O)": 1751,
      "CCC(=O)": 1752,
      "c1cccc(N2": 1753,
      "O=c1cccc": 1754,
      "C1=NC(C)=C(S1)": 1755,
      "C1C2=CC=CC=C2": 1756,
      "3CCNCC3)": 1757,
      "C(=N2)": 1758,
      "ClC1=CC=C(C=C1Cl)": 1759,
      "CC1=CC(C)=NN1": 1760,
      "ncc12": 1761,
      "C1CCCN2": 1762,
      "c2sccc2": 1763,
      "c1cccs1)c1ccccc1": 1764,
      "O=C(CSc1ncn": 1765,
      "c(C4": 1766,
      "c1scnc1": 1767,
      "CC(N": 1768,
      "C1=CN=CC=N1": 1769,
      "C(=O)c2cc": 1770,
      "N1C(=O)N": 1771,
      "CC1CC2": 1772,
      "O=C1CN": 1773,
      "C1=CSC(=N1)NC(=O)": 1774,
      "n1cccn1)": 1775,
      "NC(=O)CS": 1776,
      "C#N)N": 1777,
      "CN1N=NN=C1": 1778,
      "c2ncccn2": 1779,
      "(CC": 1780,
      "CN1C(=O)N": 1781,
      "O(C)C1=CC=C(C=C1)": 1782,
      "cn2)cc1": 1783,
      "O=C(Nc1cccc(": 1784,
      "O=c1[nH]cc": 1785,
      "O1CCOC12": 1786,
      "CNC(=O)NCC": 1787,
      "O=S(=O)(N)": 1788,
      "c2cccc3": 1789,
      "c3ccccc2": 1790,
      "N1C=CC=NC=1": 1791,
      "C1CCCNC1": 1792,
      "c(Cc2ccccc2)": 1793,
      "=CC1=O": 1794,
      "CCN1C": 1795,
      "C1=NC=NN1": 1796,
      "c1cc(N": 1797,
      "cn[nH]": 1798,
      "S(=O)(=O)N(": 1799,
      "n2)nc1": 1800,
      "c2ccccc2c1=O": 1801,
      "O=C(NCc1cccs1)": 1802,
      "CCC1C2": 1803,
      "O=C(NCCOc1ccccc1)": 1804,
      "C1=C(C)ON=C1": 1805,
      "n2cccc": 1806,
      "=C(C)NC1=O": 1807,
      "N1=CC=CN=C1": 1808,
      "C(O2)": 1809,
      "N1CCCCCC1": 1810,
      "c1ccsc1)N": 1811,
      "C1=C(OC)C=C(C=C1OC)": 1812,
      "(-c2ccccc2)nn1": 1813,
      "=CN=CC=1": 1814,
      "C(N2)": 1815,
      "=CC(F)=C1": 1816,
      "O=c1ccc2ccccc2": 1817,
      "n2ccn": 1818,
      "C(=O)NCC(O)": 1819,
      "c2ccccn2": 1820,
      "CC1NN": 1821,
      "C1C=C(Br)C=CC=1": 1822,
      "=C(N=1)N": 1823,
      "C1=CN=C2": 1824,
      "CC4)": 1825,
      "c2cn[nH]c2)cc1": 1826,
      "COC1=CC=C(Cl)C=C1": 1827,
      "C(=O)N1CCOC(C1)": 1828,
      "CC1=CC=CC=C1C": 1829,
      "c1ccccn1)Nc1ccccc1": 1830,
      "cnn": 1831,
      "C(C(N)=O)": 1832,
      "C1=NC=NC2=C1": 1833,
      "CC1=CC=C(C=C1)N": 1834,
      "C1=NC=CN=C1": 1835,
      "C1=NOC(C)=C1": 1836,
      "=CC(=N1)": 1837,
      "NC(=O)N(C)": 1838,
      "c1c[nH]nc1": 1839,
      "O=C(Nc1ccccc1)N1CCCCC1": 1840,
      "O=c1cc(-c2ccccc2)": 1841,
      "=CC=CC=2": 1842,
      "CS1(=O)=O": 1843,
      "O=C1CCCN1CC": 1844,
      "O=C(CNC(=O)c1ccccc1)N": 1845,
      "C1=CC=C(C=C1N)": 1846,
      "C1N=NN(C=1)": 1847,
      "CN1C=NN=C1": 1848,
      "O=C(Cc1ccc[nH]": 1849,
      "O=C1NC(": 1850,
      "CCC1CC": 1851,
      "-c2ccccc2)cc1": 1852,
      "C1CCCC1NC(=O)": 1853,
      "=O)Nc1ccccc1": 1854,
      "C1=CC=C2OCOC2=C1": 1855,
      "=CC=CC=1F": 1856,
      "COC1=CC=C(C)C=C1": 1857,
      "C1=NN(": 1858,
      "c2cscn2)": 1859,
      "CC1=CO": 1860,
      "OCCNC(=O)": 1861,
      "O=C(NCc1ccncc1)": 1862,
      "c2ncccn2)CC1": 1863,
      "O=S(=O)(O": 1864,
      "C(=O)NC1CCCC1": 1865,
      "c1ccc(=O)[nH]n1": 1866,
      "NC1": 1867,
      "=NC2": 1868,
      "CNCC1": 1869,
      "C1C=CC=C2C=1C=C(O2)": 1870,
      "CC1=CC(F)": 1871,
      "=C(O1)N": 1872,
      "C2=CC=CC=C2N=C1": 1873,
      "N1N=C(C)C=C1C": 1874,
      "CCN1CCOCC1": 1875,
      "COC1=CC=C(OC)C=C1": 1876,
      "C(C)CC1": 1877,
      "C1C=CC(Br)=CC=1": 1878,
      "C1C=CC=C2C=1OCC(O2)": 1879,
      "c1ccc(OC2": 1880,
      "c1nc(-c2cc": 1881,
      "C1=CC=C2C(=C1)": 1882,
      "O=C(NCc1cscn": 1883,
      "c1ccc(-c2cc[nH]n2)cc1": 1884,
      "COC2C1=CC=C(C=2)": 1885,
      "CC1=CC=CC=N1": 1886,
      "c1ccc(COc2ccccc2)cc1": 1887,
      "C1=C2OCOC2=CC=C1": 1888,
      "ccc12": 1889,
      "CN1CCCC1": 1890,
      "CC#C": 1891,
      "C1C=NN(C)C=1": 1892,
      "C1=NC(C)=CC=2": 1893,
      "c1ccccc1)N1CCCC1": 1894,
      "O=C(Nc1ccc2[nH]": 1895,
      "C1=CC=C(C=C1)CC": 1896,
      "O=C(NCc1ccccn1)": 1897,
      "C(CC)=O": 1898,
      "O=C(CNC(=O)N": 1899,
      "C2=C1C=CC=C2": 1900,
      "c1cnoc1)": 1901,
      "c[nH]2)cc1": 1902,
      "C(=O)OC(C)": 1903,
      "N1OC(C)": 1904,
      "c2ncccc2": 1905,
      "c3ccccc3)ccc2N1": 1906,
      "=C(C=C2)": 1907,
      "c2ncnc3[nH]": 1908,
      "(-c3cc": 1909,
      "c1cnn(": 1910,
      "C1=CC=C(C=N1)NC(=O)": 1911,
      "c(-c3ccncc3)": 1912,
      "O=C1CCC": 1913,
      "C1=CC(=O)N": 1914,
      "C1=CC=CC2C1=NC=CC=2": 1915,
      "O=C(NCCc1ccccc1)c1ccccc1": 1916,
      "c2ccn": 1917,
      "c2ccccc2C1)": 1918,
      "CC(C)CNC(=O)": 1919,
      "NCCc3ccccc32)cc1": 1920,
      "O=S": 1921,
      "C2C1=CC=CN=2": 1922,
      "N(CC)CC": 1923,
      "OC(F)F": 1924,
      "O=C(c1ccccc1)N1CCNCC1": 1925,
      "N1N=CN=C1": 1926,
      "O=C(NC1CCN(": 1927,
      "C(=O)NCCN": 1928,
      "O=C(Cn1n": 1929,
      "#N": 1930,
      "O=S(C)(=O)N": 1931,
      "c1cnc2[nH]ncc2": 1932,
      "OCC1)": 1933,
      "CC1SC=C(N=1)": 1934,
      "CCOc1ccccc1": 1935,
      "1)N1CCCC(": 1936,
      "c2ccccc2c1=O)": 1937,
      "OCO3)": 1938,
      "C=CC(=C2)": 1939,
      "C1C=C(O)C=CC=1": 1940,
      "C=C(C)": 1941,
      "C1(CCCC1)": 1942,
      "CCCCO": 1943,
      "CC12": 1944,
      "FC1C=CC": 1945,
      "c1coc(-": 1946,
      "c4)": 1947,
      "CCC(C)NC(=O)": 1948,
      "c1ccccc1)N1CCNCC1": 1949,
      "CCC3)": 1950,
      "O=C(CSc1ccccc1)N": 1951,
      "c1ccc(CC2": 1952,
      "c2ncccn2)": 1953,
      "C2)nc1": 1954,
      "C1=NN2": 1955,
      "C(=O)N1CCC(": 1956,
      "C2CCCCC2)": 1957,
      "c1)N1CCOCC1": 1958,
      "C(=O)NCC(C)": 1959,
      "c2ccncn2)cc1": 1960,
      "c2n[nH]": 1961,
      "C1=CC=C(O)C=C1": 1962,
      "NC(=O)C1=CC=C(C=C1)": 1963,
      "c2ccncc": 1964,
      "N1=CC=NC=C1": 1965,
      "(OC)": 1966,
      "n2cncn": 1967,
      "C1=CC(OC)=CC=C1OC": 1968,
      "C1=NN=C2N1N=C(S2)": 1969,
      "c2ccccc21)c1ccccc1": 1970,
      "CC(=O)N1CCCC1": 1971,
      "O=C(NCc1cco": 1972,
      "N1CCC2": 1973,
      "COC1=CC(OC)=CC=C1": 1974,
      "nc2ccccc12": 1975,
      "c1nc2ncccn2": 1976,
      "N1N=CC2": 1977,
      "=C(Cl)C=C1": 1978,
      "c2ccc(-": 1979,
      "O=S(=O)(NCc1ccccc1)c1ccccc1": 1980,
      "C1N=CN=C2C=1": 1981,
      "C1OC": 1982,
      "C1=NN=C(S1)NC(=O)": 1983,
      "C1=CC=CC(=C1)Cl": 1984,
      "c1ccc(CCNC": 1985,
      "O=C(Nc1nc2ccccc2": 1986,
      "O=C(Nc1ccc(": 1987,
      "ClC1C=CC=C(C=1)": 1988,
      "[nH]c1=O)": 1989,
      "C2CCCCC=2": 1990,
      "c1nc2ccccc2[nH]1": 1991,
      "C1N=NN(N=1)": 1992,
      "C1C(N)": 1993,
      "c1cnc2ccccc2": 1994,
